{
  "title": "Единый вид приложений Qt и GTK",
  "url": "https://wiki.archlinux.org/title/%D0%95%D0%B4%D0%B8%D0%BD%D1%8B%D0%B9_%D0%B2%D0%B8%D0%B4_%D0%BF%D1%80%D0%B8%D0%BB%D0%BE%D0%B6%D0%B5%D0%BD%D0%B8%D0%B9_Qt_%D0%B8_GTK",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- GTK (Русский)\n- Qt (Русский)\n\nПрограммы, основанные на Qt и GTK, используют разные способы отображения графического интерфейса. Они используют различные темы, стили, иконки и многие другие вещи, так что программы, сделанные на разном инструментарии, выглядят непохоже друг на друга. Эта статья поможет сделать приложения Qt и GTK выглядящими более согласованно.\n\n"
    },
    {
      "title": "Обзор",
      "level": 2,
      "content": "Чтобы добиться схожего внешнего вида, вам понадобится изменить следующее:\n\n- Тема - Набор стилей, тема иконок и цветовая схема.\n- Стиль - Внешний вид виджетов.\n- Тема значков - Глобальный набор значков.\n- Цветовая схема - Глобальный набор цветов, используемый в сочетании со стилем.\n\nМожно выбрать два разных подхода:\n\n- Выбрать стили отдельно для GTK и Qt с помощью перечисленных ниже инструментов и постараться выбрать похожие темы (стиль, цвета, иконки, курсоры, шрифты).\n- Использовать специальные движки тем, которые конвертируют стили одного инструментария в стили другого, чтобы он соответствовал вашему основному инструментарию.\n\n"
    },
    {
      "title": "Стили для Qt и GTK",
      "level": 2,
      "content": "Существуют стили, которые реализованы как для Qt, так и для GTK. С их помощью вы можете иметь единый внешний вид для всех приложений независимо от того, с помощью какого инструментария они были написаны.\n\n"
    },
    {
      "title": "Breeze",
      "level": 3,
      "content": "Breeze — это стиль Qt по умолчанию в KDE Plasma. Его можно установить с помощью пакета breeze для Qt5, пакета breeze-kde4AUR[ссылка недействительна: package not found] для Qt4 и пакета breeze-gtk для GTK 2 и GTK 3.\n\nПосле установки вы можете использовать один из многочисленных инструментов настройки GTK, чтобы изменить тему GTK.\n\nЕсли у вас KDE Plasma, установите kde-gtk-config, перелогиньтесь и перейдите в Параметры системы (systemsettings), раздел Внешний вид > Оформление приложений > Настроить оформление приложений GNOME/GTK. Шрифты, темы значков, курсоры и стили виджетов, установленные в настройках KDE, автоматически влияют на настройки GTK; ручной выбор требуется только для темы GTK.\n\n"
    },
    {
      "title": "Adwaita",
      "level": 3,
      "content": "Adwaita является стандартной темой GNOME. Версия для GTK 3 входит в состав пакета gtk3, а версия GTK 2 находится в gnome-themes-extra. adwaita-qt — это Qt-порт темы Adwaita. В отличие от #QGtkStyle, который подражает теме GTK 2, он является полноценным стилем Qt. Его можно установить с помощью пакетов adwaita-qt4AUR, adwaita-qt5-gitAUR и adwaita-qt6-gitAUR для версий Qt 4, 5 и 6 соответственно.\n\nЧтобы использовать Adwait в качестве стиля Qt по умолчанию:\n\n- Для Qt4 используется Конфигурация Qt (qtconfig-qt4), выберите adwaita в пункте Внешний вид > Стиль интерфейса. Также можно отредактировать файл /etc/xdg/Trolltech.conf (общесистемный) или ~/.config/Trolltech.conf (пользовательский):\n\n```\n~/.config/Trolltech.conf\n```\n\n```\n...\n[Qt]\nstyle=adwaita\n...\n```\n\n- Для Qt5 можно задать переменную окружения QT_STYLE_OVERRIDE=adwaita или использовать qt5ct (смотрите Qt (Русский)#Настройка приложений Qt 5 в средах, отличных от KDE Plasma).\n\n"
    },
    {
      "title": "Kvantum",
      "level": 3,
      "content": "kvantum — это настраиваемый движок тем на основе SVG для Qt5, который поставляется с множеством встроенных стилей, включая версии некоторых популярных тем GTK, таких как Adapta, Arc, Ambiance, Materia.\n\n"
    },
    {
      "title": "Движки тем",
      "level": 2,
      "content": "Движок тем (theme engine) можно представить как тонкий API, который конвертирует темы (кроме иконок) между одним или несколькими инструментариями. Эти движки выполняют дополнительный код в процессе работы, так что такое решение не столь элегантно и оптимально, как использование родных стилей.\n\n"
    },
    {
      "title": "QGtkStyle",
      "level": 3,
      "content": "Этот стиль Qt использует GTK 2 для рендеринга всех компонентов, чтобы быть похожим на GNOME и другие среды, ипользующие GTK. Начиная с Qt 4.5, этот стиль входит в состав Qt. Он требует установки и настройки gtk2.\n\nЭто стиль Qt4 по умолчанию в Cinnamon, GNOME и Xfce, и стиль Qt5 по умолчанию в Cinnamon, GNOME, MATE, LXDE и Xfce. В других средах:\n\n- Для Qt4 используется Конфигурация Qt (qtconfig-qt4), выберите GTK в пункте Внешний вид > Стиль интерфейса. Также можно отредактировать файл /etc/xdg/Trolltech.conf (общесистемный) или ~/.config/Trolltech.conf (пользовательский):\n\n```\n~/.config/Trolltech.conf\n```\n\n```\n...\n[Qt]\nstyle=GTK+\n...\n```\n\n- Для Qt 5 установите qt5-stylepluginsAUR и задайте переменную окружения QT_QPA_PLATFORMTHEME=gtk2\n- Для Qt 6 установите qt6gtk2AUR и выберите стиль qt6gtk2 в настройках qt6ct или задайте переменную окружения QT_QPA_PLATFORMTHEME=qt6gtk2\n\nДля полного единообразия убедитесь, что выбранная тема GTK поддерживает как GTK 2, так и GTK 3. Если тема имеет несогласованный рендеринг после переключения Qt на стиль GTK2, установите gtk-theme-switch2AUR и выберите тему.\n\n"
    },
    {
      "title": "QGnomePlatform",
      "level": 3,
      "content": "Эта тема применяет настройки внешнего вида GNOME для Qt-приложений. Она может быть установлена с помощью пакета qgnomeplatform-qt5AUR или qgnomeplatform-qt6AUR (разрабатываемая версия доступна в пакете qgnomeplatform-qt5-gitAUR или qgnomeplatform-qt6-gitAUR). Она не предоставляет сам стиль Qt, вместо этого требуется стиль, поддерживающий как Qt, так и GTK.\n\nЭта тема используется по умолчанию в GNOME с версии 3.20. Для других систем её можно включить через переменную окружения QT_QPA_PLATFORMTHEME=gnome.\n\n"
    },
    {
      "title": "Использование значков GTK в приложениях Qt",
      "level": 3,
      "content": "Если у вас Plasma, запустите kde-gtk-config и выберите нужные значки в разделе Параметры системы > Внешний вид.\n\nЕсли у вас GNOME, запустите dconf-editor и измените ключ icon-theme по адресу org > gnome > desktop > interface, прописав желаемую тему значков.\n\nЕсли вы не используете среду рабочего стола (например, если у вас минималистичная система с i3-wm), установите пакет dconf-editor и измените тему значков как описано выше. Вам также может понадобиться прописать переменную окружения DESKTOP_SESSION.\n\n```\n$ awk -F= '/icon-theme/ {print $2}' ~/.gtkrc-2.0\n```\n\n"
    },
    {
      "title": "Добавление рамки окна и строки заголовка в приложениях GTK3, запущенных в KDE Plasma",
      "level": 3,
      "content": "Установите пакет gtk3-nocsd-gitAUR и перезапустите оконный менеджер. Также можно запустить приложение GTK через обёртку:\n\n```\n$ gtk3-nocsd gedit\n```\n\n"
    },
    {
      "title": "Улучшение субпиксельного рендеринга приложений GTK, запущенных в KDE Plasma",
      "level": 3,
      "content": "Смотрите Настройка шрифтов#LCD filter (ЖК-фильтр).\n\n"
    },
    {
      "title": "Согласованный диалог выбора файлов",
      "level": 3,
      "content": "Если вы хотите иметь одинаковый внешний вид диалога выбора файлов в приложениях GTK и Qt, можно использовать порталы XDG.\n\nУстановите пакеты xdg-desktop-portal and xdg-desktop-portal-kde и пропишите переменную окружения GTK_USE_PORTAL=1 в файле /etc/environment.\n\nИмейте в виду, что не во всех приложениях GTK это работает корректно. Например, Thunderbird поддерживает это.\n\nПриложения на основе Electron должны использовать как минимум Electron 14 (смотрите #19159) и корректно реализовывать эту функцию. Для vscode есть pull request.\n\nMeld 3.20.3-1 использует диалог gtk; версия 3.21.1 из meld-gitAUR использует диалог kde, но не может открывать каталоги.\n\nВ GIMP это не реализовано.\n\n```\nawk -F\\\" '/<bookmark href=\\\"file/ {print $2}' < $HOME/.local/share/user-places.xbel > $HOME/.config/gtk-3.0/bookmarks\n```\n\n"
    },
    {
      "title": "Темы в приложениях GTK не работают",
      "level": 3,
      "content": "Если установленные вами стили или темы не отображаются в ваших GTK-приложениях, то, скорее всего, файлы настроек GTK по какой-то причине не загружаются. Вы можете проверить, где ваша система ожидает найти эти файлы, выполнив следующее:\n\n```\n$ export | grep gtk\n```\n\nДля GTK2 файлы обычно лежат в ~/.gtkrc2.0 или ~/.gtkrc2.0-kde.\n\n"
    },
    {
      "title": "После обновления системы приложения GTK не используют значки svg (breeze)",
      "level": 3,
      "content": "Для исправления выполните следующую команду:\n\n```\n# gdk-pixbuf-query-loaders --update-cache\n```\n\n"
    },
    {
      "title": "Приложения Flatpak Qt не используют тему Adwaita dark",
      "level": 3,
      "content": "Установите нужный KStyle:\n\n```\n# flatpak install flathub org.kde.KStyle.Adwaita\n```\n\n"
    },
    {
      "title": "Приложения Qt, запущенные на GNOME Wayland, имеют отличающееся оформление рамки окна даже после установки темы Qt",
      "level": 3,
      "content": "Установите qgnomeplatform-qt5AUR и пропишите переменную окружения QT_QPA_PLATFORMTHEME='gnome'. Это точно работает с темами Adwaita и Adwaita-dark.\n\n"
    },
    {
      "title": "Приложения GTK используют настройки KDE не полностью",
      "level": 3,
      "content": "Для более хорошей интеграции с Plasma попробуйте установить gnome-settings-daemon, gsettings-desktop-schemas и gsettings-qt.\n\n"
    },
    {
      "title": "Отсутствует меню \"GTK\" в kde-gtk-config",
      "level": 3,
      "content": "Если kde-gtk-config по каким-то причинам не работает и в системных настройках KDE не появляется возможность настройки приложений GTK, можно использовать инструменты настройки GTK. Например, можно использовать lxappearance: хоть он и является частью проекта LXDE, он не привязан к среде рабочего стола и может быть установлен отдельно от LXDE.\n\n"
    },
    {
      "title": "Внешний вид Dolphin не полностью соответствует Nautilus",
      "level": 3,
      "content": "Смотрите Dolphin#Mismatched folder view background colors.\n\n"
    }
  ]
}