{
  "title": "Зеркала",
  "url": "https://wiki.archlinux.org/title/%D0%97%D0%B5%D1%80%D0%BA%D0%B0%D0%BB%D0%B0",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Неофициальные зеркала\n- pacman (Русский)\n\nНа этой странице представлено руководство по выбору и настройке зеркал, а также список зеркал, доступных в настоящее время.\n\n"
    },
    {
      "title": "Официальные зеркала",
      "level": 2,
      "content": "Список официальных зеркал предоставляется пакетом pacman-mirrorlist. Наиболее свежий список зеркал доступен на странице Pacman Mirrorlist Generator.\n\nПроверить статус зеркал Arch возможно на странице Mirror Status. Рекомендуется использовать только актуальные (синхронизированные) зеркала.\n\nЕсли вы хотите добавить своё зеркало в официальный список, см. DeveloperWiki:NewMirrors. Тем временем добавьте его в статью Неофициальные зеркала.\n\n"
    },
    {
      "title": "IPv6-зеркала",
      "level": 3,
      "content": "Pacman Mirrorlist Generator можно также использовать для получения списка доступных IPv6-зеркал.\n\n"
    },
    {
      "title": "Включение определённого зеркала",
      "level": 2,
      "content": "Чтобы включить зеркала, откройте файл /etc/pacman.d/mirrorlist и найдите ваш географический регион, после чего раскомментируйте необходимые зеркала.\n\nНапример:\n\n```\n## Worldwide\n#Server = https://geo.mirror.pkgbuild.com/$repo/os/$arch\n#Server = http://mirror.rackspace.com/archlinux/$repo/os/$arch\nServer = https://mirror.rackspace.com/archlinux/$repo/os/$arch\n```\n\nСм. #Сортировка зеркал для получения информации об утилитах по выбору зеркал.\n\n- Раскомментируйте 5 наиболее подходящих зеркал и поместите их наверху файла mirrorlist. Таким образом, их можно легко найти и поменять приоритет в случае возникновения проблем с первым зеркалом в списке. Это также упрощает слияние файлов mirrorlist при обновлении.\n- HTTP-зеркала быстрее FTP-зеркал из-за постоянного HTTP-соединения — в случае с FTP, необходимо устанавливать новое соединение с сервером при каждом запросе pacman на скачивание, что приводит к небольшим задержкам.\n\nТакже можно указать зеркала в /etc/pacman.conf. В случае с репозиторием core, по умолчанию это выглядит следующим образом:\n\n```\n[core]\nInclude = /etc/pacman.d/mirrorlist\n```\n\nЧтобы использовать зеркало kernel.org как зеркало по умолчанию, добавьте зеркало перед строкой Include:\n\n```\n[core]\nServer = https://mirrors.kernel.org/archlinux/$repo/os/$arch\nInclude = /etc/pacman.d/mirrorlist\n```\n\nТеперь pacman будет первым делом пытаться соединиться с этим зеркалом. Аналогично можно сделать и для остальных репозиториев: core-testing, extra, и extra-testing.\n\n"
    },
    {
      "title": "Принудительное обновление списка пакетов pacman",
      "level": 3,
      "content": "Зеркала могут быть рассинхронизированы, из-за чего список пакетов на старом зеркале не будет соответствовать списку на новом зеркале, несмотря на дату, указанную в обоих списках.\n\nПосле создания файла /etc/pacman.d/mirrorlist или его изменения выполните следующую команду:\n\n```\n# pacman -Syyu\n```\n\nNote: Это не обязательно при использовании успешно синхронизированных зеркал или проверке временной метки файла lastsync чтобы убедиться в актуальности списков пакетов.\n\n```\n# pacman -Syyuu\n```\n\nЭто не обязательно при использовании успешно синхронизированных зеркал или проверке временной метки файла lastsync чтобы убедиться в актуальности списков пакетов.\n\n"
    },
    {
      "title": "Сортировка зеркал",
      "level": 2,
      "content": "При загрузке пакетов pacman использует зеркала в том порядке, в котором они перечислены в /etc/pacman.d/mirrorlist. Порядок серверов в списке задаёт их приоритет.\n\nСортировать зеркала только по скорости — не самый оптимальный вариант, так как самые быстрые сервера могут быть рассинхронизированы. Рекомендуется сначала отсортировать зеркала по скорости, после чего, в соответствии с их статусом, убрать из списка рассинхронизированые зеркала.\n\nТакже рекомендуется повторять данную процедуру перед каждым обновлением системы для поддержания списка зеркал в актуальном состоянии.\n\n"
    },
    {
      "title": "Ранжирование существующего списка зеркал",
      "level": 4,
      "content": "Пакет pacman-contrib предоставляет Bash-скрипт /usr/bin/rankmirrors, который можно использовать для ранжирования зеркал в соответствии со скоростями подключения и нахождения наиболее быстрых местных зеркал.\n\nСоздайте резервную копию текущего файла /etc/pacman.d/mirrorlist:\n\n```\n# cp /etc/pacman.d/mirrorlist /etc/pacman.d/mirrorlist.backup\n```\n\nНеобходимо выполнить следующие действия, чтобы подготовить файл mirrorlist.backup к к ранжированию с помощью rankmirrors:\n\n- Отредактируйте mirrorlist.backup, раскомментировав сервера, которые необходимо протестировать\n- Если сервера в файле сгруппированы по странам, возможно извлечь все сервера определённой страны следующим образом: $ awk '/^## Название страны$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n- Выполните следующую команду sed, чтобы раскомментировать все зеркала: # sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n\n```\n$ awk '/^## Название страны$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n```\n\n```\n# sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n```\n\nИ наконец, отсортируйте сервера. В данном случае, -n 6 выводит только 6 наиболее быстрых зеркал:\n\n```\n# rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n```\n\n"
    },
    {
      "title": "Получение и ранжирование свежего списка зеркал",
      "level": 4,
      "content": "Воспользуйтесь Pacman Mirrorlist Generator, чтобы получить список актуальных зеркал определённых стран и отсортировать его с помощью rankmirrors. Команда ниже скачивает актуальный список зеркал во Франции и Великобритании, использующих протокол https, после чего удаляет комментарии, ранжирует сервера и выводит 5 наиболее быстрых из них.\n\n```\n$ curl -s \"https://archlinux.org/mirrorlist/?country=FR&country=GB&protocol=https&use_mirror_status=on\" | sed -e 's/^#Server/Server/' -e '/^#/d' | rankmirrors -n 5 -\n```\n\nСуществующие инструменты:\n\n- Rate Mirrors — извлекает список зеркал, исключает устаревшие или находящиеся в процессе обновления, после чего выбирает страну с наиболее \"быстрыми\" зеркалами на основе информации о местонахождении подводных кабелей и узлов обмена трафиком. Работает в том числе и с произвольным списком зеркал, поданным на стандартный поток ввода. Приложение довольно быстрое, поэтому можно запускать его перед каждым обновлением системы.\n\n"
    },
    {
      "title": "Ранжирование на стороне сервера",
      "level": 3,
      "content": "Официальный Pacman Mirrorlist Generator предоставляет возможность легко получить ранжированный список зеркал. Весь процесс сортировки происходит на одном сервере с учётом различных факторов, что значительно снижает нагрузку на зеркала и клиентов в сравнении с ранжированием с каждого отдельного клиента.\n\nДругие популярные альтернативы:\n\n- Reflector — получает последний список зеркал со страницы MirrorStatus, фильтрует их, сортирует по скорости и перезаписывает /etc/pacman.d/mirrorlist. Обеспечивает автоматизацию обновления списка зеркал при помощи демона systemd и таймера.\n\n- mirro-rs — Менеджер зеркал Arch Linux с текстовым интерфейсом.\n\n- rate-mirrors — Удобный для повседневного использования инструмент ранжирования зеркал на стороне клиента с поддержкой географических карт.\n\n- shiny-mirrors — Альтернатива reflector, написанная на Rust.\n\n"
    },
    {
      "title": "Отсутствие зеркал",
      "level": 3,
      "content": "Если вы столкнулись со следующей ошибкой:\n\n```\nerror: config file /etc/pacman.d/mirrorlist could not be read: No such file or directory\n```\n\nЗагрузите список зеркал напрямую с сайта:\n\n```\n# curl -o /etc/pacman.d/mirrorlist https://archlinux.org/mirrorlist/all/\n```\n\nРаскомментируйте предпочитаемые зеркала, как описано в #Включение определённого зеркала, после чего выполните следующую команду:\n\n```\n# pacman -Syu pacman-mirrorlist\n```\n\n"
    },
    {
      "title": "Проблемы с зеркалами",
      "level": 3,
      "content": "Если вы уверены, что зеркало работает неправильно и это не отражается на странице статуса зеркал, смените зеркало и создайте багрепорт. Для зеркал багрепорт следует открыть в проекте arch-mirrors Arch Linux GitLab. Вы также можете отправить письмо по адресу mirrors@archlinux.org.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- mirrorlist.py — исходный код генератора списка зеркал Archweb\n\n"
    }
  ]
}