{
  "title": "Команда переводчиков ArchWiki",
  "url": "https://wiki.archlinux.org/title/%D0%9A%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D0%B0_%D0%BF%D0%B5%D1%80%D0%B5%D0%B2%D0%BE%D0%B4%D1%87%D0%B8%D0%BA%D0%BE%D0%B2_ArchWiki",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Эта страница содержит информацию о русской команде переводчиков ArchWiki и задачах, стоящих перед ней.\n\n"
    },
    {
      "title": "Цели и задачи",
      "level": 3,
      "content": "Цель проекта — предоставление русскоязычным пользователям Arch Linux как можно более полной документации по дистрибутиву и всему, что с ним связано. Мы ставим перед собой следующие задачи:\n\n- Перевод на русский язык документации по дистрибутиву Arch Linux.\n- Поддержание статей в актуальном состоянии.\n- Написание собственных статей или информации, дополняющей другие статьи.\n\n"
    },
    {
      "title": "Команда",
      "level": 3,
      "content": "Список наших переводчиков:\n\nНеактивны (менее 5 правок за последние 30 дней):\n\n- Flygrounder (обсуждение|вклад)\n- Natrio (обсуждение|вклад)\n\nРаз в неделю список участников сортируется по убыванию, исходя из количества правок, сделанных за последние 30 дней.\n\nЧленство в команде подразумевает, что вы поддерживаете одну или несколько статей (помимо обычных правок/переводов). Чтобы присоединиться к команде, создайте заявку на странице обсуждения. Любой из участников команды её рассмотрит.\n\n"
    },
    {
      "title": "Вклад в общее дело",
      "level": 2,
      "content": "Вы можете помочь проекту, вступив в команду или просто создавая/переводя/улучшая статьи русскоязычного сегмента. Если при этом у вас возникнут вопросы и потребуется помощь, обратитесь к любому из участников проекта.\n\n"
    },
    {
      "title": "Подготовка",
      "level": 3,
      "content": "Прежде всего, разумеется, необходимо выбрать целевую страницу. Это может быть как английская статья, для которой отсутствует перевод, так и уже существующий перевод, который нуждается в обновлении или улучшении.\n\nЕсли вы новичок в редактировании wiki-страниц, то в Help-разделе есть ряд статей на эту тему. Вот наиболее важные из них, с которыми стоит ознакомиться в первую очередь:\n\n- Help:Редактирование\n- Help:Интернационализация\n- Help:Стиль\n\nВ разделе #Смотрите также вы найдёте ссылки на некоторые ресурсы, которые упростят процесс перевода и помогут сделать его более качественным.\n\nНаконец, прежде чем приступить непосредственно к правкам, создайте аккаунт и выполните вход. Править страницы могут только авторизованные пользователи.\n\n"
    },
    {
      "title": "Перевод и редактирование",
      "level": 3,
      "content": "В случае внесения в статью небольших изменений можно выполнять их \"на месте\", главное — не забывайте снабжать правки подробным описанием. Однако если вы взялись переводить статью целиком и не уверены, как много времени это займёт, то лучше использовать подстраницу из личного пространства.\n\n1. Перейдите на оригинальную страницу, откройте её на редактирование и скопируйте всё содержимое.\n1. Создайте подстраницу в личном пространстве и добавьте на неё скопированное, предварительно удалив категории (см. примечание в примере).\n1. Сохраните подстраницу и приступайте к собственно переводу.\n\nПо завершении перевода необходимо проделать обратную операцию — скопировать содержимое подстраницы в статью-перевод, добавив категории. Если страница перевода уже существует, то просто обновите её. Если перевода нет, то страницу придётся создать. Изучите #Список проверки на предмет того, что ещё может (и должно) быть сделано перед публикацией.\n\n"
    },
    {
      "title": "Список проверки",
      "level": 3,
      "content": "Перед публикацией страницы необходимо проверить:\n\n1. Название статьи: оно должно соответствовать английскому варианту (подробности: Help:Указания по выбору имен статей#Многоязычные статьи). Также проверьте правильность использования заглавных букв (подробности: Help:Стиль#Заголовок).\n1. Категории: статья должна принадлежать к тем же (русским) категориям, что и английский вариант. Пример: сравните категории, к которым принадлежат страницы systemd и systemd (Русский).\n1. Межъязыковые ссылки: должны присутствовать все межъязыковые ссылки, имеющиеся в английской статье, плюс ссылка на английскую статью (подробности: Help:Интернационализация#Межъязыковые ссылки).\n1. Статус перевода: добавьте шаблон TranslationStatus или обновите его аргументы (дату и номер ревизии), если он уже есть.\n1. Описание изменений: его необходимо указывать при каждой правке (подробности: ArchWiki:Внесение вклада#Всегда правильно указывайте описание изменений).\n\nТеперь можно смело сохранять страницу. Если вы создали новую страницу (а не обновили ее), обязательно выполните следующие действия:\n\n1. Создайте русские межъязыковые ссылки на страницах всех остальных языков.\n1. Зайдите на английскую версию страницы. В меню слева нажмите на ссылку Ссылки сюда и проверьте, есть ли в списке русские статьи. Скорее всего, они будут. В этом случае отредактируйте каждую такую статью, чтобы русские страницы ссылались на вашу новую страницу, а не на английскую. Для удобства используйте функцию поиска в вашем браузере.\n1. Если название статьи можно перевести на русский язык, создайте перенаправление с локализованным заголовком. Примеры таких статей можно найти в разделе #Страницы с сопроводителем.\n\nЕсли вы являетесь членом русской команды переводчиков ArchWiki, не забудьте добавить статью в список.\n\n"
    },
    {
      "title": "Поддержка",
      "level": 3,
      "content": "Вы перевели статью и выложили чистовую версию на странице ArchWiki. Если после этого под вашими окнами не собралась толпа, требующая линчевать вас на месте — вероятно, вы всё сделали правильно. :) Далее у вас есть выбор из трёх вариантов:\n\n- сказать \"Чёрт побери, сделано уже достаточно!\" — и переключиться на вино и женщин,\n- сказать \"Чёрт побери, я ничего не понял!\" — и перевести ещё одну статью, или\n- сказать \"Чёрт побери, я поступлю как настоящий мужчина!\" — и в дальнейшем поддерживать статью.\n\nПоддержка статьи подразумевает, что вы:\n\n1. Отслеживаете изменения в английской статье-оригинале и своевременно производите синхронизацию перевода.\n1. Защищаете статью от нападений вандалов (ошибочных или вредительских правок).\n\nСтрого говоря, вносить правки и поддерживать статьи можно и не являясь членом команды переводчиков. Тем не менее, если вы желаете \"оформить отношения\", то создайте заявку на вступление, указав в ней, какую статью собираетесь поддерживать. Когда заявка будет принята, добавьте свою статью в таблицу #Страницы с сопроводителем.\n\nЕсли у статьи уже есть сопроводитель, вы можете помогать её поддерживать — при условии согласованности действий.\n\n"
    },
    {
      "title": "Шаблоны",
      "level": 2,
      "content": "В следующей таблице перечислены шаблоны, которые необходимо перевести, и их русский эквивалент.\n\nTable content:\nАнглийские шаблоны | Русские эквиваленты\nШаблоны статьи\nTemplate:Related articles start | Template:Related articles start (Русский)\nTemplate:Yes | Template:Yes (Русский)\nTemplate:No | Template:No (Русский)\nTemplate:Tip | Template:Tip (Русский)\nTemplate:Note | Template:Note (Русский)\nTemplate:Warning | Template:Warning (Русский)\nTemplate:Dead link | Template:Dead link (Русский)\nTemplate:Broken package link | Template:Broken package link (Русский)\nTemplate:Broken section link | Template:Broken section link (Русский)\nШаблоны состояния перевода\nTemplate:Bad translation | Template:Bad translation (Русский)\nTemplate:Translateme | Template:Translateme (Русский)\nTemplate:TranslationStatus | Template:TranslationStatus (Русский)\nСпециальные шаблоны\nTemplate:Cat main | Template:Cat main (Русский)\nTemplate:Template | Template:Template (Русский)\n\n"
    },
    {
      "title": "Термины",
      "level": 2,
      "content": "Есть множество терминов, которые можно перевести по-разному. Использование одних и тех же слов для их перевода во всех русскоязычных статьях является очень важным, поскольку единство терминологии упрощает понимание текста. Здесь представлен список терминов и переводов, которые должны использоваться.\n\nTable content:\nАнглийский | Русский | Допустимое (в особых случаях)\nAlias | Псевдоним | Псевдоним (алиас)\nBackend | Бэкенд | -\nBenchmarking | Тестирование производительности | Бенчмаркинг\nBinary (n.) | Двоичный файл | Бинарный файл\nBug report | Отчет об ошибке | Отчет об ошибке (баг-репорт)\nCrash (ing) | Рушить/Нарушить | Нарушать работу\nDesktop entry | Ярлык приложения | Ярлык приложения (.desktop)\nDirectory | Каталог | Директория\nPort forwarding | Перенаправление порта | Проброс порта\nGUI frontend | Графическая оболочка | -\nHook | Хук | Хук-скрипт\nHost | Хост | Узел (host)\nHostname | Имя хоста | Имя узла (hostname)\nHotkeys | Горячие клавиши | -\nIP forwarding | Перенаправление пакетов | Форвардинг пакетов\nMount (v.) | Смонтировать, примонтировать | -\nSection | Раздел | -\nService | Служба | Служба (.service)\nService file | Файл службы | Файл службы (.service)\nSession | Сеанс | -\nSink | Устройство вывода | -\nSource (v.) | Запустите команду source .bashrc | -\nTerminal pager, pager program | Программа постраничного просмотра | -\nTime zone | Часовой пояс | Временная зона\nTmpfile | Временный файл | -\nUnit file | Файл юнита | -\nUnmount | Размонтировать | -\nWorkspace | Рабочее место | -\n\n"
    },
    {
      "title": "Страницы с сопроводителем",
      "level": 2,
      "content": "Страницы, которые поддерживаются в рамках проекта.\n\nTable content:\nСтраница | Локализованный заголовок | Сопроводитель\nAlacritty (Русский) | Не требуется | Flygrounder\nGRUB (Русский) | Не требуется | Natrio\nRsync (Русский) | Не требуется | Flygrounder\nWvdial (Русский) | Не требуется | Flygrounder\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- glvrd.ru — сервис для проверки текста на чистоту и читаемость\n- multitran.com — словарь с разделением по тематикам и переводами, добавленными пользователями\n\n"
    }
  ]
}