{
  "title": "Конфигурация клавиатуры в Xorg",
  "url": "https://wiki.archlinux.org/title/%D0%9A%D0%BE%D0%BD%D1%84%D0%B8%D0%B3%D1%83%D1%80%D0%B0%D1%86%D0%B8%D1%8F_%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8%D0%B0%D1%82%D1%83%D1%80%D1%8B_%D0%B2_Xorg",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- X keyboard extension\n- Конфигурация клавиатуры в консоли\n- Дополнительные клавиши\n- Xorg (Русский)\n- Горячие клавиши\n\nЭта статья описывает основные настройки клавиатуры в Xorg. Для расширенных тем, таких как изменение раскладки клавиатуры или дополнительные сопоставления клавиш, смотрите статьи X keyboard extension или дополнительные клавиши соответственно.\n\nСервер Xorg использует расширение X keyboard extension (XKB) для определения раскладок клавиатуры. Опционально можно использовать xmodmap для прямого доступа ко внутренней раскладке, хотя это не рекомендуется для сложных задач. Также можно использовать localectl из systemd для определения раскладки клавиатуры и в Xorg, и в виртуальной консоли.\n\n"
    },
    {
      "title": "Просмотр настроек клавиатуры",
      "level": 2,
      "content": "Используйте следующую команду, чтобы просмотреть настройки XKB:\n\n```\n$ setxkbmap -print -verbose 10\n```\n\n```\nSetting verbose level to 10\nlocale is C\nApplied rules from evdev:\nmodel:      evdev\nlayout:     us\noptions:    terminate:ctrl_alt_bksp\nTrying to build keymap using the following components:\nkeycodes:   evdev+aliases(qwerty)\ntypes:      complete\ncompat:     complete\nsymbols:    pc+us+inet(evdev)+terminate(ctrl_alt_bksp)\ngeometry:   pc(pc104)\nxkb_keymap {\n        xkb_keycodes  { include \"evdev+aliases(qwerty)\" };\n        xkb_types     { include \"complete\"      };\n        xkb_compat    { include \"complete\"      };\n        xkb_symbols   { include \"pc+us+inet(evdev)+terminate(ctrl_alt_bksp)\"    };\n        xkb_geometry  { include \"pc(pc104)\"     };\n};\n```\n\n"
    },
    {
      "title": "Сторонние инструменты",
      "level": 3,
      "content": "Здесь приведены некоторые «неофициальные» утилиты, которые выводят специфичную информацию об используемой в настоящее время раскладке клавиатуры.\n\n- xkb-switch-gitAUR:\n\n```\n$ xkb-switch\n```\n\n```\nru\n```\n\n- xkblayout-state-gitAUR:\n\n```\n$ xkblayout-state print \"%s\"\n```\n\n```\nru\n```\n\n"
    },
    {
      "title": "Настройка раскладки клавиатуры",
      "level": 2,
      "content": "Раскладку клавиатуры можно настроить разными способами в Xorg. Вот объяснение используемых параметров:\n\n- XkbModel устанавливает модель клавиатуры. Это влияет только на некоторые дополнительные клавиши. Для большинства клавиатур подходят модели pc104 (ANSI) или pc105 (ISO). Но, например, ноутбуки обычно имеют дополнительные клавиши, и иногда, чтобы заставить их работать, достаточно просто выбрать правильную модель клавиатуры.\n- XkbLayout устанавливает раскладку клавиатуры. Можно указать несколько раскладок через запятую, если, например, вам нужно быстро переключаться между ними.\n- XkbVariant устанавливает определённый вариант раскладки, указанной в XkbLayout. Например, вариант по умолчанию для sk — qwertz, но его можно изменить вручную на другой, например, qwerty.\n- XkbOptions устанавливает некоторые дополнительные опции (через запятую). Используется для указания клавиш для смены раскладки, отображения текущей раскладки через светодиоды на клавиатуре, режима compose и др. Примеры есть в разделе #Часто используемые опции XKB.\n\nИмя раскладки, как правило, состоит из 2-буквенного кода страны. Чтобы посмотреть полный список моделей клавиатур, раскладок, вариантов и опций вместе с коротким описанием, откройте файл /usr/share/X11/xkb/rules/base.lst. Кроме того, вы можете использовать одну из следующих команд для просмотра раскладки и т.д., но без описания:\n\n- localectl list-x11-keymap-models\n- localectl list-x11-keymap-layouts\n- localectl list-x11-keymap-variants [layout]\n- localectl list-x11-keymap-options\n\nПримеры в следующих подразделах будут делать одно и то же. Они устанавливают модель клавиатуры pc105, первичной раскладкой us, ru — вторичной раскладкой, вариант расположения клавиш dvorak для раскладки us и комбинацию клавиш Win+Space для переключения между раскладками. Для получения дополнительной информации смотрите xkeyboard-config(7).\n\n"
    },
    {
      "title": "Через setxkbmap",
      "level": 3,
      "content": "setxkbmap настраивает раскладку клавиатуры только для текущего сеанса X, но её можно сделать постоянной через xinitrc или xprofile. Это переопределяет общесистемные настройки, указанные #Через файлы настроек X.\n\nИспользуйте следующим образом (смотрите setxkbmap(1)):\n\n```\n$ setxkbmap [-model xkb_model] [-layout xkb_layout] [-variant xkb_variant] [-option xkb_options]\n```\n\nЧтобы изменить раскладку введите (-layout — стандартный флаг):\n\n```\n$ setxkbmap xkb_layout\n```\n\nДля нескольких настроек:\n\n```\n$ setxkbmap -model pc105 -layout us,ru -variant dvorak, -option grp:win_space_toggle\n```\n\nНастройки, установленные через setxkbmap, сбрасываются в момент подключения новой клавиатуры, из-за чего команду придётся выполнять повторно. Среды рабочего стола обычно восстанавливают настройки автоматически, но если вы их не используете, то можно автоматизировать вызов setxkbmap, например, через xplugdAUR.\n\n"
    },
    {
      "title": "Через файлы настроек X",
      "level": 3,
      "content": "Синтаксис файлов настроек X описан в разделе Xorg (Русский)#Настройка. Этот способ создаёт постоянные общесистемные настройки.\n\nВот пример:\n\n```\n/etc/X11/xorg.conf.d/00-keyboard.conf\n```\n\n```\nSection \"InputClass\"\n        Identifier \"system-keyboard\"\n        MatchIsKeyboard \"on\"\n        Option \"XkbLayout\" \"us,ru\"\n        Option \"XkbModel\" \"pc105\"\n        Option \"XkbVariant\" \"dvorak,\"\n        Option \"XkbOptions\" \"grp:win_space_toggle\"\nEndSection\n```\n\n"
    },
    {
      "title": "С помощью localectl",
      "level": 4,
      "content": "Для удобства можно использовать инструмент localectl вместо ручного редактирования файлов настроек X. Он сохраняет настройки в файл /etc/X11/xorg.conf.d/00-keyboard.conf, который не следует редактировать вручную, потому что localectl перепишет его при следующем запуске.\n\nИспользуйте следующим образом:\n\n```\n# localectl [--no-convert] set-x11-keymap раскладка [модель [вариант [опции]]]\n```\n\nЧтобы установить модель, вариант или опции, нужно также указать все находящиеся перед ними поля, но их можно пропустить, передав пустую строку \"\". Если параметр --no-convert не передан, тогда указанная клавиатура преобразуется в ближайшую соответствующую раскладку для консоли и прописывается в настройках консоли в файле vconsole.conf. Для получения дополнительной информации смотрите localectl(1).\n\nЧтобы создать файл /etc/X11/xorg.conf.d/00-keyboard.conf, аналогичный показанному выше:\n\n```\n# localectl --no-convert set-x11-keymap us,ru pc105 dvorak, grp:win_space_toggle\n```\n\n"
    },
    {
      "title": "Переключение раскладок клавиатуры",
      "level": 3,
      "content": "Для быстрого переключения между раскладками клавиатуры сначала укажите несколько раскладок, между которыми вы хотите переключаться (первая из них будет по умолчанию). Затем укажите клавишу (или комбинацию клавиш), которую будете использовать для переключения. Например, чтобы переключаться между английской и русской раскладками с помощью клавиши CapsLock, используйте us,ru в качестве параметра XkbLayout и grp:caps_toggle в качестве параметра XkbOptions. Число раскладок в XkbLayout должно совпадать с числом вариантов в XkbVariant — если вы хотите переключаться между разными вариантами одной раскладки, укажите её несколько раз (например, ru,ru).\n\nСписок доступных раскладок и их вариантов приведён в xkeyboard-config(7) § LAYOUTS. Список комбинаций клавиш, которые можно использовать для переключения раскладки, приведён в xkeyboard-config(7) § Switching to another layout.\n\nПереключение с помощью grp:alts_toggle ненадёжно и вряд ли будет исправлено; по возможности используйте другие комбинации клавиш.\n\n"
    },
    {
      "title": "Переключение раскладок клавиатуры с помощью Alt Shift",
      "level": 4,
      "content": "Для переключения раскладок через Alt+Shift укажите grp:alt_shift_toggle в XkbOptions.\n\nОднако есть проблема в XKB, из-за которой перестают работать сочетания Alt+Shift+клавиша. Более того, в некоторых раскладках клавиатуры XKB может установить правый Alt по умолчанию как AltGr, из-за чего RAlt+RShift перестаёт переключать раскладку.\n\nВ качестве обходного пути можно использовать sxhkd для переключения раскладок, добавив такие настройки в sxhkdrc:\n\n```\nShift_L + Alt_L\n    setxkbmap -query | grep -q 'ru' && setxkbmap us || setxkbmap ru,us\nShift_R + Alt_R\n    setxkbmap -query | grep -q 'ru' && setxkbmap us || setxkbmap ru,us\n```\n\nПо какой-то причине при использовании sxhkd клавишу Alt нужно нажимать первой.\n\n"
    },
    {
      "title": "Завершение Xorg по сочетанию клавиш Ctrl+Alt+Backspace",
      "level": 3,
      "content": "По умолчанию комбинация клавиш Ctrl+Alt+Backspace отключена. Вы можете включить ее установив terminate:ctrl_alt_bksp для XkbOptions. Это также можно сделать, привязав клавишу к Terminate_Server в xmodmap (который отменяет любую существующую настройку XkbOptions). Для того, чтобы любой из этих методов работал, необходимо также установить DontZap в \"off\" в ServerFlags; однако, по крайней мере, с версии R6.8.0 (2004 год) [2] это значение по умолчанию.\n\n"
    },
    {
      "title": "Перестановка Caps Lock и Левого Control",
      "level": 3,
      "content": "Чтобы поменять местами Caps Lock и Левый Control, добавьте ctrl:swapcaps в XkbOptions. Запустите следующую команду для просмотра похожих параметров вместе с их описанием:\n\n```\n$ grep -E \"(ctrl|caps):\" /usr/share/X11/xkb/rules/base.lst\n```\n\n"
    },
    {
      "title": "Включение кнопок мышки",
      "level": 3,
      "content": "Кнопки мыши отключены по умолчанию и должны быть включены вручную добавлением keypad:pointerkeys в XkbOptions. Это создаст комбинацию клавиш Shift+NumLock для включения/выключения кнопок мыши.\n\nСмотрите также X keyboard extension#Mouse control для расширенной настройки.\n\n"
    },
    {
      "title": "Настройка AltGr",
      "level": 3,
      "content": "Клавиша AltGr (Alternate Graphic) используется для доступа к дополнительным символам и знакам на клавиатуре. Она работает как клавиша-модификатор аналогично Shift, но обеспечивает доступ к третьему ряду клавиш. Ряды (levels) работают следующим образом:\n\n- 1 ряд: по умолчанию (без модификатора);\n- 2 ряд: доступ через клавишу Shift, даёт доступ к символам в верхнем регистре и некоторым основным символам (например, @);\n- 3 ряд: доступ через клавишу AltGr, даёт доступ к дополнительным символам и знакам, которых нет в первых двух рядах.\n\nСимволы 2 ряда обычно нанесены прямо на клавиши клавиатуры, благодаря чему их легко найти. Чтобы посмотреть символы из дополнительных рядов, можно использовать xmodmap -pk или посмотреть в /usr/share/X11/xkb/symbols.\n\n"
    },
    {
      "title": "Настройка клавиши Compose",
      "level": 3,
      "content": "Хотя обычно её нет на традиционных клавиатурах, однако клавишу Compose можно настроить на существующую.\n\nКлавиша Compose начинает последовательность нажатия клавиш, которая включает (обычно два) дополнительных нажатия клавиш. Обычно используется либо для ввода символов на языке, для которого не была предназначена клавиатура, либо для других менее используемых символов, которые не покрываются модификатором AltGr. Например, нажатие Compose ' e производит é, или Compose - - создаёт длинное тире: —.\n\nХотя ещё несколько эксцентричных клавиатур имеют клавишу Compose, её работоспособность обычно заключается в замене уже существующей клавиши на неё. Например, чтобы сделать клавишу Menu клавишей Compose, используйте конфигурацию окружения рабочего стола или пропишите compose:menu в XkbOptions (или используйте setxkbmap: setxkbmap -option compose:menu). Разрешенные клавиши для подстановки определены в /usr/share/X11/xkb/rules/base.lst:\n\n```\n$ grep \"compose:\" /usr/share/X11/xkb/rules/base.lst\n```\n\nЕсли желаемое соответствие не найдено в этом файле, альтернативой является использование xmodmap для сопоставления нужной клавиши с keysym Multi_key, которая работает как клавиша compose по умолчанию (обратите внимание, что настройки xmodmap сбрасываются setxkbmap).\n\n"
    },
    {
      "title": "Сочетания клавиш",
      "level": 4,
      "content": "Комбинация по умолчанию для клавиши compose зависит от локали, установленной для этого сеанса и находящейся в /usr/share/X11/locale/используемая_локаль/Compose, где используемая_локаль, к примеру, en_US.UTF-8.\n\nМожно определить собственную комбинацию клавиш compose, скопировав стандартный файл в ~/.XCompose и отредактировав его. Или же создайте пустой ~/.XCompose и включите в него содержимое стандартного файла, используя include \"%L\", например:\n\n```\n~/.XCompose\n```\n\n```\ninclude \"%L\"\n\n<Multi_key> <g> <a> : \"α\"\n<Multi_key> <g> <b> : \"β\"\n<Multi_key> <g> <g> : \"γ\"\n```\n\nКлавиша compose (обозначается как <Multi_key> в файле ~/.XCompose) работает с любыми из тысяч символов Unicode, включая те, которые находятся за основной многоязычной плоскостью (Basic Multilingual Plane). Формат файлов XCompose описан в Compose(5).\n\nОднако GTK не использует XIM по умолчанию и поэтому игнорирует ~/.XCompose. Это можно решить, заставив GTK использовать XIM путём установки переменных окружения для графического сеанса GTK_IM_MODULE=xim и/или XMODIFIERS=\"@im=none\".\n\n"
    },
    {
      "title": "Знаки валют на других клавишах",
      "level": 3,
      "content": "Большинство европейских клавиатур имеют знак евро (€), напечатанный на клавише 5. Например, чтобы вводить его через Alt+5, используйте опции lv3:ralt_switch и eurosign:5.\n\nЗнак рупии (₹) можно использовать также с rupeesign:4.\n\nДля ввода знака рубля (₽) можно добавить опцию misc:typo, включающую дополнительные типографские символы, и назначить клавишу для выбора 3 ряда (например, опция lv3:ralt_switch для выбора через правый Alt) — после этого используйте сочетание клавиш RAlt+h (в русской раскладке RAlt+р) для ввода знака рубля.\n\n"
    },
    {
      "title": "Переключение состояния клавиши Caps Lock сразу после нажатия",
      "level": 3,
      "content": "Те, кто предпочитает набирать заглавные буквы с помощью клавиши Caps Lock, могут столкнуться с небольшой задержкой при переключении состояния Caps Lock, что может привести к случайному вводу двух или более заглавных букв (например, THe, ARch LInux). Это происходит потому, что Caps Lock включается сразу в момент нажатия клавиши Caps Lock, но при повторном нажатии отключается только после отпускания клавиши. Это поведение унаследовано от печатных машинок, где функция Caps Lock реализовывалась путём физического сдвига (shifting) и блокировки каретки или литерной корзины, а снятие блокировки выполнялось нажатием и последующим отпусканием клавиши Shift.\n\nНекоторые более популярные операционные системы удалили это поведение добровольно (так как оно может сбить с толку некоторых) или по ошибке, однако это вопрос предпочтения. В баг-трекер Xserver отправлялись сообщения об ошибках, поскольку в настоящее время нет простого способа переключиться на поведение, представленное другими операционными системами. [3] [4].\n\n"
    },
    {
      "title": "Временное решение",
      "level": 4,
      "content": "Сначала, экспортируйте настройки клавиатуры в файл:\n\n```\n$ xkbcomp -xkb $DISPLAY xkbmap\n```\n\nВ файле xkbmap найдите раздел Caps Lock, который начинается с key <CAPS>:\n\n```\nkey <CAPS> {         [       Caps_Lock ] };\n```\n\nи замените весь раздел следующим кодом:\n\n```\nkey <CAPS> {\n    repeat=no,\n    type[group1]=\"ALPHABETIC\",\n    symbols[group1]=[ Caps_Lock, Caps_Lock],\n    actions[group1]=[ LockMods(modifiers=Lock), Private(type=3,data[0]=1,data[1]=3,data[2]=3)]\n};\n```\n\nСохраните и перезагрузите настройки клавиатуры:\n\n```\n$ xkbcomp -w 0 xkbmap $DISPLAY\n```\n\nПоскольку эти настройки не сохраняются после перезагрузки системы, можно создать с ними службу, которая будет запускаться после старта X.\n\n"
    },
    {
      "title": "Функции однократного нажатия клавиш",
      "level": 2,
      "content": "Чтобы задать клавише-модификатору дополнительную функцию однократного нажатия, воспользуйтесь xcape. Таким образом возможно, к примеру, назначить функцию Escape клавише CapsLock при нажатии только данной клавиши, а при нажатии вместе с другой кнопкой будет вызвана функция клавиши Control. Для начала задайте перестановку Control, используя setxkbmap, как описано ранее, а также задайте ассоциацию с Escape с помощью xcape:\n\n```\n$ xcape -e 'Caps_Lock=Escape'\n```\n\nВозможно задать несколько ассоциаций, используя точку с запятой. Например: Caps_Lock=Escape;Shift_L=Escape.\n\nЗаметьте, что xcape не сгенерирует событие при удержании кнопки дольше времени ожидания (по умолчанию 500 мс).\n\n"
    },
    {
      "title": "Регулировка задержки и скорости автоповтора",
      "level": 2,
      "content": "Задержка автоповтора (typematic delay) — количество времени (обычно в миллисекундах), в течение которого нужно удерживать клавишу, прежде чем начнётся повторение ввода символа. После этого символ будет повторяться с определённой частотой (обычно заданной в Гц), которая задаётся скоростью автоповтора (typematic rate). Обратите внимание, что эти настройки настраиваются отдельно для Xorg и для виртуальной консоли.\n\n"
    },
    {
      "title": "Через xset",
      "level": 3,
      "content": "Инструмент xset, предоставляемый пакетом xorg-xset, может быть использован для настройки скорости и задержки автоповтора для активного X-сервера, но некоторые действия в процессе работы могут привести к сбросу настроек.\n\nИспользование:\n\n```\n$ xset r rate задержка [скорость]\n```\n\nНапример, чтобы установить задержку автоповтора в 200 мс и скорость автоповтора в 30 Гц, используйте следующую команду:\n\n```\n$ xset r rate 200 30\n```\n\nВвод команды без указания задержки и скорости автоповтора приведёт к сбросу на значения по умолчанию; задержка 660 мс и скорость 25 Гц:\n\n```\n$ xset r rate\n```\n\n"
    },
    {
      "title": "Через xautocfg",
      "level": 3,
      "content": "xautocfgAUR может автоматически применять настройки автоповтора для подключаемых на лету устройств. Он отслеживает события X11 и, когда видит появление новой клавиатуры, применяет настройки.\n\nОтредактируйте настройки под свои нужды:\n\n```\n~/.config/xautocfg.cfg\n```\n\n```\n[keyboard]\n\n# задержка повтора в мс\ndelay = 200\n\n# частота повтора в Гц\nrate = 30\n```\n\nЕсли graphical-session.target запускается средой рабочего окна или оконным менеджером, включите пользовательскую службу xautocfg.service. Если нет, запустите xautocfg вручную.\n\n"
    },
    {
      "title": "Через опцию AutoRepeat",
      "level": 3,
      "content": "Если вы хотите сделать настройки автоповтора постоянными и общесистемными, их можно изменить #Через файлы настроек X, добавив опцию AutoRepeat. [5]\n\nПараметр AutoRepeat принимает два значения — задержку и интервал — в миллисекундах. Например, если вам нужна частота 25 Гц, то интервал будет 1000 / 25 = 40 миллисекунд.\n\n```\n/etc/X11/xorg.conf.d/00-keyboard.conf\n```\n\n```\nSection \"InputClass\"\n        ...\n        Option \"AutoRepeat\" \"200 40\"\n        ...\nEndSection\n```\n\n"
    },
    {
      "title": "Через параметры запуска XServer",
      "level": 3,
      "content": "Ещё один способ сделать настройки постоянными и общесистемными — передать опции X-серверу при его запуске:\n\n- -ardelay миллисекунды — устанавливает задержку автоповтора (длительность в миллисекундах удержания клавиши нажатой до начала автоповтора).\n- -arinterval миллисекунды — устанавливает интервал автоповтора (длительность в миллисекундах, которая должна пройти между нажатиями, генерируемыми автоповтором).\n\nДля получения полного списка параметров X-сервера смотрите Xserver(1) и обратитесь к своему экранному менеджеру для получения информации о том, как передать эти параметры.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Руководство Madduck по расширению XKB (архив Wayback Machine)\n- How to modify a keyboard layout in Linux - Romano Giannetti's blog\n\n"
    }
  ]
}