{
  "title": "Мета-пакета",
  "url": "https://wiki.archlinux.org/title/%D0%9C%D0%B5%D1%82%D0%B0-%D0%BF%D0%B0%D0%BA%D0%B5%D1%82%D0%B0",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Мета-пакет и группа пакетов могут определяться мейнтейнером для обозначения набора связанных пакетов. Оба подхода позволяют устанавливать и удалять набор пакетов по названию мета-пакета или группы вместо того, чтобы вручную указывать имя каждого пакета. Несмотря на то, что группа не является пакетом, её всё равно можно установить похожим способом, смотрите pacman (Русский)#Установка группы пакетов и PKGBUILD (Русский)#groups.\n\n"
    },
    {
      "title": "Разница между мета-пакетом и группой пакетов",
      "level": 2,
      "content": "Разница между мета-пакетом и обычным пакетом заключается в том, что мета-пакет является пустым и существует лишь для связывания пакетов при помощи зависимостей. Мета-пакет, часто (но не всегда) имеющий суффикс \"-meta\", имеет схожую функциональность с группой пакетов — он позволяет одновременно устанавливать или удалять несколько связанных пакетов.\n\nУ каждого подхода есть свои преимущества и недостатки:\n\nМета-пакет:\n\n- Мета-пакеты устанавливаются так же, как и другие пакеты (см. pacman (Русский)#Установка отдельных пакетов).\n- Мета-пакеты удаляются так же, как и другие пакеты (см. pacman (Русский)#Удаление пакетов).\n- Любой новый пакет будет автоматически установлен при обновлении самого мета-пакета с новым списком зависимостей.\n- Пользователи не могут выбирать отдельные зависимости для установки из мета-пакета.\n- Пользователи не могут удалять зависимости мета-пакета без удаления самого мета-пакета.\n\nГруппа:\n\n- Группы пакетов запрашивают выбор необходимых для установки пакетов (см. pacman (Русский)#Установка группы пакетов).\n- Пользователи не могут удалить группу, так как устанавливается список пакетов. Команда pacman -R группа попытается удалить все пакеты этой группы.\n- Новый пакет, добавленный в группу, не будет автоматически установлен в систему.\n- Пользователи могут выбирать пакеты для установки из определённой группы.\n- Пользователи могут удалять пакеты без необходимости удаления группы целиком.\n\n"
    },
    {
      "title": "Мета-пакеты",
      "level": 2,
      "content": "Наиболее важный мета-пакет — base. Он содержит минимальный набор пакетов, определяющий базовую установку Arch, в том числе:\n\n- основное ПО, например, glibc и bash;\n- специфические для дистрибутива пакеты, например, pacman и systemd;\n- некоторые POSIX-утилиты, например, базовые утилиты, утилиты для работы с процессами, файлами и сжатием файлов;\n- сетевые инструменты, например, iproute2.\n\nЯдро относится к опциональным зависимостям. См. объявление изменения (англ.) и причины замены группы base на мета-пакет (англ.).\n\nЕщё один часто используемый мета-пакет — base-devel. Он предоставляет сборочное окружение для makepkg. См. причины замены группы base-devel на мета-пакет (англ.).\n\n"
    },
    {
      "title": "Группы",
      "level": 2,
      "content": "Группы пакетов обычно используются для облегчения установки сред рабочего стола. Смотрите раздел Среда рабочего стола#Список сред рабочего стола.\n\nДругой пример — группа pro-audio, содержащая доступные в официальных репозиториях программы для профессиональной работы с аудио.\n\nСмотрите также список всех групп пакетов.\n\n"
    }
  ]
}