{
  "title": "Настройка беспроводной сети",
  "url": "https://wiki.archlinux.org/title/%D0%9D%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B9%D0%BA%D0%B0_%D0%B1%D0%B5%D1%81%D0%BF%D1%80%D0%BE%D0%B2%D0%BE%D0%B4%D0%BD%D0%BE%D0%B9_%D1%81%D0%B5%D1%82%D0%B8",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Программная точка доступа\n- Ad-hoc networking\n- Раздача интернета\n- Wireless bonding\n- Network Debugging\n- Bluetooth (Русский)\n\nОсновную статью по настройке сети можно найти на странице Настройка сети.\n\nНастройка беспроводного соединения происходит в два этапа. На первом этапе необходимо определить и установить правильный драйвер сетевого интерфейса (обычно драйвер находится на установочном носителе, но иногда его приходится устанавливать вручную), после чего произвести настройку. Второй этап заключается в выборе способа управления беспроводными соединениями. В этой статье описаны оба этапа, а также представлены ссылки на утилиты управления беспроводными соединениями.\n\nВ разделе #iw описана ручная настройка беспроводного интерфейса / локальной сети посредством утилиты iw. В статье Настройка сети#Сетевые менеджеры вы найдёте список программ (в том числе и с графическим интерфейсом), которые используются для автоматического управления сетевым интерфейсом. В них реализована поддержка сетевых профилей, что бывает удобно при частой смене беспроводных сетей (как это бывает, например, с ноутбуками).\n\n"
    },
    {
      "title": "Драйвер устройства",
      "level": 2,
      "content": "Стандартное ядро Arch Linux имеет модульную архитектуру, поэтому многие драйверы для аппаратного обеспечения расположены на жёстком диске и доступны как модули. При загрузке udev определяет аппаратное обеспечение вашего компьютера и загружает соответствующие модули (драйверы), в результате чего создаётся сетевой интерфейс.\n\nНекоторым беспроводным устройствам для работы помимо драйвера необходима ещё и прошивка. В пакете linux-firmware содержится большое количество образов прошивок, однако проприетарные прошивки в него не входят и должны устанавливаться отдельно. Подробное описание установки дано в разделе #Установка драйвера/прошивки.\n\n"
    },
    {
      "title": "Проверка состояния драйвера",
      "level": 3,
      "content": "Чтобы проверить, загрузился ли драйвер сетевой карты, посмотрите на вывод команд lspci -k или lsusb -v (в зависимости от того, подключена карта по шине PCI(e) или через USB-порт). Вы должны увидеть используемые драйверы ядра, например:\n\n```\n$ lspci -k\n```\n\n```\n06:00.0 Network controller: Intel Corporation WiFi Link 5100\n\tSubsystem: Intel Corporation WiFi Link 5100 AGN\n\tKernel driver in use: iwlwifi\n\tKernel modules: iwlwifi\n```\n\nТакже проверьте вывод команды ip link, чтобы убедиться, что сетевой интерфейс был создан; обычно название беспроводного интерфейса начинается с букв «wl», например, wlan0 или wlp2s0. Затем включите интерфейс командой\n\n```\n# ip link set интерфейс up\n```\n\nНапример, если интерфейс называется wlan0, команда примет вид ip link set wlan0 up.\n\n- Если вы получили ошибку RTNETLINK answers: Operation not possible due to RF-kill (\"действие невозможно из-за RF-kill\"), убедитесь, что аппаратный переключатель находится в положении вкл. Подробнее см. #Предостережения Rfkill.\n- Если вы получили сообщение об ошибке SIOCSIFFLAGS: No such file or directory (\"нет такого файла или каталога\"), то скорее всего для функционирования вашего беспроводного устройства необходима соответствующая прошивка.\n\nПроверьте сообщения ядра на предмет загрузки прошивки:\n\n```\n# dmesg | grep firmware\n```\n\n```\n[   7.148259] iwlwifi 0000:02:00.0: loaded firmware version 39.30.4.1 build 35138 op_mode iwldvm\n```\n\nЕсли там нет интересующей вас информации, проверьте сообщения подробного вывода, относящиеся к определённому вами ранее модулю (в примере ниже iwlwifi):\n\n```\n# dmesg | grep iwlwifi\n```\n\n```\n[   12.342694] iwlwifi 0000:02:00.0: irq 44 for MSI/MSI-X\n[   12.353466] iwlwifi 0000:02:00.0: loaded firmware version 39.31.5.1 build 35138 op_mode iwldvm\n[   12.430317] iwlwifi 0000:02:00.0: CONFIG_IWLWIFI_DEBUG disabled\n...\n[   12.430341] iwlwifi 0000:02:00.0: Detected Intel(R) Corporation WiFi Link 5100 AGN, REV=0x6B\n```\n\nЕсли модуль ядра загрузился успешно и интерфейс запущен, можете пропустить следующий раздел.\n\n"
    },
    {
      "title": "Установка драйвера/прошивки",
      "level": 3,
      "content": "Проверьте, находится ли ваша сетевая карта в числе поддерживаемых:\n\n- Изучите таблицу существующих драйверов Linux для беспроводных устройств. Перейдя на страницу определённого драйвера вы найдёте список поддерживаемых устройств. Также можно посмотреть список идентификаторов Wi-Fi устройств в Linux.\n- В Ubuntu Wiki есть хороший список беспроводных карт и информация об их поддержке ядром Linux или драйвером пространства пользователя (включая название драйвера).\n- Проверьте ваше устройство на сайте Linux Wireless Support или по реестру hardware compatibility list, в котором также содержится список поддерживаемого ядром оборудования.\n\nИмейте в виду, что в продуктах некоторых производителей могут попадаться разные чипы даже в продуктах с одинаковым идентификатором. Значимыми являются только usb-id (для устройств USB) или pci-id (для устройств PCI).\n\nЕсли ваша беспроводная карта есть в одном из списков выше, перейдите в раздел #Решение проблем с драйверами и прошивками. В нём содержатся инструкции по установке драйверов и прошивок на некоторые редкие беспроводные карты. Затем проверьте состояние драйвера снова.\n\nЕсли вашей беспроводной карты нет в списках, то скорее всего она поддерживается только в Windows (некоторые Broadcom, 3com и др.). В этом случае попробуйте #ndiswrapper.\n\n"
    },
    {
      "title": "Утилиты",
      "level": 2,
      "content": "Управление беспроводными сетевыми интерфейсами, как и всеми прочими, осуществляется посредством входящей в пакет iproute2 утилиты ip.\n\nУправление беспроводным соединением может осуществляться с помощью сетевого менеджера, который будет использовать wpa_supplicant или iwd для аутентификации беспроводного соединения, либо с помощью wpa_supplicant или iwd напрямую. Для настройки на более низком уровне, а также при использовании устаревшего драйвера или устаревшего метода аутентификации существуют iw и устаревший wireless_tools.\n\n"
    },
    {
      "title": "Сравнение iw и wireless_tools",
      "level": 3,
      "content": "Table content:\nУтилита | Пакет | WEXT | nl80211 | WEP | WPA/WPA2/WPA3 | Archiso [1]\nwireless_tools1 | wireless_tools | Да | Нет | Да | Нет | Да\niw | iw | Нет | Да | Да | Нет | Да\n\n1. Устарела.\n\nИмейте в виду, что некоторые старые драйверы поддерживают только WEXT.\n\nНиже представлено сравнение некоторых команд утилит iw и wireless_tools. Дополнительные примеры можно найти в статье о замене iwconfig на iw[устаревшая ссылка 2024-10-12 ⓘ].\n\nTable content:\nКоманда iw | Команда wireless_tools | Описание\niw dev wlan0 link | iwconfig wlan0 | Получение состояния соединения.\niw dev wlan0 scan | iwlist wlan0 scan | Сканирование доступных точек доступа.\niw dev wlan0 set type ibss | iwconfig wlan0 mode ad-hoc | Установка режима работы ad-hoc.\niw dev wlan0 connect ваш_essid | iwconfig wlan0 essid ваш_essid | Подключение к открытой сети.\niw dev wlan0 connect ваш_essid 2432 | iwconfig wlan0 essid ваш_essid freq 2432M | Подключение к открытой сети с указанием канала.\niw dev wlan0 connect ваш_essid key 0:ваш_ключ | iwconfig wlan0 essid ваш_essid key ваш_ключ | Подключение к сети с WEP шифрованием шестнадцатеричным ключом.\niwconfig wlan0 essid ваш_essid key s:ваш_ключ | Подключение к сети с WEP шифрованием ASCII-ключом.\niw dev wlan0 set power_save on | iwconfig wlan0 power on | Включение режима энергосбережения.\n\n"
    },
    {
      "title": "iw",
      "level": 2,
      "content": "- Большая часть представленных ниже команд должна выполняться с правами root. При выполнении от имени обычного пользователя некоторые команды (например, iw list) завершат работу без ошибки, но сгенерированный ими вывод либо окажется некорректным, либо будет отсутствовать вовсе.\n- В зависимости от вашего аппаратного обеспечения и типа шифрования некоторые перечисленные ниже шаги могут оказаться не нужны. Некоторые сетевые карты требуют включения интерфейса и/или поиска точки доступа перед привязкой к ней и получением IP-адреса. Возможно, придётся немного поэкспериментировать. Например, пользователи с WPA/WPA2 могут попытаться активировать беспроводную сеть напрямую с шага #Соединение с точкой доступа.\n\nВ примерах ниже беспроводное устройство с названием интерфейс устанавливает соединение с точкой доступа Wi-Fi ваш_essid. Замените названия на свои.\n\n"
    },
    {
      "title": "Определение имени интерфейса",
      "level": 3,
      "content": "Чтобы узнать название беспроводного интерфейса, выполните:\n\n```\n$ iw dev\n```\n\nНазвание интерфейса будет указано после слова «Interface». Например, wlan0.\n\n"
    },
    {
      "title": "Определение состояния интерфейса",
      "level": 3,
      "content": "Чтобы проверить состояние соединения, выполните:\n\n```\n$ iw dev интерфейс link\n```\n\nСтатистическую информацию (количество tx/rx байт, мощность сигнала и т.д.) можно получить, введя команду:\n\n```\n$ iw dev интерфейс station dump\n```\n\n"
    },
    {
      "title": "Включение интерфейса",
      "level": 3,
      "content": "Некоторые карты требуют включения интерфейса перед использованием iw или wireless_tools.\n\n```\n# ip link set интерфейс up\n```\n\nЧтобы убедиться, что интерфейс включён, выполните:\n\n```\n$ ip link show интерфейс\n```\n\n```\n3: wlan0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc mq state DOWN mode DORMANT group default qlen 1000\n    link/ether 12:34:56:78:9a:bc brd ff:ff:ff:ff:ff:ff\n```\n\nНа включённое состояние интерфейса указывает слово UP в <BROADCAST,MULTICAST,UP,LOWER_UP>, а не надпись state DOWN.\n\n"
    },
    {
      "title": "Обнаружение точек доступа",
      "level": 3,
      "content": "Чтобы просмотреть список доступных точек доступа, выполните:\n\n```\n# iw dev интерфейс scan | less\n```\n\nОбратите внимание на следующие поля:\n\n- SSID: название сети.\n- Signal: мощность беспроводного излучения в единицах dBm (например, от -100 до 0). Более близкие к нулю значения означают лучший сигнал. На основании отображаемой мощности можно получить представление о покрытии сети.\n- Security: напрямую не указывается; проверьте строку, которая начинается с capability. Если там содержится указание Privacy, например, capability: ESS Privacy ShortSlotTime (0x0411), то сеть как-то защищена. Если вы видите информационный блок RSN, то сеть защищена протоколом Robust Security Network, также известным как WPA2. Если вы видите информационный блок WPA, то сеть защищена протоколом Wi-Fi Protected Access. В блоках RSN и WPA может быть указана следующая информация: Group cipher: принимает значения TKIP, CCMP, both, others. Pairwise ciphers: принимает значения TKIP, CCMP, both, others. Может отличаться от значения в Group cipher. Authentication suites: принимает значения PSK, 802.1x, others. Для домашнего маршрутизатора вы скорее всего обнаружите здесь значение PSK (то есть пароль). В университетах вероятнее всего будет сеть 802.1x, что требует логин и пароль. Тогда вам потребуется узнать, какое используется управление ключами (например, EAP), и какой способ инкапсуляции (например, PEAP). Подробную информацию можно найти в разделе #WPA2 Enterprise и статье Wikipedia:Authentication protocol. Если вы не видите ни RSN, ни WPA, но есть раздел Privacy, то используется защитный протокол WEP.\n\n- Если вы видите информационный блок RSN, то сеть защищена протоколом Robust Security Network, также известным как WPA2.\n- Если вы видите информационный блок WPA, то сеть защищена протоколом Wi-Fi Protected Access.\n- В блоках RSN и WPA может быть указана следующая информация: Group cipher: принимает значения TKIP, CCMP, both, others. Pairwise ciphers: принимает значения TKIP, CCMP, both, others. Может отличаться от значения в Group cipher. Authentication suites: принимает значения PSK, 802.1x, others. Для домашнего маршрутизатора вы скорее всего обнаружите здесь значение PSK (то есть пароль). В университетах вероятнее всего будет сеть 802.1x, что требует логин и пароль. Тогда вам потребуется узнать, какое используется управление ключами (например, EAP), и какой способ инкапсуляции (например, PEAP). Подробную информацию можно найти в разделе #WPA2 Enterprise и статье Wikipedia:Authentication protocol.\n- Если вы не видите ни RSN, ни WPA, но есть раздел Privacy, то используется защитный протокол WEP.\n\n- Group cipher: принимает значения TKIP, CCMP, both, others.\n- Pairwise ciphers: принимает значения TKIP, CCMP, both, others. Может отличаться от значения в Group cipher.\n- Authentication suites: принимает значения PSK, 802.1x, others. Для домашнего маршрутизатора вы скорее всего обнаружите здесь значение PSK (то есть пароль). В университетах вероятнее всего будет сеть 802.1x, что требует логин и пароль. Тогда вам потребуется узнать, какое используется управление ключами (например, EAP), и какой способ инкапсуляции (например, PEAP). Подробную информацию можно найти в разделе #WPA2 Enterprise и статье Wikipedia:Authentication protocol.\n\n"
    },
    {
      "title": "Выбор режима работы",
      "level": 3,
      "content": "Возможно, будет необходимо выбрать подходящий режим работы беспроводной карты. Например, если вы хотите подключиться к сети ad-hoc, то нужно установить режим работы ibss:\n\n```\n# iw dev интерфейс set type ibss\n```\n\n```\nYou need to run a management daemon, e.g. hostapd,\nsee https://wireless.wiki.kernel.org/en/users/documentation/hostapd\nfor more information on how to do that.\n```\n\n"
    },
    {
      "title": "Соединение с точкой доступа",
      "level": 3,
      "content": "Необходимо привязать устройство к точке доступа и ввести ключ в зависимости от типа шифрования:\n\n- Без шифрования # iw dev интерфейс connect \"ваш_essid\"\n- WEP С использованием шестнадцатеричного ключа (формат ключа определится автоматически, поскольку WEP-ключ имеет фиксированную длину): # iw dev интерфейс connect \"ваш_essid\" key 0:ваш_ключ С использованием ASCII-ключа, указав третий ключ в качестве ключа по умолчанию (ключи нумеруются с нуля, всего возможно до четырёх ключей): # iw dev интерфейс connect \"ваш_essid\" key d:2:ваш_ключ\n- Другое iw может работать только с WEP. Для подключения с использованием другого типа шифрования смотрите раздел #Аутентификация.\n\n```\n# iw dev интерфейс connect \"ваш_essid\"\n```\n\n- С использованием шестнадцатеричного ключа (формат ключа определится автоматически, поскольку WEP-ключ имеет фиксированную длину): # iw dev интерфейс connect \"ваш_essid\" key 0:ваш_ключ\n- С использованием ASCII-ключа, указав третий ключ в качестве ключа по умолчанию (ключи нумеруются с нуля, всего возможно до четырёх ключей): # iw dev интерфейс connect \"ваш_essid\" key d:2:ваш_ключ\n\n```\n# iw dev интерфейс connect \"ваш_essid\" key 0:ваш_ключ\n```\n\n```\n# iw dev интерфейс connect \"ваш_essid\" key d:2:ваш_ключ\n```\n\n- iw может работать только с WEP. Для подключения с использованием другого типа шифрования смотрите раздел #Аутентификация.\n\nВне зависимости от использованного способа, проверьте соединение:\n\n```\n# iw dev интерфейс link\n```\n\n"
    },
    {
      "title": "Аутентификация",
      "level": 2,
      "content": "Есть два основных варианта для аутентификации Wi-Fi в Linux: wpa_supplicant и iwd.\n\n"
    },
    {
      "title": "WPA2 Personal",
      "level": 3,
      "content": "WPA2 Personal, или WPA2-PSK — одна из реализаций технологии Wi-Fi Protected Access.\n\nВыполнить вход в сеть WPA2 Personal можно посредством утилит wpa_supplicant или iwd, а также с помощью сетевого менеджера. Если вы только выполнили аутентификацию, то для создания нормально функционирующего подключения всё ещё нужно настроить IP-адрес(а) и маршруты либо вручную, либо с помощью DHCP-клиента.\n\n"
    },
    {
      "title": "WPA2 Enterprise",
      "level": 3,
      "content": "WPA2 Enterprise — ещё одна реализация технологии Wi-Fi Protected Access. Она предлагает лучшую безопасность и управление ключами по сравнению с WPA2 Personal, а также дополнительную функциональность корпоративного типа вроде VLAN и NAP. Для работы этой технологии требуется внешний аутентификационный сервер, RADIUS, обрабатывающий попытки аутентификации пользователей. Это отличает Enterprise-режим от режима Personal, которому не требуется ничего кроме маршрутизатора или точки доступа с одним паролем для всех пользователей.\n\nКорпоративный (Enterprise) режим осуществляет подключение пользователей к сети посредством имени пользователя и пароля и/или цифрового сертификата. Поскольку каждый пользователь обладает уникальным динамическим ключом шифрования, это также позволяет предотвратить отслеживание пользователей в беспроводной сети и усилить шифрование.\n\nНиже описана настройка сетевых клиентов, соединяющихся с беспроводной точкой доступа в режиме WPA2 Enterprise. Информацию о настройке самой точки доступа можно найти в статье Software access point#RADIUS.\n\nСравнение протоколов сведено в таблицу.\n\n"
    },
    {
      "title": "MS-CHAPv2",
      "level": 4,
      "content": "Беспроводные сети WPA2-Enterprise, полагающиеся на аутентификацию MSCHAPv2 type-2 с использованием PEAP, иногда требуют установки pptpclient помимо стандартного ppp. Однако netctl работает «из коробки» без ppp-mppe. В любом случае, использование MSCHAPv2 не рекомендуется из-за его ненадёжности, но другого варианта часто просто нет.\n\n"
    },
    {
      "title": "eduroam",
      "level": 4,
      "content": "eduroam — международный роуминговый сервис на основе WPA2 Enterprise для лиц, занятых в сфере научно-исследовательской деятельности, высшего образования и дополнительного профессионального образования.\n\n- Перед применением любых настроек, предложенных в этом разделе, рекомендуется сначала проверить их со специалистами вашего учреждения. Предложенные здесь профили настроек предлагаются безо всяких гарантий на предмет работоспособности или соответствия каким-либо требованиям безопасности.\n- При хранении профилей соединения в незашифрованном виде рекомендуется оставить доступ на чтение только суперпользователю, выполнив команду chmod 600 профиль от имени root.\n\n"
    },
    {
      "title": "Ручная/автоматическая настройка",
      "level": 4,
      "content": "- wpa_supplicant настраивается напрямую в его файле настроек или посредством интерфейса; используется вместе с клиентом DHCP. Примеры настроек приведены в файле /usr/share/doc/wpa_supplicant/wpa_supplicant.conf.\n- iwd#WPA Enterprise.\n- NetworkManager может создавать профили WPA2 Enterprise с помощью nmcli, nmtui или графических интерфейсов.\n- ConnMan требует создания отдельного файла настроек перед соединением с беспроводной сетью. Подробности можно найти в руководстве connman-service.config(5) и в статье ConnMan#Connecting to eduroam (802.1X).\n- netctl может использовать настройки wpa_supplicant посредством блоков WPAConfigSection=. Детали вы найдёте в руководстве netctl.profile(5).\n\n"
    },
    {
      "title": "WPA3 Personal",
      "level": 3,
      "content": "WPA3 Personal, или WPA3-SAE — один из режимов Wi-Fi Protected Access.\n\nИ wpa_supplicant, и iwd поддерживают WPA3 Personal.\n\n"
    },
    {
      "title": "WPA3 Enterprise",
      "level": 3,
      "content": "WPA3 Enterprise — один из режимов Wi-Fi Protected Access.\n\nwpa_supplicant (с версии 2:2.10-8) поддерживает WPA3 Enterprise. Смотрите FS#65314.\n\n"
    },
    {
      "title": "Соответствие регламентам",
      "level": 3,
      "content": "Регулятивный домен (regulatory domain) — страны, совместно использующие общий регламент радиосвязи, определённый одним из регулятивных органов (FCC в США, ETSI для стран Европы и т.д.). С помощью параметра regdomain драйвер беспроводной сетевой платы настраивается в соответствии с местными законами. Regdomain использует двухбуквенные коды стран в соответствии с ISO 3166-1 alpha-2. Например, regdomain для США обозначается «US», для России — «RU», и т.д.\n\nRegdomain определяет доступность беспроводных каналов. Так, на частоте 2.4GHz разрешено использовать каналы 1-11 в США, 1-14 — в Японии, и каналы 1-13 в большей части остального мира. На частоте 5GHz правила доступа к каналам несколько сложнее. В Википедии можно найти подробную информацию о доступности каналов: Wikipedia:List of WLAN channels, Wikipedia:ru:Wi-Fi#Разрешённые частоты.\n\nПринадлежность к домену также определяет предельное значение эквивалентной изотропно-излучаемой мощности (Equivalent Isotropically Radiated Power, EIRP) беспроводных устройств. Это значение определяет мощность сигнала и измеряется в единицах дБм или мВт. На частоте 2.4GHz максимальное значение мощности составляет 30дБм в США и Канаде, 20дБм в большинстве стран Европы, и 20-30дБм в остальном мире. На частоте 5GHz максимумы обычно ниже. Допустимые значения мощности можно найти в этой базе данных (значения дБм во втором наборе скобок в каждой линии).\n\nВ некоторых случаях может быть полезно указать неверный regdomain — например, чтобы получить возможность осуществлять передачу через неиспользуемый канал, если остальные каналы перегружены, или чтобы повысить мощность и, как следствие, дальность передачи. Однако делать это не рекомендуется, поскольку это приведёт к нарушению местного законодательства и может нарушить работу других радио-устройстств.\n\nЕсли установлен пакет wireless-regdb, ядро будет загружать базу данных напрямую. Для прямой загрузки ядро, в целях безопасности, должно иметь включенную настройку CONFIG_CFG80211_USE_KERNEL_REGDB_KEYS, чтобы обеспечить криптографическую проверку базы данных. Она включена для стандартного ядра Arch, но если вы используете альтернативное ядро или компилируете его сами, то проверьте это. Более подробную информацию можно найти в этом руководстве.\n\nДля настройки regdomain установите пакет wireless-regdb и перезагрузитесь, затем отредактируйте /etc/conf.d/wireless-regdom, раскомментировав нужный домен.\n\nЧтобы временно назначить regdomain (например, для США):\n\n```\n# iw reg set US\n```\n\nУзнать текущий регуляторный домен:\n\n```\n$ iw reg get\n```\n\nВ некоторых случаях настройку regdomain изменить не получится. В некоторых устройствах параметр домена зашит в прошивку/EEPROM, что ограничивает поведение устройства. В данном случае изменение домена в ПО может только ужесточить ограничения, но не ослабить их. Например, китайское (CN) устройство может быть настроено на домен US, но поднять максимум EIRP с 20дБм до разрешённого в США значения 30дБм не получится.\n\nЧтобы проверить, задан ли домен в прошивке устройства Atheros, выполните команду:\n\n```\n# dmesg | grep ath:\n```\n\nДля других чипсетов в качестве паттерна поиска можно указать \"EEPROM\", \"regdomain\" или просто название драйвера устройства.\n\nЧтобы убедиться, что смена домена прошла успешно, и узнать количество доступных каналов и их разрешённую мощность, выполните\n\n```\n$ iw list | grep -A 15 Frequencies:\n```\n\nwpa_supplicant также может управлять доменом посредством строки country= в файле /etc/wpa_supplicant/wpa_supplicant.conf\n\nВ модуле ядра cfg80211 можно настроить домен, добавив опцию options cfg80211 ieee80211_regdom=JP. Это часть старой реализации технологии регулятивного домена.\n\n"
    },
    {
      "title": "Предостережения Rfkill",
      "level": 3,
      "content": "Во многих ноутбуках присутствует аппаратный переключатель (или кнопка) питания беспроводной карты, однако она может быть также заблокирована и ядром. Этим можно управлять через rfkill(8). Чтобы посмотреть текущий статус:\n\n```\n$ rfkill\n```\n\n```\nID TYPE      DEVICE      SOFT      HARD\n 0 bluetooth hci0   unblocked unblocked\n 1 wlan      phy0   unblocked unblocked\n```\n\nЕсли карта заблокирована аппаратно (hard-blocked), используйте переключатель (кнопку), чтобы разблокировать её. Если же карта заблокирована не аппаратно, a программно (soft-blocked), используйте следующую команду:\n\n```\n# rfkill unblock wlan\n```\n\nВключение/выключение беспроводных карт посредством аппаратных переключателей происходит с помощью модулей ядра. Зачастую это модули WMI. При выходе новых моделей сетевых карт их драйвера могут отсутствовать в последнем стабильном релизе ядра. В этом случае стоит поискать информацию в багтрекере ядра и сообщить название модели сопроводителю соответствующего модуля, если этого ещё никто не сделал.\n\nСмотрите также дополнительную информацию о Rfkill: [3].\n\n"
    },
    {
      "title": "Энергосбережение",
      "level": 3,
      "content": "Смотрите раздел Управление питанием#Сетевые интерфейсы.\n\n"
    },
    {
      "title": "GitHub-репозиторий от morrownr",
      "level": 3,
      "content": "В GitHub-репозитории USB-WiFi от morrownr содержится различная информация о различных Wi-Fi адаптерах и чипсетах, включая тесты производительности, информацию о драйверах и общую информацию. Также репозиторий содержит информацию о PCIe-адаптерах. Рекомендуется к просмотру, особенно если вы не уверены, какой адаптер быстрее, дешевле или лучше совместим с Linux.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "В этом разделе содержатся основные рекомендации по решению проблем, не связанных непосредственно с драйверами и прошивками. Для получения такой информации смотрите следующий раздел #Решение проблем с драйверами и прошивками.\n\n"
    },
    {
      "title": "Временный доступ к интернету",
      "level": 3,
      "content": "Если с сетевой платой возникли проблемы и нужен доступ в интернет, например, чтобы загрузить определённое ПО или задать вопрос на форумах, можно раздать интернет на компьютер с Android-смартфона посредством USB-кабеля. В статье Android tethering (Русский)#USB модем вы найдёте подробную информацию по этому вопросу.\n\n"
    },
    {
      "title": "Просмотр логов",
      "level": 3,
      "content": "При появлении проблем первым делом стоит изучить файлы системных логов. Чтобы не разбирать их вручную, стоит открыть второй терминал/консоль и отслеживать сообщения ядра, выполнив команду\n\n```\n# dmesg -w\n```\n\nнепосредственно перед попыткой беспроводной привязки (association).\n\nЕсли вы используете какую-то утилиту для управления сетью, то же самое можно сделать с помощью systemd:\n\n```\n# journalctl -f\n```\n\nСвязанные с беспроводными устройствами ошибки часто сопровождаются словом deauthentication и кодом причины (reason), например:\n\n```\nwlan0: deauthenticating from XX:XX:XX:XX:XX:XX by local choice (reason=3)\n```\n\nКод причины может подсказать причину неполадок. Полезно будет также взглянуть на схему движения управляющих сообщений, записи в журнале появляются в соответствии с ней.\n\nНекоторые инструменты, описанные с следующих разделах, предлагают опции для более детализированного отладочного вывода. Они могут помочь при дальнейшем анализе неполадок.\n\n"
    },
    {
      "title": "Не удалось получить IP адрес",
      "level": 3,
      "content": "- Если вы можете получить IP для проводного интерфейса, но не можете для беспроводного, попробуйте отключить #Энергосбережение вашей беспроводной карты (укажите off вместо on).\n\n- Если вы получаете timeout ошибку из-за waiting for carrier проблемы, возможно вам понадобится установить канал в auto для конкретного устройства:\n\n```\n# iwconfig wlan0 channel auto\n```\n\nПеред изменением канала убедитесь, что беспроводной интерфейс отключен (down). После смены канала включите его снова (up).\n\n"
    },
    {
      "title": "Не выполняется разрешение хоста по действительному IP-адресу",
      "level": 3,
      "content": "Если вы подключились к публичной беспроводной сети с работающим сервисом Captive portal, убедитесь, что браузер отправляет запросы по протоколу HTTP, а не HTTPS, поскольку некоторые порталы работают только с HTTP. Если причина проблем не в этом, проверьте настройки разрешения доменных имён. Возможно, нужно просто использовать DNS-сервер, полученный по DHCP.\n\n"
    },
    {
      "title": "Включение RTS и порог фрагментации",
      "level": 3,
      "content": "Беспроводное аппаратное обеспечение по умолчанию не использует RTS и фрагментацию. Есть два способа повысить производительность (throughput) за счёт пропускной способности (bandwidth) (т.е. надёжность за счёт скорости). Это полезно в случае наличия беспроводного шума или создающих помехи соседних точек доступа, что приводит к задержкам и сбоям.\n\nФрагментация пакетов увеличивает производительность за счёт разбиения пакетов с размером, превышающим порог фрагментации. Максимальное значение (2346) фактически отключает фрагментацию, поскольку не существует пакетов большего размера. Минимальное значение (256) увеличивает производительность, но требует большей пропускной способности.\n\n```\n# iw phy0 set frag 512\n```\n\nRTS увеличивает производительность посредством выполнения рукопожатий с точкой доступа перед отправкой пакетов с размером выше порога RTS. Максимальное значение (2347) отключает RTS (т.к. пакеты не могут быть большего размера). Минимальный порог (0) включает RTS для всех пакетов, что в большинстве ситуаций несколько избыточно.\n\n```\n# iw phy0 set rts 500\n```\n\n"
    },
    {
      "title": "Причина №1",
      "level": 4,
      "content": "Если журнал содержит сообщение wlan0: deauthenticating from MAC by local choice (reason=3) и произошёл разрыв Wi-Fi соединения, то причина скорее всего кроется в слишком агрессивных настройках энергосбережения вашей беспроводной карты. Попробуйте отключить #Энергосбережение (укажите опцию off вместо on).\n\nЕсли у вашей карты нет энергосберегающего режима, проверьте настройки энергопотребления BIOS. Отключение управления энергопотреблением PCI-Express в BIOS на Lenovo W520 решило эту проблему.\n\n"
    },
    {
      "title": "Причина №2",
      "level": 4,
      "content": "Если происходят частые отключения и журнал содержит сообщение вроде\n\nieee80211 phy0: wlan0: No probe response from AP xx:xx:xx:xx:xx:xx after 500ms, disconnecting\n\nпопробуйте изменить полосу пропускания канала на 20MHz на странице настроек вашего маршрутизатора.\n\n"
    },
    {
      "title": "Причина №3",
      "level": 4,
      "content": "В некоторых моделях ноутбуков (например, Thinkpad X200) аппаратный переключатель (или его соединение с материнской платой) из-за неудачной конструкции со временем может расшататься. В результате при случайных касаниях переключателя или перемещении ноутбука будут происходить аппаратные блокировки (hardblock) и разрывы соединения. Решить эту проблему программно нельзя, кроме случая, когда переключатель электрический — в БИОС есть настройка его отключения. Если переключатель механический (а чаще всего он именно такой), то существует несколько возможных решений, большинство из которых сводится к отключению переключателя: распаять точку соединения переключателя с материнской платой/беспроводной картой, приклеить или зафиксировать переключатель, подтянуть переключатель гайкой или удалить его насовсем.\n\n"
    },
    {
      "title": "Причина №4",
      "level": 4,
      "content": "Причиной частых отключений или невозможности выполнить соединение может быть нестандартная модель маршрутизатора, неправильные настройки или помехи со стороны других беспроводных устройств.\n\nНачните поиск причины проблемы с попытки подключиться к маршрутизатору с отключённой аутентификацией. Подойдите к нему поближе по возможности.\n\nЕсли это сработало, включите WPA/WPA2 снова, но с ограниченными настройками. Например:\n\n- Если маршрутизатор значительно старше вашей беспроводной карты, попробуйте выбрать один беспроводной режим.\n- Отключите смешанную аутентификацию (например, оставьте только WPA2 с AES, или только TKIP в случае старого маршрутизатора).\n- Попробуйте fixed или free режим канала вместо auto (возможно, неподалёку работает старый маршрутизатор, создающий помехи).\n- Отключите WPS.\n- Измените канал(-ы) 5 GHz на канал non-DFS (Dynamic Frequency Selection). Соединения, установленные по такому каналу, могут пострадать от помех, создаваемых находящимся неподалёку погодным радаром.\n- На стороне клиента попробуйте отключить 5 GHz и оставить только 2.4 GHz вместо автоматического выбора (это уменьшит пропускную способность, но может повысить стабильность на расстоянии).\n- Отключите полосу пропускания 40MHz (производительность упадёт, но зато уменьшится количество коллизий пакетов) параметром cfg80211.cfg80211_disable_40mhz_24ghz=1.\n- Если у маршрутизатора есть настройки качества обслуживания (Quality of Service, QoS), проверьте их полноту (например, WMM является одним из протоколов QoS; при неправильной работе ПО маршрутизатор может сообщать, что протокол работает, хотя соответствующая настройка не включена).\n\n"
    },
    {
      "title": "Причина №5",
      "level": 4,
      "content": "У некоторых беспроводных сетевых адаптеров (например, Qualcomm Atheros AR9485) бывают случайные разрывы связи с DMA-ошибкой:\n\n```\n# journalctl -xb\n```\n\n```\nath: phy0: DMA failed to stop in 10 ms AR_CR=0x00000024 AR_DIAG_SW=0x02000020 DMADBG_7=0x0000a400\nwlp1s0: authenticate with 56:e7:ee:7b:55:bc\nwlp1s0: send auth to 56:e7:ee:7b:55:bc (try 1/3)\nwlp1s0: send auth to 56:e7:ee:7b:55:bc (try 2/3)\nwlp1s0: send auth to 56:e7:ee:7b:55:bc (try 3/3)\nwlp1s0: authentication with 56:e7:ee:7b:55:bc timed out\n```\n\nОбходное решение — отключить Intel IOMMU driver (DMA), добавив intel_iommu=off в параметры ядра [4].\n\n"
    },
    {
      "title": "Причина №6",
      "level": 4,
      "content": "Если вы используете устройство с iwlwifi и iwlmvm для беспроводных соединений и ваша Wi-Fi-карта периодически отключается при работе от батареи (возможно, после перезагрузки или при выходе из режима сна), то это можно исправить настройками энергосбережения в iwlmvm.\n\nСоздайте файл /etc/modprobe.d/iwlmvm.conf, если он отсутствует, и добавьте в него следующую строку:\n\n```\n/etc/modprobe.d/iwlmvm.conf\n```\n\n```\noptions iwlmvm power_scheme=1\n```\n\nПараметр power_scheme, установленный в значение 1, задаёт iwlmvm режим «Всегда активен». Все возможные значения:\n\nTable content:\nЗначение | Описание\n1 | Всегда активен\n2 | Промежуточный режим\n3 | Экономный режим\n\nЭто решение было обнаружено в обсуждении на форуме: [5].\n\n"
    },
    {
      "title": "Причина №7",
      "level": 4,
      "content": "Если устройство бывает подолгу неактивно (например, файловый сервер), то отключения могут происходить из-за настроек энергосбережения, в результате которых входящий трафик блокируется, а соединения не устанавливаются. Попробуйте отключить энергосбережение для интерфейса:\n\n```\n# iw dev интерфейс set power_save off\n```\n\nМожно также создать правило udev, которое будет делать это при каждой загрузке системы, смотрите #Энергосбережение.\n\n"
    },
    {
      "title": "Причина №8",
      "level": 4,
      "content": "Если при подключении к mesh-сети (например, WiFi6) наблюдаются постоянные перебои, а в журнале имеются сообщения вида:\n\n```\n# journalctl -b\n```\n\n```\nkernel: wlan0: disconnect from AP aa:bb:cc:dd:ee:ff for new auth to 11:22:33:44:55:66\n```\n\nЭто проблемы с роумингом. В зависимости от способа подключения и рассматриваемой проблемы можно:\n\n- заблокировать BSSID (в примере выше это aa:bb:cc:dd:ee:ff) в NetworkManager, если роуминг нежелателен (смотрите раздел NetworkManager#Regular network disconnects, latency and lost packets (Wi-Fi));\n- настроить параметр bgscan в wpa_supplicant#Roaming.\n\n"
    },
    {
      "title": "Wi-Fi-сеть не видна из-за несоответствия регулятивному домену",
      "level": 3,
      "content": "При соединении по беспроводной сети список используемых на вашей машине беспроводных каналов может не совпасть с перечнем разрешённых каналов в вашей стране. В результате не получится обнаружить некоторые Wi-Fi сети. Для решения этой проблемы необходимо настроить регулятивный домен (regulatory domain), как описано в разделе #Соответствие регламентам.\n\n"
    },
    {
      "title": "Решение проблем с драйверами и прошивками",
      "level": 2,
      "content": "В этом разделе описана установка модулей ядра и прошивок некоторых специфических чипсетов для случаев, когда она отличается от стандартного способа.\n\nИнформацию о приёмах работы с модулями можно найти в статье Модули ядра.\n\n"
    },
    {
      "title": "rt2x00",
      "level": 4,
      "content": "Единый драйвер для чипсетов Ralink, замещает драйвера rt2500, rt61, rt73 и другие. Входит в ядро Linux начиная с версии 2.6.24. Необходимо только загрузить нужный для вашей карты модуль — rt2400pci, rt2500pci, rt2500usb, rt61pci или rt73usb, а он уже автоматически подтянет соответствующие модули драйвера rt2x00.\n\nСписок поддерживаемых устройств можно найти на странице проекта.\n\n- Начиная с версии ядра 3.0, rt2x00 включает также драйвера rt2800pci и rt2800usb.\n- Начиная с версии ядра 3.0 staging-версии драйверов rt2860sta и rt2870sta были заменены на mainline-драйвера rt2800pci и rt2800usb [6].\n- Некоторые устройства имеют широкий набор опций, настроить их можно с помощью входящей в пакет wireless_tools утилиты iwpriv. Документацию можно найти в tar-архиве с исходниками от Ralink.\n\n"
    },
    {
      "title": "rt3090",
      "level": 4,
      "content": "Для устройств с чипсетом rt3090 можно использовать драйвер rt2800pci, однако качественная работа не гарантирована (например, временами не удаётся получить скорость выше 2 Мбит/с).\n\n"
    },
    {
      "title": "rt3290",
      "level": 4,
      "content": "Чипсет rt3290 распознаётся модулем ядра rt2800pci, однако у некоторых могут возникнуть проблемы. В таких случаях можно попробовать вернуться к патченым драйверам Ralink.\n\n"
    },
    {
      "title": "rt3573",
      "level": 4,
      "content": "Чипсет 2012 года. Для стабильной работы могут потребоваться проприетарные драйвера Ralink, которые используются многими производителями беспроводного оборудования. Тема на форуме: Belkin N750 DB wireless usb adapter.\n\n"
    },
    {
      "title": "mt7612u",
      "level": 4,
      "content": "Чипсет 2014 года, выпущенный под новым коммерческим именем Mediatek. Есть варианты чипсетов AC1200 или AC1300. Производитель предлагает драйвера для Linux на странице поддержки[устаревшая ссылка 2024-10-19 ⓘ]. В ядро версии 5.5 был добавлен драйвер mt76.\n\n"
    },
    {
      "title": "Realtek",
      "level": 3,
      "content": "Список чипсетов Realtek и их спецификации: [7].\n\n"
    },
    {
      "title": "rtl8192cu",
      "level": 4,
      "content": "Драйвер для этого чипсета включён в состав ядра, но иногда появляются проблемы с установкой соединения (хотя сканирование активных сетей работает).\n\nВ драйвер 8192cu-dkmsAUR вошли многие исправления; установите его, если входящий в состав ядра драйвер работает плохо.\n\n"
    },
    {
      "title": "rtl8723ae/rtl8723be",
      "level": 4,
      "content": "Модули rtl8723ae и rtl8723be входят в mainline-ядро Linux.\n\nНа картах с этими чипсетами возможны ошибки в работе функции энергосбережения. Это проявляется в случайных разрывах соединения, которые не обнаруживаются высокоуровневыми сетевыми менеджерами (netctl, NetworkManager). Обнаружить ошибку можно командами dmesg -w или journalctl -f, найдя сообщения, относящиеся к энергосбережению (powersave) и модулю rtl8723ae/rtl8723be. Если это ваш случай, используйте параметр модуля ядра fwlps=0, чтобы предотвратить «засыпание» карты и разрывы соединения.\n\nЕсли у вас проблемы с качеством сигнала, возможно, у вашего устройства работает только одна антенна, а программный автовыбор антенны не работает. Вы можете вручную выбрать рабочую антенну параметрами ядра ant_sel=1 или ant_sel=2. [8]\n\n"
    },
    {
      "title": "rtl88xxau",
      "level": 4,
      "content": "Чипсеты Realtek rtl8811au/rtl8812au/rtl8814au/rtl8821au разработаны для различных USB-адаптеров в диапазоне от AC600 до AC1900. Драйвера к ним содержатся в нескольких пакетах, перечисленных ниже; все они требуют DKMS (пакет dkms и заголовочные файлы ядра).\n\nTable content:\nЧипсет | Пакет | Примечания\nrtl8811au, rtl8812au, rtl8821au | rtl88xxau-aircrack-dkms-gitAUR | Модули ядра aircrack-ng для чипсетов 8811au, 8812au и 8821au с режимом мониторинга и поддержкой инъекций.\nrtl8812au | rtl8812au-dkms-gitAUR | Последний официальный драйвер Realtek, только для rtl8812au.\nrtl8811au, rtl8821au | rtl8821au-dkms-gitAUR | Новейшая версия драйверов для rtl8821au.\nrtl8814au | rtl8814au-dkms-gitAUR | Возможно, работает также и для rtl8813au.\n\n"
    },
    {
      "title": "rtl8811cu/rtl8821cu",
      "level": 4,
      "content": "Пакет rtl8821cu-dkms-gitAUR содержит модуль ядра для чипсетов Realtek 8811cu и 8821cu.\n\nДля него требуется фреймворк DKMS, поэтому убедитесь, что необходимые заголовочные файлы ядра установлены.\n\nЕсли даже с загруженным модулем 8821cu интерфейс не работает, попробуйте вручную задать параметр модуля ядра rtw_RFE_type [9][10], например rtw_RFE_type=0x26. Другие значения тоже могут работать.\n\n"
    },
    {
      "title": "rtl8821ce",
      "level": 4,
      "content": "Пакет rtl8821ce-dkms-gitAUR содержит модуль ядра для чипсета Realtek 8821ce ноутбука Asus X543UA.\n\nДля него требуется фреймворк DKMS, поэтому убедитесь, что необходимые заголовочные файлы ядра установлены.\n\n"
    },
    {
      "title": "rtl8822bu",
      "level": 4,
      "content": "В пакеты rtl88x2bu-dkms-gitAUR входит модуль ядра для чипсета Realtek 8822bu, используемого в адаптерах Edimax EW7822ULC USB3, Asus AC53 Nano USB 802.11ac и TP-Link Archer T3U.\n\nДля него требуется фреймворк DKMS, поэтому убедитесь, что необходимые заголовочные файлы ядра установлены.\n\n"
    },
    {
      "title": "rtl8xxxu",
      "level": 4,
      "content": "Проблемы с модулем ядра rtl8xxxu могут быть решены компиляцией стороннего модуля для специфического чипсета. Исходный код можно найти в GitHub-репозитории.\n\nНекоторые драйвера могут быть уже добавлены в AUR, например, rtl8723bu-dkms-gitAUR.\n\n"
    },
    {
      "title": "RTW88",
      "level": 4,
      "content": "Недавно был опубликован набор патчей для модуля ядра RTW88, который, вероятно, однажды войдёт в mainline.\n\nЯдра, настроенные и скомпилированные с этим набором патчей, будут поддерживать большинство устройств на чипе RTW88. Ядра linux-zen и linux-zen-gitAUR уже используют эти патчи, и в этих пакетах есть собранный модуль.\n\nДрайвер поддерживает 882BE, 8822BU, 8822CE, 8822CU, 8723DE, 8723DU, 8821CE и 8821CU.\n\n"
    },
    {
      "title": "RTW89",
      "level": 4,
      "content": "Модуль RTW89 был добавлен в состав ядра и обеспечивает поддержку новых беспроводных чипсетов Realtek.\n\nЭтот драйвер поддерживает 8852AE, 8851BE, 8852BE и 8852CE.\n\n"
    },
    {
      "title": "Atheros",
      "level": 3,
      "content": "Командой проекта MadWifi было создано три драйвера для устройств с чипсетом Atheros:\n\n- madwifi — устаревший драйвер. Не входит в состав ядра Linux начиная с версии 2.6.39.1. [12]\n- ath5k — более новый драйвер, заменивший madwifi. Довольно неплох, но отсутствует поддержка некоторых чипсетов (см. ниже).\n- ath9k — новейший из этих трёх драйверов, предназначен для последних чипсетов Atheros. Поддерживаются все платы с технологией 802.11n.\n\nТакже существуют другие драйвера для устройств Atheros, найти их можно в документации Linux Wireless[устаревшая ссылка 2024-10-12 ⓘ].\n\n"
    },
    {
      "title": "ath5k",
      "level": 4,
      "content": "Полезные ссылки:\n\n- https://wireless.wiki.kernel.org/en/users/drivers/ath5k\n- Debian:ath5k\n\nЕсли веб-страницы временами грузятся очень медленно или если беспроводному устройству не удаётся получить динамический IP-адрес, попробуйте переключиться с аппаратного шифрования на программное, задав параметр модуля ядра nohwcrypt=1 для модуля ath5k.\n\nУ некоторых ноутбуков может возникнуть проблема с LED-индикатором беспроводной связи, который постоянно мигает и становится то красным, то синим. Чтобы решить эту проблему, выполните:\n\n```\n# echo none > /sys/class/leds/ath5k-phy0::tx/trigger\n# echo none > /sys/class/leds/ath5k-phy0::rx/trigger\n```\n\nАльтернативное решение описано в этом багрепорте.\n\n"
    },
    {
      "title": "ath9k",
      "level": 4,
      "content": "Полезные ссылки:\n\n- https://wireless.wiki.kernel.org/en/users/drivers/ath9k\n- Debian:ath9k\n\nНачиная с версии ядра 3.15.1 некоторые пользователи ощутили уменьшение полосы пропускания. В некоторых случаях проблему может решить параметр модуля ядра nohwcrypt=1 для модуля ath9k.\n\nСвязаться с разработчиками и обсудить изменения можно через почтовую рассылку.\n\nLinux Wireless[устаревшая ссылка 2024-10-12 ⓘ] утверждает, что динамическое энергосбережение включено для одноплатных Atheros ath9k новее версии AR9280, однако для некоторых устройств (например, AR9285) powertop всё же сообщает, что энергосбережение отключено. В этом случае включите его вручную.\n\nНа некоторых устройствах (например, AR9285) включение энергосбережения может привести к следующей ошибке:\n\n```\n# iw dev wlan0 set power_save on\n```\n\n```\ncommand failed: Operation not supported (-95)\n```\n\nДля решения добавьте параметр модуля ядра ps_enable=1 для модуля ath9k.\n\n"
    },
    {
      "title": "iwlegacy",
      "level": 4,
      "content": "iwlegacy[устаревшая ссылка 2024-10-12 ⓘ] — драйвер для чипов Intel версий 3945 и 4965. Прошивки для них входят в пакет linux-firmware.\n\nМенеджер устройств udev должен загрузить драйвер автоматически, в противном случае загрузите iwl3945 или iwl4965 вручную. Подробнее см. Модули ядра.\n\nЕсли у вас проблемы с подключением к сети вообще, случайные сбои карты во время загрузки, или просто очень низкое качество связи, попробуйте выключить 802.11n:\n\n```\n/etc/modprobe.d/iwl4965.conf\n```\n\n```\noptions iwl4965 11n_disable=1\n```\n\n"
    },
    {
      "title": "iwlwifi",
      "level": 4,
      "content": "iwlwifi — беспроводной драйвер для современных чипов Intel, таких как 5100AGN, 5300AGN и 5350AGN (полный список поддерживаемых устройств). Пакет linux-firmware содержит ряд прошивок, а в пакете linux-firmware-iwlwifi-gitAUR[ссылка недействительна: package not found] можно найти некоторые последние обновления.\n\nЕсли у вас проблемы с соединением вообще или качество связи очень низкое, попробуйте отключить 802.11n и включить программное шифрование:\n\n```\n/etc/modprobe.d/iwlwifi.conf\n```\n\n```\noptions iwlwifi 11n_disable=1 swcrypto=1\n```\n\nЕсли скорость исходящего соединения в режиме 802.11n слишком низкая, скажем, 20 Мбит/с, попробуйте включить агрегирование антенн:\n\n```\n/etc/modprobe.d/iwlwifi.conf\n```\n\n```\noptions iwlwifi 11n_disable=8\n```\n\nНазвание параметра 11n_disable не должно ввести вас в заблуждение — при установке его в значение 8 ничего не отключается, но запускается режим агрегации. [13], [14]\n\nЕсли это не сработало, попробуйте отключить #Энергосбережение беспроводного адаптера.\n\nРешить проблемы с помощью рекомендаций выше получается не всегда. У некоторых наладить беспроводную связь помогло отключение одной из опций в настройках маршрутизатора. По ссылке вы найдёте список опций устройств на частоте 5MHz, с которыми имеет смысл поэкспериментировать.\n\nЕсли ваша точка доступа 802.11ax (WiFi 6) имеет проблемы с обнаружением маяков или надёжностью соединения, то изучите следующую статью Intel.\n\nЕсли у вас проблемы с подключением bluetooth-наушников и низкая скорость входящего соединения, попробуйте отключить режим Bluetooth Coexistence [15][устаревшая ссылка 2024-10-12 ⓘ]:\n\n```\n/etc/modprobe.d/iwlwifi.conf\n```\n\n```\noptions iwlwifi bt_coex_active=0\n```\n\nПри проблемах драйвер может начать выводить трассировку стека и сообщения об ошибках:\n\n```\n# dmesg\n```\n\n```\nMicrocode SW error detected.  Restarting 0x2000000.\n```\n\nКроме того, могут возникать различные проблемы (например, проблемы с подключением на частоте 5 GHz, случайные обрывы, отсутствие соединения при возобновлении работы).\n\nЧтобы убедиться, что проблема именно в прошивке, выполните откат пакета linux-firmware.\n\nЕсли откат помог, переименуйте файлы проблемных драйверов, чтобы вместо них загружались более старые версии (это позволит обновлять пакет linux-firmware, поскольку он нужен и для других устройств тоже):\n\n```\n# for i in {64..73} ; do mv /usr/lib/firmware/iwlwifi-ty-a0-gf-a0-$i.ucode.xz /usr/lib/firmware/iwlwifi-ty-a0-gf-a0-$i.ucode.xz.bak ; done\n```\n\nЧтобы не приходилось повторять это при каждом обновлении, используйте массив NoExtract в pacman.conf, указав маску для ненужных файлов, чтобы предотвратить их установку. Смотрите pacman (Русский)#Запрет на установку файлов.\n\nЕсли WiFi адаптер не обнаруживается после работы в Windows, это может быть связано с функцией быстрого запуска Windows (Fast Startup), которая включена по умолчанию. Попробуйте отключить Fast Startup. Смотрите также iwlwifi kernel driver wiki.\n\n"
    },
    {
      "title": "Отключение мерцания LED-индикатора",
      "level": 4,
      "content": "Настройка модуля по умолчанию — мигание LED при работе. Некоторые находят это неприятным. Чтобы настроить постоянное свечение индикатора при работе Wi-Fi, можно использовать systemd-tmpfiles:\n\n```\n/etc/tmpfiles.d/phy0-led.conf\n```\n\n```\nw /sys/class/leds/phy0-led/trigger - - - - phy0radio\n```\n\nЧтобы изменения заработали, выполните systemd-tmpfiles --create phy0-led.conf или перезагрузитесь.\n\nЧтобы посмотреть все возможные триггеры LED-индикатора, выполните\n\n```\n# cat /sys/class/leds/phy0-led/trigger\n```\n\n"
    },
    {
      "title": "Broadcom",
      "level": 3,
      "content": "Изучите статью Broadcom wireless.\n\n"
    },
    {
      "title": "Tenda w322u",
      "level": 4,
      "content": "Для этой карты Tenda подходят рекомендации для rt2870sta. См. #rt2x00.\n\n"
    },
    {
      "title": "orinoco",
      "level": 4,
      "content": "Драйвера входят в пакет ядра и должны быть уже установлены.\n\nСреди чипсетов Orinoco есть чипы Hermes II. Для них можно использовать драйвер wlags49_h2_cs вместо orinoco_cs, если нужна поддержка WPA. Чтобы использовать драйвер, сначала установите запрет загрузки orinoco_cs.\n\n"
    },
    {
      "title": "prism54",
      "level": 4,
      "content": "Драйвер p54 входит в ядро, но вам придётся загрузить прошивку карты с сайта и установить её в каталог /usr/lib/firmware.\n\n"
    },
    {
      "title": "zd1211rw",
      "level": 4,
      "content": "zd1211rw — драйвер для ZyDAS ZD1211 802.11b/g USB WLAN чипсетов. В настоящее время включен в ядро. Список поддерживаемого оборудования: [16][устаревшая ссылка 2024-10-12 ⓘ]. Предварительно придётся установить файлы прошивки из пакета zd1211-firmwareAUR.\n\n"
    },
    {
      "title": "hostap_cs",
      "level": 4,
      "content": "Host AP — драйвер Linux для беспроводных карт на основе чипсета Intersil Prism2/2.5/3. Драйвер включён в ядро Linux.\n\n"
    },
    {
      "title": "ndiswrapper",
      "level": 3,
      "content": "Ndiswrapper — скрипт-обёртка, который позволяет использовать некоторые драйвера Windows для Linux. Вам потребуются файлы .inf и .sys из драйвера Windows.\n\nЧтобы настроить ndiswrapper, выполните следующие шаги:\n\n1. Установите пакет ndiswrapper-dkms.\n1. Установите драйвер в каталог /etc/ndiswrapper/*: # ndiswrapper -i filename.inf\n1. Просмотрите список установленных драйверов ndiswrapper: $ ndiswrapper -l\n1. Сохраните настройки ndiswrapper в файл /etc/modprobe.d/ndiswrapper.conf:# ndiswrapper -m# depmod -a\n\n```\n# ndiswrapper -i filename.inf\n```\n\n```\n$ ndiswrapper -l\n```\n\n```\n# ndiswrapper -m# depmod -a\n```\n\nПосле установки ndiswrapper необходимо настроить автоматическую загрузку модуля при запуске системы.\n\nПроверьте работоспособность ndiswrapper:\n\n```\n# modprobe ndiswrapper\n# iwconfig\n```\n\nВ списке интерфейсов должен появиться беспроводной интерфейс wlan0. В случае каких-либо проблем полезную информацию можно найти на страницах ndiswrapper howto и ndiswrapper FAQ.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- The Linux Wireless project — документация по беспроводной (IEEE-802.11) подсистеме Linux.\n- Aircrack-ng guide on installing drivers — установка драйверов для беспроводных сетевых интерфейсов.\n- Wireless Device Database Wiki (Этот форк хостится на wi-cat.ru с тех пор как оригинальная wiki была отключена. Есть также две (неполные) версии: TechInfoDepot, deviwiki)\n\n"
    }
  ]
}