{
  "title": "Настройка сети/Проводная сеть",
  "url": "https://wiki.archlinux.org/title/%D0%9D%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B9%D0%BA%D0%B0_%D1%81%D0%B5%D1%82%D0%B8/%D0%9F%D1%80%D0%BE%D0%B2%D0%BE%D0%B4%D0%BD%D0%B0%D1%8F_%D1%81%D0%B5%D1%82%D1%8C",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "В статье описана настройка Ethernet; общие вопросы по настройке подключения к сети можно найти в статье Настройка сети.\n\n"
    },
    {
      "title": "Проверка состояния",
      "level": 3,
      "content": "udev должен автоматически определить контроллер сетевого интерфейса и загрузить необходимый модуль ядра во время загрузки системы. Найдите пункт \"Ethernet controller\" (или похожий) в выводе команды lspci -v. В нём содержится информация о модуле ядра с драйвером интерфейса:\n\n```\n$ lspci -v\n```\n\n```\n02:00.0 Ethernet controller: Attansic Technology Corp. L1 Gigabit Ethernet Adapter (rev b0)\n \t...\n \tKernel driver in use: atl1\n \tKernel modules: atl1\n```\n\nВыполните dmesg | grep имя-модуля чтобы проверить, был ли драйвер загружен:\n\n```\n# dmesg | grep atl1\n```\n\n```\n...\natl1 0000:02:00.0: eth0 link is up 1000 Mbps full duplex\n```\n\nЕсли драйвер загружен, то следующий раздел можно пропустить. В противном случае выясните имя необходимого модуля.\n\n"
    },
    {
      "title": "Загрузка модуля",
      "level": 3,
      "content": "Найдите в интернете необходимый для вашего чипсета модуль/драйвер. Некоторые распространённые модули — 8139too для чипсетов Realtek, sis900 для чипсетов SiS. Выяснив название модуля, попробуйте загрузить его вручную. Если появляется ошибка, что модуль не найден, для начала проверьте, не обновляли вы ядро недавно (если да — перезагрузитесь). Также может оказаться, что данный драйвер не был включён в ядро. Попробуйте найти модуль в AUR.\n\nЕсли udev не определяет и не загружает нужный модуль автоматически во время запуска системы, изучите раздел Модули ядра#Автоматическая загрузка модулей.\n\n"
    },
    {
      "title": "ifplugd для ноутбуков",
      "level": 3,
      "content": "ifplugd — демон, который автоматически настраивает Ethernet-устройство при подключении кабеля и удаляет конфигурацию при его отключении. Это удобно для ноутбуков со встроенными сетевыми интерфейсами, поскольку последний будет настраиваться лишь при реальном подключении кабеля. Другой вариант использования — когда необходимо перезапустить сеть, но вы не хотите перезагружать компьютер или делать это в оболочке.\n\nПо умолчанию ifplugd настроен на работу с устройством eth0. Эту и другие настройки, такие как время задержки, можно изменить в файле /etc/ifplugd/ifplugd.conf.\n\n"
    },
    {
      "title": "Смена компьютера при использовании кабельного модема",
      "level": 3,
      "content": "Некоторые провайдеры кабельных интернет-услуг (например, videotron) настраивают кабельный модем на работу только с одним клиентом-компьютером по MAC-адресу его сетевого интерфейса. Как только модем запомнит MAC-адрес первого подключенного компьютера или оборудования, он ни при каких обстоятельствах не будет отвечать на запросы, идущие с других MAC-адресов. Таким образом, если вы поменяете один компьютер на другой (или поставите маршрутизатор), новый компьютер (или маршрутизатор) не будет работать с кабельным модемом из-за другого MAC-адреса. Выключите питание кабельного модема и включите его снова, чтобы сбросить настройки. Как только модем загрузится и подключится к сети, перезагрузите новый компьютер, чтобы он выполнил DHCP-запрос, или отправьте запрос DHCP-аренды вручную.\n\nЕсли это не поможет, попробуйте скопировать MAC-адрес предыдущей машины (см. Подмена MAC-адреса).\n\n"
    },
    {
      "title": "Явное уведомление о перегруженности",
      "level": 3,
      "content": "Явное уведомление о перегруженности (Explicit Congestion Notification, ECN) может стать причиной проблем с передачей информации на старых/плохих маршрутизаторах. В systemd 240 это включено для входящих соединений по требованию.\n\nЧтобы включить ECN и для входящего, и для исходящего трафика:\n\n```\n# sysctl net.ipv4.tcp_ecn=1\n```\n\nЧтобы включать ECN только по требованию входящих соединений (безопасно, используется ядром по умолчанию), выполните:\n\n```\n# sysctl net.ipv4.tcp_ecn=2\n```\n\nДля полного отключения ECN (например, чтобы проверить, действительно ли причина возникших проблем в ECN) выполните:\n\n```\n# sysctl net.ipv4.tcp_ecn=0\n```\n\nПодробнее см. документации ядра.\n\n"
    },
    {
      "title": "Broadcom BCM57780",
      "level": 3,
      "content": "Этот чипсет Broadcom иногда работает плохо, если не указать порядок загрузки модулей. Необходимые модули — broadcom и tg3, и загружаться они должны именно в таком порядке.\n\nЕсли в вашем компьютере используется этот чипсет, сделайте следующее:\n\n- Найдите вашу сетевой интерфейс в выводе lspci:\n\n```\n$ lspci | grep Ethernet\n```\n\n```\n02:00.0 Ethernet controller: Broadcom Corporation NetLink BCM57780 Gigabit Ethernet PCIe (rev 01)\n```\n\n- Если Ethernet-соединение не функционирует, выдерните кабель и выполните команды:\n\n```\n# modprobe -r tg3\n# modprobe broadcom\n# modprobe tg3\n```\n\n- Подключите обратно сетевой кабель и проверьте работу модуля:\n\n```\n# dmesg | grep tg3\n```\n\n- Если это решило проблему, сделайте изменения постоянными, добавив модули broadcom и tg3 (в этом порядке) в массив MODULES:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nMODULES=(.. broadcom tg3 ..)\n```\n\n- Пересоберите образ initramfs.\n\n- В качестве альтернативы можно создать файл /etc/modprobe.d/broadcom.conf со следующим содержимым:\n\n```\nsoftdep tg3 pre: broadcom\n```\n\n"
    },
    {
      "title": "Realtek: нет соединения / проблема WOL",
      "level": 3,
      "content": "Пользователи с сетевыми платами на основе Realtek 8168 8169 8101 8111(C) 8156B (отдельными/встроенными) могут заметить, что карта отключена во время загрузки системы и лампочка-индикатор не горит. Такое часто встречается на машинах с двумя операционными системами, одна из которых — Windows. Похоже, что причиной являются официальные драйверы Realtek (датированные маем 2007 г. и позднее) для Windows. Эти новые драйверы отключают функцию Wake-On-LAN, выключая интерфейс при завершении работы Windows, в результате чего она остаётся отключенной до следующей загрузки Windows. Пока Windows не загрузится, индикатор соединения не горит; во время завершения её работы индикатор выключается. В нормальном состоянии лампочка должна гореть всё время работы системы, даже во время POST. Проблема затрагивает и другие операционные системы, не имеющие новейших драйверов (например, Live CD). Есть несколько способов решения.\n\n"
    },
    {
      "title": "Включение сетевого интерфейса в Linux",
      "level": 4,
      "content": "Включите сетевой интерфейс, как описано в разделе Настройка сети#Включение и отключение сетевых интерфейсов.\n\n"
    },
    {
      "title": "Откат/замена драйвера для Windows",
      "level": 4,
      "content": "Вы можете откатить ваш драйвер сетевой платы в Windows на тот, который предоставляет Microsoft (если это возможно), или откатить/установить официальный драйвер Realtek, имеющий дату выпуска ранее мая 2007 г. (может найтись на компакт-диске, идущем в комплекте с вашим аппаратным обеспечением).\n\n"
    },
    {
      "title": "Включение WOL в драйвере для Windows",
      "level": 4,
      "content": "Наверное, самое лучшее и быстрое решение — изменить эту настройку в драйвере Windows. Тогда это затронет всю систему, в том числе Arch (а также live CD и другие операционные системы). В «Диспетчере устройств» найдите ваш сетевой адаптер Realtek и откройте его двойным щелчком мыши. Во вкладке «Дополнительно» измените значение «Включение по локальной сети после отключения» (Wake-on-LAN after shutdown) на «Вкл».\n\n"
    },
    {
      "title": "Включение LAN Boot ROM в BIOS/CMOS",
      "level": 4,
      "content": "Похоже, что установка Интегрированная периферия (Integrated Peripherals) --> Встроенный (Onboard) LAN Boot ROM --> Включено в BIOS/CMOS возобновляет работу чипа Realtek LAN при загрузке системы, несмотря на то, что драйвер Windows отключает его при завершении работы ОС.\n\n"
    },
    {
      "title": "Отключение автоматической приостановки USB",
      "level": 4,
      "content": "При использовании функций энергосбережения, в частности автоматической приостановки устройств USB, устройство может не загрузиться корректно, что приведёт к состоянию NO-CARRIER (проверено на RT8156B) и отсутствию соединения.\n\nДля решения проблемы можно отключить автоматическую приостановку для конкретного устройства, как описано в разделе Управление питанием#Автоматическая приостановка устройств USB или в TLP documentation on USB devices при использовании TLP; затем переподключите устройство.\n\n"
    },
    {
      "title": "Realtek RTL8111/8168B",
      "level": 3,
      "content": "```\n# lspci | grep Ethernet\n```\n\n```\n03:00.0 Ethernet controller: Realtek Semiconductor Co., Ltd. RTL8111/8168B PCI Express Gigabit Ethernet controller (rev 02)\n```\n\nЗа распознавание и работу этого сетевого интерфейса отвечает модуль r8169, однако с некоторыми ревизиями чипа есть проблемы — происходит постоянное включение/выключение устройства. Для решения проблемы можно установить модуль r8168AUR. Если r8168AUR не загружается автоматически менеджером udev, то нужно запретить загрузку модуля r8169. Подробнее загрузка модулей описана в статье Модули ядра#Автоматическая загрузка модулей.\n\nЕщё одной проблемой некоторых ревизий драйвера этого адаптера является плохая поддержка IPv6. В случае зависания страниц и низкой скорости подключения может помочь отключение функциональности IPv6.\n\n"
    },
    {
      "title": "Материнская плата Gigabyte с интерфейсом Realtek 8111/8168/8411",
      "level": 3,
      "content": "При загрузке с выключенным (настройка по умолчанию) IOMMU могут возникнуть проблемы с сетевым интерфейсом на материнских платах Gigabyte (например, Gigabyte GA-990FXA-UD3). Сетевое подключение будет неустойчивым, с малой пропускной способностью или отсутствовать вовсе. Сказанное в равной мере касается как встроенных интерфейсов, так и внешних сетевых плат на шине PCI, поскольку настройки IOMMU влияют на все сетевые интерфейсы материнской платы. Если включить IOMMU и загрузиться с установочного устройства, то на секунду появится сообщение об ошибке AMD I-10/xhci, после чего загрузка продолжится обычным образом. В результате сетевой интерфейс будет функционировать нормально (даже с модулем r8169).\n\nЕсли добавить параметр ядра iommu=soft, то при загрузке сообщение об ошибке будет подавляться.\n\n"
    },
    {
      "title": "Материнская плата MicroStar с интерфейсом Realtek 8111/8168/8411",
      "level": 3,
      "content": "В случае некоторых материнских плат вроде \"MicroStar B450M MORTAR TITANIUM\" отключение/подключение Ethernet-кабеля или перезапуск DHCP-сервера на маршрутизаторе может привести к переходу r8169 в состояние \"downshifted\", в результате чего гигабитное соединение сократится до 100-мегабитного. В логах ядра появятся следующие записи:\n\n```\n# dmesg | grep r8169\n```\n\n```\nGeneric FE-GE Realtek PHY r8169-2200:00: Downshift occurred from negotiated speed 1Gbps to actual speed 100Mbps, check cabling!\nr8169 0000:22:00.0 enp34s0: Link is Up - 100Mbps/Full (downshifted) - flow control rx/tx\n```\n\nВ этом случае необходимо перезапустить интерфейс (выключить и включить снова):\n\n```\n# ip link set dev enp34s0 down\n# ip link set dev enp34s0 up\n```\n\n"
    }
  ]
}