{
  "title": "Очистка ячеек памяти SSD",
  "url": "https://wiki.archlinux.org/title/%D0%9E%D1%87%D0%B8%D1%81%D1%82%D0%BA%D0%B0_%D1%8F%D1%87%D0%B5%D0%B5%D0%BA_%D0%BF%D0%B0%D0%BC%D1%8F%D1%82%D0%B8_SSD",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Твердотельные накопители\n- Securely wipe disk\n\nМожно полностью сбросить ячейки SSD до начального состояния, восстановив таким образом заводскую производительность записи. Известно, что производительность записи со временем снижается даже на SSD со встроенной поддержкой TRIM: он работает только при удалении файлов, но не при замене, например, инкрементном сохранении.\n\nВыполнение Secure Erase не исправит износ ячеек SSD: если накопитель близок к концу своего срока службы — возможно, сброс ещё немного продлит ему жизнь, но вскоре он всё равно перестанет работать.\n\nNote: **уничтожит все данные на SSD** \n\n- Перед продолжением работы создайте резервную копию всех важных данных! Эта процедура уничтожит все данные на SSD, и их не получится восстановить даже в сервисе! После выполнения сброса будет необходимо заново создать разделы на диске и скопировать на него нужные данные.\n- Не выполняйте эту процедуру, если целевой диск не подключен напрямую к интерфейсу SATA/NVMe. Выполнение команды Secure Erase/Format/Sanitize на диске, подключенном через USB или карту SAS/RAID, может привести к поломке диска!\n\n"
    },
    {
      "title": "Шаг 1 - Убедитесь, что диск не в состоянии \"frozen\"",
      "level": 3,
      "content": "Выполните следующую команду:\n\n```\n# hdparm -I /dev/sdX | grep frozen\n```\n\nВ разделе «Security» должна быть строка «not frozen». Если там написано «frozen», то вы не сможете продолжить. Прошивки некоторых материнских плат отправляют команду «security freeze» SATA-устройствам при инициализации.\n\nВозможное решение — просто перейти в ждущий режим. После возвращения из него состояние «frozen» скорее всего будет снято. Если это не поможет, можно попробовать на лету переподключить дата-кабель (однако ядро может упасть от такого). Если при переподключении дата-кабеля ядро падает, дайте операционной системе полностью загрузиться и быстро (пере)подключите и дата-кабель, и кабель питания. Если даже так ядро всё равно падает, проверьте, включен ли в настройках BIOS режим AHCI (он допускает подключение устройств на лету). Можно также использовать USB-SATA адаптер, если он поддерживает горячее подключение. Можно использовать hdparm через USB.\n\n"
    },
    {
      "title": "Системы Dell",
      "level": 4,
      "content": "На системах Dell обойти состояние «frozen» можно следующим образом:\n\n1. Перезагрузитесь в BIOS Dell, нажав F2 при запуске.\n1. В BIOS установите пароль внутреннего жёсткого диска (будьте осторожны, раскладка клавиатуры en_US / qwerty).\n1. Примените изменения и перезагрузитесь.\n1. Когда Dell Security Manager запросит пароль, нажмите Escape, а не вводите его. Диск останется заблокированным, но не в состоянии «frozen».\n1. Пропустите шаг 2 и перейдите непосредственно к шагу 3 ниже.\n\n"
    },
    {
      "title": "Шаг 2 - Включение защиты путём установки пароля пользователя",
      "level": 3,
      "content": "Можно использовать любой пароль, так как он всё равно будет временным. После выполнения Secure Erase защита будет снята и пароль больше не понадобится. В данном примере используется пароль PasSWorD:\n\n```\n# hdparm --user-master u --security-set-pass PasSWorD /dev/sdX\n```\n\n```\nsecurity_password=\"PasSWorD\"\n/dev/sdX:\nIssuing SECURITY_SET_PASS command, password=\"PasSWorD\", user=user, mode=high\n```\n\nДля дополнительной проверки можно выполнить команду:\n\n```\n# hdparm -I /dev/sdX\n```\n\nВ выводе команды в разделе «Master password» должна быть строка «enabled»:\n\n```\nSecurity:\n        Master password revision code = 65534\n                supported\n                enabled\n        not     locked\n        not     frozen\n        not     expired: security count\n                supported: enhanced erase\n        Security level high\n        2min for SECURITY ERASE UNIT. 2min for ENHANCED SECURITY ERASE UNIT.\n```\n\n"
    },
    {
      "title": "Шаг 3 - Отправка команды ATA Secure Erase",
      "level": 3,
      "content": "Последним шагом является отправка команды Secure Erase, которая отправляет в BIOS устройства команду стереть всё содержимое. Обратите внимание, что для устройства, используемого в этом примере, предыдущий вывод гласит:\n\n```\n2min for SECURITY ERASE UNIT. 2min for ENHANCED SECURITY ERASE UNIT.\n```\n\nСогласно спецификации ATA, «улучшенное» стирание (Enhanced Security Erase, --security-erase-enhanced) выполняет более тщательное стирание. Если расчётное время завершения для обеих команд одинаково, это указывает на то, что производитель диска использует одну и ту же функцию стирания для обеих команд. Короткое время (например, 2 минуты), в свою очередь, указывает на то, что устройство является самошифрующимся и его функция BIOS просто стирает внутренний ключ шифрования вместо перезаписи всех ячеек данных.[2]\n\nNote: **обратного пути не будет** \n\n- Трижды проверьте, что вы указали путь к правильному диску. После выполнения команды обратного пути не будет. Вас предупредили.\n- Убедитесь, что диск не примонтирован во время выполнения этой команды. Если команда стирания будет выполнена, когда устройство примонтировано, оно не сотрётся должным образом.\n\n```\n# hdparm --user-master u --security-erase PasSWorD /dev/sdX\n```\n\nДождитесь завершения выполнения команды. В данном примере показано, что для твердотельного накопителя Intel X25-M 80GB это заняло около 40 секунд.\n\n```\nsecurity_password=\"PasSWorD\"\n/dev/sdX:\nIssuing SECURITY_ERASE command, password=\"PasSWorD\", user=user\n0.000u 0.000s 0:39.71 0.0%      0+0k 0+0io 0pf+0w\n```\n\nТеперь диск очищен. После успешного стирания защита диска должна быть автоматически отключена (таким образом, для доступа больше не требуется пароль). Проверить это можно с помощью команды:\n\n```\n# hdparm -I /dev/sdX\n```\n\nВ выводе команды в разделе «Master password» должна быть строка «not enabled»:\n\n```\nSecurity:\n        Master password revision code = 65534\n                supported\n        not     enabled\n        not     locked\n        not     frozen\n        not     expired: security count\n                supported: enhanced erase\n        2min for SECURITY ERASE UNIT. 2min for ENHANCED SECURITY ERASE UNIT.\n```\n\n"
    },
    {
      "title": "Диск NVMe",
      "level": 2,
      "content": "Так как диски NVMe не используют протокол SATA и не могут быть очищены описанным выше способом, спецификация NVMe определяет стандартизированный способ очистки дисков NVMe. Первоначально эту возможность предоставляла команда nvme-format(1) (часть nvme-cli), но в Specification 1.3 добавлена поддержка специальной команды nvme-sanitize(1). По словам Джонмайкла Хэндса, сопредседателя NVMe MWG, старшего специалиста по стратегическому планированию / менеджера по продукции, Intel[3]:\n\nЧтобы проверить, что поддерживается вашим накопителем, используйте команду Identify Controller:\n\n```\n# nvme id-ctrl /dev/nvme0 -H | grep \"Format \\|Crypto Erase\\|Sanitize\"\n```\n\nПример вывода:\n\n```\n[1:1] : 0x1\tFormat NVM Supported\n  [29:29] : 0\tNo-Deallocate After Sanitize bit in Sanitize command Supported\n    [2:2] : 0\tOverwrite Sanitize Operation Not Supported\n    [1:1] : 0x1\tBlock Erase Sanitize Operation Supported\n    [0:0] : 0x1\tCrypto Erase Sanitize Operation Supported\n  [2:2] : 0x1\tCrypto Erase Supported as part of Secure Erase\n  [1:1] : 0\tCrypto Erase Applies to Single Namespace(s)\n  [0:0] : 0\tFormat Applies to Single Namespace(s)\n```\n\nЗатем выполните команду Format или Sanitize.\n\n"
    },
    {
      "title": "Команда Format",
      "level": 3,
      "content": "Команда Format концептуально ближе к смеси hdparm и fdisk, поскольку позволяет задать низкоуровневые параметры диска и дополнительно отправить команду Secure Erase.\n\nnvme-format(1) даёт следующие сведения о параметре Secure Erase Settings (-s <ses>, --ses=<ses>):\n\nВозможные значения:\n\nTable content:\nЗначение | Описание\n0 | Безопасное стирание не запрашивается\n1 | Стирание пользовательских данных (User Data Erase): Все пользовательские данные должны быть стёрты, содержимое пользовательских данных после стирания не определено (например, данные могут быть заполнены нулями, единицами и т.д.). Контроллер может выполнить криптографическое стирание, когда запрашивается стирание пользовательских данных, если они были зашифрованы.\n2 | Криптографическое стирание (Cryptographic Erase): Все пользовательские данные должны быть стёрты криптографически. Это достигается путём удаления ключа шифрования.\n\nХотя команда Format принимает либо символьное устройство NVMe (например, /dev/nvme0), либо конкретное блочное устройство пространства имён (например, /dev/nvme0n1), перед запуском убедитесь, что эта функция поддерживается вашим накопителем. Например, в выводе команды Identify Controller выше видно, что биты Crypto Erase Applies to Single Namespace(s) и Format Applies to Single Namespace(s) установлены в ноль, что, согласно спецификации, означает, что «контроллер поддерживает форматирование пространств имён по отдельности» (смотрите рисунок 249 byte row 524 «Format NVM Attributes (FNA)»).\n\nНапример, чтобы выполнить форматирование с криптографическим стиранием в пространстве имён 1 на устройстве /dev/nvme0:\n\n```\n# nvme format /dev/nvme0 -s 2 -n 1\n```\n\nБолее подробная информация, а также важные предупреждения касательно выбора устройства/пространства имён есть в nvme-format(1).\n\n"
    },
    {
      "title": "Команда Sanitize",
      "level": 3,
      "content": "Команда Sanitize была создана, чтобы быть «функционально эквивалентной одноимённой команде в реализациях SATA и SAS»[4]. Из вышеупомянутой статьи[5]:\n\nИспользование и возможные значения для опций -a/--sanact следующие[6]:\n\n```\n-a <action>\n--sanact=<action>\n    Sanitize Action\n    000b - Reserved\n    001b - Exit Failure Mode\n    010b - Start a Block Erase sanitize operation\n    011b - Start an Overwrite sanitize operation\n    100b - Start a Crypto Erase sanitize operation\n```\n\nДополнительная информация есть в nvme-sanitize(1).\n\nРазница между Block Erase и Crypto Erase заключается в том, что Crypto Erase стирает только ключ шифрования (как определено в спецификации NVMe 1.4):\n\nВы можете получить оценку времени, которое займут различные методы на вашем диске (если поддерживаются):\n\n```\n# nvme sanitize-log /dev/nvme0\n...\nEstimated Time For Overwrite                   :  4294967295 (No time period reported)\nEstimated Time For Block Erase                 :  174\nEstimated Time For Crypto Erase                :  34\n```\n\nЕсли вместо этого вы получите примерно такой результат:\n\n```\n# nvme sanitize-log /dev/nvme0\n...\nEstimated Time For Overwrite                   :  4294967295 (No time period reported)\nEstimated Time For Block Erase                 :  4294967295 (No time period reported)\nEstimated Time For Crypto Erase                :  4294967295 (No time period reported)\n```\n\nТогда будьте уверены, что операция займёт много времени. Например, на Intel 660p 512 ГБ выполнение Block Erase заняло около 2-3 часов.\n\nЗапуск Crypto Erase:\n\n```\n# nvme sanitize устройство -a 4\n```\n\nNote: **устройству целиком** \n\nЗапуск Block Erase:\n\n```\n# nvme sanitize устройство -a 2\n```\n\nЗа ходом выполнения можно следить в Sanitize Log:\n\n```\n# nvme sanitize-log /dev/nvme0\n```\n\nПример вывода для диска в процессе выполнения Crypto Erase:\n\n```\nSanitize Progress                      (SPROG) :  655\nSanitize Status                        (SSTAT) :  0x4\nSanitize Command Dword 10 Information (SCDW10) :  0x4\nEstimated Time For Overwrite                   :  4294967295 (No time period reported)\nEstimated Time For Block Erase                 :  174\nEstimated Time For Crypto Erase                :  34\nEstimated Time For Overwrite (No-Deallocate)   :  0\nEstimated Time For Block Erase (No-Deallocate) :  0\nEstimated Time For Crypto Erase (No-Deallocate):  0\n```\n\nПосле успешного завершения команды:\n\n```\nSanitize Progress                      (SPROG) :  65535\nSanitize Status                        (SSTAT) :  0x101\nSanitize Command Dword 10 Information (SCDW10) :  0x4\nEstimated Time For Overwrite                   :  4294967295 (No time period reported)\nEstimated Time For Block Erase                 :  174\nEstimated Time For Crypto Erase                :  34\nEstimated Time For Overwrite (No-Deallocate)   :  0\nEstimated Time For Block Erase (No-Deallocate) :  0\nEstimated Time For Crypto Erase (No-Deallocate):  0\n```\n\n"
    },
    {
      "title": "Общий метод с blkdiscard",
      "level": 2,
      "content": "Команда blkdiscard(8) из пакета util-linux предлагает опцию --secure, которая выполняет «Secure discard. Он аналогичен обычному discard, за исключением того, что все копии сбрасываемых блоков, которые могли быть созданы сборщиком мусора, также должны быть стёрты. Это требует поддержки со стороны устройства».\n\nЧтобы воспользоваться ею, выполните:\n\n```\n# blkdiscard --secure /dev/устройство\n```\n\nДля устройств, не поддерживающих безопасное стирание, можно использовать опцию -z/--zeroout, которая заполняет устройство нулями вместо того, чтобы просто cбрасывать все блоки на устройстве по умолчанию.\n\nОбсуждение общей безопасности blkdiscard можно посмотреть здесь [7]; иллюстрация стирания томов с помощью blkdiscard есть здесь [8].\n\n"
    },
    {
      "title": "Загрузочные записи UEFI удаляются после очистки диска",
      "level": 3,
      "content": "Некоторые реализации UEFI во время загрузки системы удаляют загрузочные записи, ссылающиеся на несуществующие файлы. Если вы планируете восстановить систему из резервной копии после очистки ячеек памяти, не забудьте также восстановить загрузочную запись с помощью efibootmgr или переустановки загрузчика.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Secure Erase HDDs/SSDs (SATA/NVMe) using hdparm & nvme-cli on Linux (2019): хорошее руководство с изображениями\n- Verifying SSD Sanitization\n\n"
    }
  ]
}