{
  "title": "Посібник з встановлення",
  "url": "https://wiki.archlinux.org/title/%D0%9F%D0%BE%D1%81%D1%96%D0%B1%D0%BD%D0%B8%D0%BA_%D0%B7_%D0%B2%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D0%BD%D1%8F",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.** Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nЦю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nЦей документ є посібником зі встановлення Arch Linux за допомогою live-системи, завантаженої з інсталяційного носія, створеного з офіційного інсталяційного образу. Інсталяційний носій надає можливості доступності, які описано на сторінці Встановлення Arch Linux з опціями доступу. Про альтернативні засоби встановлення див. Category:Процес встановлення.\n\nПеред встановленням радимо переглянути поширені запитання. Умовні позначення, використані в цьому документі, див. на сторінці Help:Читання. Зокрема, приклади коду можуть містити заповнювачі (відформатовані курсивом), які необхідно замінити вручну.\n\nЦей посібник є стислим, тому радимо дотримуватися інструкцій у порядку, в якому вони подані в кожному розділі. Детальніші інструкції можна знайти у відповідних статтях ArchWiki або на довідкових сторінках різних програм, посилання на які містяться у цьому посібнику. Для інтерактивної допомоги також доступні IRC-канал, форуми та українські спільноти ArchLinux.\n\nArch Linux має працювати на будь-якій x86_64-сумісній машині з мінімальною оперативною пам'яттю 512 МіБ, хоча для завантаження live-системи потрібно більше пам'яті для встановлення.[1] Базове встановлення займає близько 2 ГіБ дискового простору. Оскільки процес встановлення потребує отримання пакунків з віддаленого репозиторію, цей посібник передбачає наявність робочого підключення до інтернету.\n\n"
    },
    {
      "title": "Завантаження інсталяційного образу",
      "level": 3,
      "content": "Перейдіть на сторінку Завантаження і, залежно від типу завантажувача, завантажте ISO-файл чи образ netboot, а також відповідний підпис GnuPG.\n\n"
    },
    {
      "title": "Перевірка підпису",
      "level": 3,
      "content": "Рекомендується перевіряти підпис образу перед використанням, особливо при завантаженні з HTTP-дзеркала, де завантаження, як правило, можуть перехоплюватися для розповсюдження зловмисних образів.\n\nУ системі з встановленим GnuPG зробіть це, завантаживши ISO PGP signature (на завантаження у розділі Checksums) до каталогу ISO і перевіривши його за допомогою:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-версія-x86_64.iso.sig\n```\n\nАбо з наявної інсталяції Arch Linux:\n\n```\n$ pacman-key -v archlinux-версія-x86_64.iso.sig\n```\n\n- Самим підписом можна маніпулювати, якщо його завантажити з дзеркального сайту, а не з archlinux.org, як зазначено вище. У цьому випадку переконайтеся, що публічний ключ, який використовується для розшифрування підпису, підписано іншим, надійним ключем. Команда gpg виведе відбиток відкритого ключа.\n- Інший метод перевірки автентичності підпису — переконатися, що відбиток публічного ключа ідентичний відбитку ключа розробника Arch Linux, який підписав ISO-файл. Для отримання додаткової інформації щодо процесу перевірки автентичності ключів з використанням відкритих ключів див. Криптографія з публічним ключем.\n\n"
    },
    {
      "title": "Підготуйте носій для інсталяції",
      "level": 3,
      "content": "Інсталяційний образ може бути перенесено на цільову машину за допомогою флеш-накопичувача USB, оптичного диска або через мережу з PXE: дотримуйтесь відповідної статті, щоб підготувати носій для встановлення з обраного образу.\n\n"
    },
    {
      "title": "Завантажте live-середовище",
      "level": 3,
      "content": "1. Вкажіть поточний завантажувач на той, який містить інсталяційний носій Arch Linux. Зазвичай це досягається натисканням клавіші під час фази POST, як показано на заставці. Зверніться до посібника з експлуатації вашої материнської плати для отримання більш докладної інформації.\n1. Коли з'явиться меню завантажувача носія, виберіть Arch Linux install medium і натисніть Enter, щоб увійти до середовища встановлення. Порада: Інсталяційний образ використовує GRUB для UEFI і syslinux для завантаження BIOS. Для введення параметрів завантаження використовуйте відповідно клавішу e або Tab. Список параметрів наведено у файлі README.bootparams. Поширеним прикладом параметра завантаження, визначеного вручну, є розмір шрифту. Для зручності читання на екранах HiDPI, якщо вони ще не визначені такими, можна скористатися параметром fbcon=font:TER16x32. Докладні пояснення наведено у статті HiDPI#Linux console (tty).\n1. Ви ввійдете у першу віртуальну консоль як користувач root і отримаєте запрошення до командного інтерпретатора Zsh.\n\n- Інсталяційний образ використовує GRUB для UEFI і syslinux для завантаження BIOS. Для введення параметрів завантаження використовуйте відповідно клавішу e або Tab. Список параметрів наведено у файлі README.bootparams.\n- Поширеним прикладом параметра завантаження, визначеного вручну, є розмір шрифту. Для зручності читання на екранах HiDPI, якщо вони ще не визначені такими, можна скористатися параметром fbcon=font:TER16x32. Докладні пояснення наведено у статті HiDPI#Linux console (tty).\n\nЩоб переключитися на іншу консоль — наприклад, щоб переглядати цей посібник у Lynx паралельно з інсталяцією — скористайтеся комбінацією клавіш Alt+стрілка. Для редагування файлів конфігурації можна скористатися mcedit(1), nano та vim. Список пакунків, що входять до складу дистрибутива, наведено у файлі pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Виберіть розкладку клавіатури",
      "level": 3,
      "content": "Розкладка консолі за замовчуванням — US. Перегляньте доступні розкладки з допомогою:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nЩоб змінити розкладку, додайте відповідну назву файлу до loadkeys(1), забравши шлях та розширення. Наприклад для української розкладки:\n\n```\n# loadkeys ua-utf\n```\n\nКонсольні шрифти знаходяться в /usr/share/kbd/consolefonts/ і їх так само можна використати з допомогою setfont(8):\n\n```\n# setfont UniCyr_8x16\n```\n\n"
    },
    {
      "title": "Перевірте режим завантаження",
      "level": 3,
      "content": "Щоб перевірити режим завантаження, перевірте розрядність UEFI::\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nЯкщо команда повертає 64, це означає, що система завантажується в режимі UEFI та має 64-розрядний x64 UEFI. Якщо команда повертає 32, система завантажується в режимі UEFI та має 32-розрядний IA32 UEFI; хоча це підтримується, це обмежить вибір завантажувача до systemd-boot. Якщо файл не існує, можливо, система завантажується в режимі BIOS (або CSM). Якщо система не завантажилася в потрібному режимі (UEFI чи BIOS), зверніться до посібника користувача вашої материнської плати.\n\n"
    },
    {
      "title": "Підключіться до інтернету",
      "level": 3,
      "content": "Щоб налаштувати інтернет-зʼєднання, пройдіться по наступних кроках:\n\n- Переконайтесь що ваш мережевий інтерфейс є доступний і ввімкнений, наприклад з допомогою ip-link(8): # ip link\n- Приєднайтесь до мережі. Вставте Ethernet кабель чи приєднайтесь до локальної безпровідної мережі.\n- Налаштуйте ваше інтернет-зʼєднання: Постійна IP-адреса Змінна IP-адреса: використайте DHCP. Примітка: Образ встановлення вмикає dhcpcd (dhcpcd@interface.service) для дротових мережевих пристроїв при завантаженні.\n- Зʼєднання можна перевірити з допомогою ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Постійна IP-адреса\n- Змінна IP-адреса: використайте DHCP.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Оновіть системний годинник",
      "level": 3,
      "content": "Використайте timedatectl(1) щоб задати правильний системний час:\n\n```\n# timedatectl set-ntp true\n```\n\nЩоб перевірити статус сервісу використайте timedatectl status.\n\n"
    },
    {
      "title": "Розбийте диск",
      "level": 3,
      "content": "Коли роспізнані живою системою, дискам присвоєно блоковий пристрій такий як /dev/sda чи /dev/nvme0n1. Щоб опізнати ці пристрої використайте lsblk або fdisk:\n\n```\n# fdisk -l\n```\n\nНа результати що закінчуються rom, loop чи airoot можна не зважати.\n\nНаступні розділи є необхідними для вибраного пристрою:\n\n- Один розділ для кореневої теки /.\n- Якщо увімкнено UEFI – Системний розділ EFI.\n\nЯкщо ви хочете створити будь-які складені блокові пристрої для LVM, шифрування системи чи RAID, то робіть це зараз.\n\n"
    },
    {
      "title": "Приклади розбиття",
      "level": 4,
      "content": "Table content:\nBIOS з MBR\nТочка монтування | Розділ | Тип розділу | Пропонований розмір\n/mnt | /dev/sdX1 | Linux | Залишок пристрою\n[SWAP] | /dev/sdX2 | Linux swap | Більше ніж 512 МіБ\nUEFI з GPT\nТочка монтування | Розділ | Partition type | Пропонований розмір\n/mnt/boot or /mnt/efi | /dev/sdX1 | Системний розділ EFI | 260–512 МіБ\n/mnt | /dev/sdX2 | Linux x86-64 root (/) | Залишок пристрою\n[SWAP] | /dev/sdX3 | Linux swap | Більше ніж 512 МіБ\n\nДивіться також Розбиття диску#Приклади розбиття.\n\n- Використовуйте fdisk або parted для редагування таблиці розділів, наприклад: fdisk /dev/sdX.\n- Swap простір може бути розміщений на swap-файлі на файловій системі що їх підтримує.\n\n"
    },
    {
      "title": "Форматуйте розділи",
      "level": 3,
      "content": "Створені розділи потрібно форматувати, кожен відповідною файловою системою. Наприклад якщо коренева тека є на /dev/sdX1 та буде містити файлову систему ext4 то виконайте:\n\n```\n# mkfs.ext4 /dev/sdX1\n```\n\nЯкщо ви створили розділ для swap, започаткуйте його з допомогою mkswap та увімкніть з допомогою swapon:\n\n```\n# mkswap /dev/sdX2\n# swapon /dev/sdX2\n```\n\nДля деталей дивіться Файлові системи#Створення файлової системи.\n\n"
    },
    {
      "title": "Монтуйте файлові системи",
      "level": 3,
      "content": "Монтуйте файлову систему на кореневу теку до /mnt, наприклад:\n\n```\n# mount /dev/sdX1 /mnt\n```\n\nСтворіть всі решту точок монтувань, що залишилися (такі як /mnt/efi) та змонтуйте їх відповідні розділи.\n\nОпісля, genfstab(8) знайде монтовані файлові системи та swap-простір.\n\n"
    },
    {
      "title": "Виберіть дзеркало",
      "level": 3,
      "content": "Пакунки що будуть встановлені мають бути завантажені з серверів-здеркал, які визначені в /etc/pacman.d/mirrorlist. На живій системі усі дзеркала є увімкненими та сортованими за їх статусом синхронізації та швидкості на час коли образ встановлення був створений.\n\nЧим вище дзеркало в списку, тим більший воно має пріоритет коли заватажується пакет. Бажано відредагувати файл відповідним чином та перемістити дзеркала, розташовані найближче географічно у верхню частині списку, хоча слід враховувати й інші критерії.\n\nЦей файл буде скопійовано потім до новоствореної системи командою pacstrap, тому вартує його виправити вже зараз.\n\n"
    },
    {
      "title": "Встановіть необхідні пакети",
      "level": 3,
      "content": "Використайте скрипт pacstrap(8) для встановлення пакунку base, ядра Linux та прошивок для поширених пристроїв:\n\n```\n# pacstrap /mnt base linux linux-firmware\n```\n\nПакунок base не містить усіх засобів присутніх на живій системі, тому встановлення інших пакетів може знадобитися для повністю функціональної базової системи. Зокрема, розгляньте встановлення:\n\n- користувацьких засобів для роботи з файловими системами, що будуть використовуватися в системі,\n- засоби доступу до розділів RAID чи LVM,\n- особливі прошивки для інших пристроїв відсутні у linux-firmware,\n- програми необхідні для мережі,\n- редактор тексту,\n- пакунки для доступу до документації в сторінках man та сторінках info: man-db, man-pages та texinfo.\n\nДля встановлення інших пакунків чи груп пакунків, додайте їх назви до команди pacstrap вище (розділено пробілами) або використайте pacman коли зайшли chroot в нову систему. Для порівняння, пакунки доступні в живій системі можна знайти в packages.x86_64.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Генеруйте файл fstab (використайте -U або -L щоб визначити диск за UUID або підписом, відповідно):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nПеревірте результат у /mnt/etc/fstab та відредагуйте його в разі помилки.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Змініть кореневу теку в нову систему:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Часова зона",
      "level": 3,
      "content": "Встановіть часову зону:\n\n```\n# ln -sf /usr/share/zoneinfo/Region/City /etc/localtime\n```\n\nВиконайте hwclock(8) щоб створити /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nЦя команда має на увазі, що апаратний годинник встановлений на UTC. Для деталей дивіться Системний час#Стандарт часу.\n\n"
    },
    {
      "title": "Локалізація",
      "level": 3,
      "content": "Розкоментуйте en_US.UTF-8 UTF-8 та інші потрібні локалі в /etc/locale.gen, та створіть їх з допомогою:\n\n```\n# locale-gen\n```\n\nСтворіть locale.conf(5) та встановіть змінну LANG відповідно:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=uk_UA.UTF-8\n```\n\nЯкщо ви вибрали розкладку клавіатури, зробіть зміни постійними в vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=ua-utf\nFONT=UniCyr_8x16\n```\n\n"
    },
    {
      "title": "Налаштування мережі",
      "level": 3,
      "content": "Створіть файл hostname:\n\n```\n/etc/hostname\n```\n\n```\nmyhostname\n```\n\nДодайте відповідні записи в hosts(5):\n\n```\n/etc/hosts\n```\n\n```\n127.0.0.1\tlocalhost\n::1\t\tlocalhost\n127.0.1.1\tmyhostname.localdomain\tmyhostname\n```\n\nЯкщо система має постійну IP-адресу, то вона повинна бути записана замість 127.0.1.1.\n\nЗавершіть налаштування мережі для нововстановленої системи, включно з встановленням програм для мережі на ваш смак.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Створення нової initramfs зазвичай не потрібно, бо mkinitcpio було виконано при встановленні пакунка ядра Linux з pacstrap.\n\nДля LVM, шифрування системи чи RAID, змініть mkinitcpio.conf(5) та пересворіть образ initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Пароль root",
      "level": 3,
      "content": "Встановіть пароль для root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Завантажувач Linux",
      "level": 3,
      "content": "Виберіть та встановіть Linux-сумісний завантажувач Linux. Якщо у вас Intel або AMD процесор, додатково увімкніть оновлення Мікрокоду.\n\n"
    },
    {
      "title": "Перезавантажте систему",
      "level": 2,
      "content": "Вийдіть з оточення chroot з допомогою команди exit або комбінації клавіш Ctrl+d.\n\nНеобовʼязково вручну відмонтуйте всі розділи з допомогою umount -R /mnt: це дозволяє помітити \"зайняті\" розділи, та знайдіть причину з допомогою fuser(1).\n\nНасамкінець перезавантажте компʼютер ввівши команду reboot: будь-які змонтовані розділи будуть автоматично відмонтовані systemd. Не забудьте вийняти засіб встановлення та потім увійти в нову систему як користувач root.\n\n"
    },
    {
      "title": "Після встановлення",
      "level": 2,
      "content": "Для керування системою та інструкцій після встановлення (наприклад налаштування графічного інтерфейсу користувача, звуку чи тачпада) дивіться Загальні рекомендації.\n\nДля переліку програм що можуть вас зацікавити дивіться Список програм.\n\n"
    }
  ]
}