{
  "title": "Про KDE",
  "url": "https://wiki.archlinux.org/title/%D0%9F%D1%80%D0%BE_KDE",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.** Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nЦю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nRelated articles\n\n- Desktop_environment_(Українська)\n\nKDE це інтренаціональний проєкт по безкоштовному програмному забеспеченню, який наразі включає стільницю, відома як Plasma, набір бібліотек і фреймворків (KDE Frameworks) та великий список програм (KDE Applications).\n\n"
    },
    {
      "title": "Plasma",
      "level": 3,
      "content": "Для установки треба завантажити мета-пакет plasma-meta або груповий пакет plasma. Різницю між plasma-meta і plasma можна прочитати в Package group. Також, для більш мінімального завантаження плазми, можна завантажити plasma-desktop. Крім того, KDE має рекомендації по пакетам щоб отримати найкращий досвід роботи з плазмою.\n\nЯкщо ви використовуєте NVIDIA з пропрієтарним nvidia драйвером, і хочете використовувати сеанс Wayland, увімкніть DRM kernel mode setting.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 3,
      "content": "Завантажте plasma-mobileAUR. Також можете установити qt5-wayland для Maliit віртуальної клавіатури.\n\n"
    },
    {
      "title": "KDE програми",
      "level": 3,
      "content": "Щоб установити всі програми KDE, завантажте kde-applications груповий пакет або kde-applications-meta для мета-пакету. Якщо ви не хочете устанавлювати кожну програму, а тільки декілька або одну, можна установити програми, які вам потрібні з kde-applications-meta. Завуажте, це тільки програми KDE, плазма сюди не входить.\n\n"
    },
    {
      "title": "Нестабільні релізи",
      "level": 3,
      "content": "Подивіться Official repositories#kde-unstable для бета релізів.\n\n"
    },
    {
      "title": "Запуск Plasma",
      "level": 2,
      "content": "Плазму можна запустити за допомогою диспетчера дисплея або з консолі.\n\n"
    },
    {
      "title": "За допомогою диспетчера дисплея",
      "level": 3,
      "content": "- Оберіть Plasma (Wayland) щоб запустити новий сеанс в Wayland.\n- Оберіть Plasma (X11) щоб запустити новий сеанс в Xorg.\n- Оберіть Plasma Mobile (Wayland) щоб запустити новий сеанс Plasma Mobile в Wayland.\n\n"
    },
    {
      "title": "З консолі",
      "level": 3,
      "content": "- Щоб запустити плазму у сеансі Wayland: /usr/lib/plasma-dbus-run-session-if-needed /usr/bin/startplasma-wayland[1].\n- Щоб запустити плазму за допомогою xinit/startx, добавте export DESKTOP_SESSION=plasma і exec startplasma-x11 до Вашого .xinitrc файлу або запустити безпосередньо в консолі startx /usr/bin/startplasma-x11. Якщо Ви хочете починати Xorg коли заходите в систему, подивіться Start X at login.\n\n"
    },
    {
      "title": "Конфігурація",
      "level": 2,
      "content": "Більшість налаштувань програм KDE зберігаються в ~/.config/. Однак, налаштування KDE в першу чергу виконується за допомогою програми «Системні параметри». Її можна запустити з терміналу, виконавши systemsettings\n\n"
    },
    {
      "title": "Plasma desktop",
      "level": 4,
      "content": "Існують різні типи тем KDE, залежно від того, що вони змінюють:\n\n- Global themes, комплексні пакети, які можуть містити теми плазми, стилі програм, кольори, шрифти, піктограми, курсори, екрани-заставки, теми SDDM та схеми кольорів Konsole.\n- Plasma themes, зміна вигляду панелей і віджетів плазми. Вони часто мають рекомендовану супровідну тему Kvantum або Aurorae, щоб завершити зовнішній вигляд.\n- Application styles, зміна вигляду програм.\n- Application styles які використовують двигуни тем, такі як Kvantum, QtCurve [2], QSvgStyle [3] і Aurorae.\n- #Теми піктограм, надання піктограм для програм, файлів і дій.\n\nДля простого встановлення й оновлення в системі, деякі теми доступні в обох офіціальних репозиторіях і AUR.\n\nГлобальні теми також можна встановити через Системні параметри > Кольори і теми > Глобальні теми > Отримати нові....\n\nРекомендованою темою для приємного вигляду в програмах GTK є breeze-gtk, тема GTK, створена для імітації зовнішнього вигляду теми Breeze Plasma. Установіть kde-gtk-config (частина plasma), увійдіть повторно та виберіть Breeze як тему GTK у Системні параметри > Кольори і теми > Стиль вікон програм > Налаштувати стиль програм GNOME/GTK.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nУ деяких темах підказки в програмах GTK мають білий текст на білому фоні, що ускладнює читання. Щоб змінити кольори в програмах GTK2, знайдіть розділ для підказок у .gtkrc-2.0 файлі, і змініть це. Для програми GTK3 потрібно змінити два файли, gtk.css і settings.ini.\n\nДеякі GTK2 програми, типу vuescan-binAUR досі виглядають непридатними для використання через невидимі прапорці з темою Breeze або Adwaita під час сеансу Плазми. Щоб вирішити цю проблему, установіть і виберіть, наприклад Numix-Frost-Light тему numix-frost-themesAUR під Системні параметри > Кольори і теми > Стиль вікон програм > Налаштувати стиль програм GNOME/GTK...> Тема GTK. Numix-Frost-Light виглядає, як Breeze.\n\nПлазма і SDDM використовують /var/lib/AccountsService/icons/, як аватар юзера. Щоб налаштувати за допомогою графічного інтерфейсу, ви можете використовувати Системні параметри > Користувачі. Файл, що відповідає вашому імені користувача, можна видалити, щоб відновити стандартний аватар.\n\nPlasmoids(Плазмоіди) це віджети для оболонки плазмового робочого столу, призначені для покращення функціональності робочого столу, їх можна знайти на AUR.\n\nПлазмоідні скрипти також можна встановити, клацнувши правою кнопкою миші на панелі або робочому столі, і вибравши Увійти до режиму редагування > Доадати віджети... > Отримати нові віджети... > Отримати нові віджети Плазми. Це буде інтерфейс для https://store.kde.org/ який дозволяє встановлювати, видаляти або оновлювати сторонні скрипти плазмоідів одним клацанням миші.\n\nУстановіть plasma-pa або kmix (Kmix стартується з лаунчеру програм). plasma-pa тепер попередньо встановлен в plasma, налаштовувати не треба.\n\nКоли вікно плазми поверху інших вікон, тіні малюються на вікнах позаду[4]. Щоб вимкнуте це без інших тіней, можна завантажити xorg-xprop і прописати:\n\n```\n$ xprop -remove _KDE_NET_WM_SHADOW\n```\n\nпотім виберіть панель за домогою курсора \"+\" форми [5]. Для автоматизації можна установити xorg-xwininfo, і створити такий скрипт:\n\n```\n/usr/local/bin/kde-no-shadow\n```\n\n```\n#!/bin/bash\nfor WID in $(xwininfo -root -tree | sed '/\"plasmashell\": (\"plasmashell\" \"plasmashell\")/!d; s/^  *\\([^ ]*\\) .*/\\1/g'); do\n   xprop -id $WID -remove _KDE_NET_WM_SHADOW\ndone\n```\n\nЗробіть скрипт виконуваним.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nСкрипт може бути виконан при заході в систему в Add Login Script у Autostart:\n\n```\n$ kcmshell6 autostart\n```\n\nДивитися HiDPI#KDE Plasma.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 4,
      "content": "plasma-phone-settings має доволі багато налаштувань, які можна застосувати глобально (/etc/xdg) і/або для відкремих користувачів (~/.config).\n\n/etc/xdg/kscreenlockerrc (or ~/.config/kscreenlockerrc) блокує екран негайно після входу в систему. [6]. Це корисно в комбінації з SDDM#Autologin.\n\nЯкщо Ваш девайс має реальну клавіатура, але Ви хочете викорстовувати віртуальну клавіатуру, добавте цю KWIN_IM_SHOW_ALWAYS=1 змінну середовища до Вашого сеансу Wayland.\n\n"
    },
    {
      "title": "Декорації вікон",
      "level": 4,
      "content": "Декорації вікон можуть бути знайдени в AUR.\n\nВони можуть бути змінені в Системні параметри > Кольори і теми > Обрамлення вікон, ви можете завантажити їх напряму в пару кліків.\n\n"
    },
    {
      "title": "Теми піктограм",
      "level": 4,
      "content": "Теми піктограм можна встановлювати та змінювати в Системні параметри > Кольори і теми > Піктограми.\n\n"
    },
    {
      "title": "Ефективність простору",
      "level": 4,
      "content": "Оболочка нетбуку Плазми було вилучено з Plasma 5, дивитися: Пост з форума KDE. Однак ви можете досягти чогось подібного, відредагувавши файл ~/.config/kwinrc добавлячи BorderlessMaximizedWindows=true в [Windows] секцію.\n\n"
    },
    {
      "title": "Генерація перегляду",
      "level": 4,
      "content": "Щоб дозволити створення перегляду для мультимедійних файлів або файлів документів на стільниці і в Dolphin, завантажте kdegraphics-thumbnailers і ffmpegthumbs.\n\nЩоб увімкнути категорії перегляду для стільниці: ПКМ по фону стільниі > Налаштувати стільницю і фонове зображення... > Піктограми > Налаштувати додатки перегляду....\n\nУ Dolphin, перейдіть до Налаштувати > Налаштувати Dolphin... > Інтерфейс > Перегляд.\n\n"
    },
    {
      "title": "Нічні кольори",
      "level": 3,
      "content": "Плазма надає функцію, схожу на Redshift (працює як на Xorg, так і на Wayland) під назвою Night Light. Це робить кольори на екрані теплішими, щоб зменшити навантаження на очі у вибраний вами час. Його можна ввімкнути в «Системні параметри > Кольори і теми > Нічні кольори»..\n\n"
    },
    {
      "title": "Принтери",
      "level": 3,
      "content": "Ви також можете налаштувати принтери в «Системні параметри > Принтери». Щоб скористатися цим методом, спочатку потрібно встановити наступні пакети print-manager, cups, system-config-printer. Дивитися CUPS#Configuration.\n\n"
    },
    {
      "title": "Підтримка Samba/Windows",
      "level": 3,
      "content": "Функціональність спільного використання Dolphin потребує пакета kdenetwork-filesharing і спільного доступу користувачів, які не ввімкнуто у стандартному smb.conf. Інструкції щодо їх додавання наведено в Samba#Enable Usershares, після чого спільний доступ у Dolphin має працювати одразу після перезапуску Samba.\n\nДоступ до спільних ресурсів Windows із Dolphin працює одразу. Використовуйте шлях smb://servername/share для перегляду файлів.\n\nНа відміну від файлових браузерів GTK, які також використовують GVfs для запущеної програми, відкриття файлів зі спільних ресурсів Samba в Dolphin через KIO спонукає Плазму спочатку скопіювати весь файл до локальної системи у більшості програм (виняток становить VLC). Щоб вирішити цю проблему, ви можете використати файловий браузер на основі GTK, наприклад thunar з gvfs і gvfs-smb (та gnome-keyring для збереження облікових даних для входу) для зручнішого доступу до спільних ресурсів SMB.\n\nІншою можливістю є монтувати спільний ресурс Samba за допомогою cifs-utils, щоб у Плазмі він виглядав так, ніби спільний ресурс SMB був просто звичайною локальною текою, і тому до нього можна було нормально отримати доступ. Дивитися Samba#Manual mounting та Samba#Automatic mounting.\n\nРішення з графічним інтерфейсом користувача доступне з samba-mounter-gitAUR, яке пропонує в основному ту саму функціональність через простий у користуванні параметр, розташований у «Системні параметри» > «Мережеві драйвери». Однак він може вийти з ладу з новими версіями KDE Plasma.\n\n"
    },
    {
      "title": "Діяльність стільниці KDE",
      "level": 3,
      "content": "Дії робочого столу KDE — це спеціальні робочі області, де ви можете вибрати спеціальні параметри для кожної дії, які застосовуються лише тоді, коли ви використовуєте цю дію.\n\n"
    },
    {
      "title": "Керування живленням",
      "level": 3,
      "content": "Установіть powerdevil для інтегрованої служби керування живленням плазми. Ця послуга пропонує додаткові функції енергозбереження, контролю яскравості (якщо підтримується), і звітування про батарею, включаючи периферійні пристрої.\n\n"
    }
  ]
}