{
  "title": "Про ArchWiki",
  "url": "https://wiki.archlinux.org/title/%D0%9F%D1%80%D0%BE_ArchWiki",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Editing\n- Help:Style\n- Help:Reading\n\nЦя стаття є загальним оглядом ArchWiki, що відповідає на питання «Хто?», «Що?», «Чому?» і «Як?».\".\n\n"
    },
    {
      "title": "Цілі",
      "level": 2,
      "content": "Основною метою ArchWiki є надання спільноті користувачів Arch Linux найповнішої та найдоступнішої документації в Інтернеті. Це всесвітній проект з багатьма учасниками з усіх куточків світу. Вікі охоплює всі принципи Arch Linux, зокрема щодо простоти. ArchWiki постійно розвивається і процвітає завдяки співпраці; завжди є місце для покращення.\n\n"
    },
    {
      "title": "Головна ціль",
      "level": 3,
      "content": "Однією з головних цілей ArchWiki це висвітлення «усіх» аспектів обчислень за допомогою Arch Linux. Від медіацентру до керування корпоративними мережами - все, що може зробити Arch Linux, знаходиться у сфері дії ArchWiki.\n\n"
    },
    {
      "title": "Мета",
      "level": 3,
      "content": "Основна мета АrchWiki може бути грандіозною і вимагати тисячі статей; ArchWiki має пропонувати простий та інтуїтивно зрозумілий спосіб доступу до всієї інформації. Це не просте завдання, але типова для Arch винахідливість і уява візьмуть гору.\n\nOфіційні arch-wiki-docs пропонує користувачам можливість завантажити копію вмісту ArchWiki. Дивіться це обговорення на форумі для деталей.\n\n"
    },
    {
      "title": "Як це працює",
      "level": 2,
      "content": "ArchWiki підтримується офіційною Команда підтримки та тисячі учасників. Користувачі редагують і впорядковують статті, щоб запропонувати читачам найкраще у документації Arch Linux. Вміст створюється спільнотою, для спільноти: більшість статей не написані однією людиною, а є результатом спільних зусиль багатьох людей, які виправляють помилкову інформацію, оновлюють застарілі статті та іншим чином покращують вміст ArchWiki.\n\n"
    },
    {
      "title": "Як ви можете допомогти",
      "level": 2,
      "content": "ArchWiki підтримується волонтерами. Учасників ніколи не буває забагато, і допомога потрібна завжди. Якщо ви відчуваєте, що здатні редагувати вікі-сторінки, подумайте про те, щоб пожертвувати частину свого часу та енергії спільноті.\n\nБудь ласка зазирніть до ArchWiki:Contributing щоб дізнатися, як можна зробити свій внесок.\n\n"
    },
    {
      "title": "Історія",
      "level": 2,
      "content": "- 2004-01-11 || Було оголошено про початковий вікі-подібний спосіб додавання документації до форумів, заснований на відкритому обліковому записі користувача.\n- 2004-02-03 || Першу пропозицію щодо вікі-документації для Arch Linux було зроблено на форумах.\n- 2004-02-27 || На форумах було оголошено про створення першої вікі на основі PhpWiki.\n- 2005-06-05 || Було запропоновано перехід на поточну інсталяцію MediaWiki.\n- 2005-07-08 || ArchWiki створена на MediaWiki.\n- 2005-07-11 || Перше редагування, зроблене до статті ArchWiki:General disclaimer.\n- 2005-07-11 || Перше редагування у просторі імен Main, зроблене на Main page.\n- 2005-07-18 || Про нову інсталяцію було оголошено на форумах: таким чином розпочалася міграція вже існуючих статей з версії PhpWiki.\n\n"
    },
    {
      "title": "Контакти",
      "level": 2,
      "content": "Дивіться ArchWiki:Maintenance Team для отримання списку координаторів ArchWiki.\n\n"
    },
    {
      "title": "Подяка",
      "level": 2,
      "content": "- Хостинг люб'язно надано Arch Linux\n- За підтримки MediaWiki\n- Дякую усім нашим учасникам та волонтерам!\n\n"
    }
  ]
}