{
  "title": "Раздел подкачки",
  "url": "https://wiki.archlinux.org/title/%D0%A0%D0%B0%D0%B7%D0%B4%D0%B5%D0%BB_%D0%BF%D0%BE%D0%B4%D0%BA%D0%B0%D1%87%D0%BA%D0%B8",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- fstab (Русский)\n- Ждущий и спящий режимы#Гибернация\n- zswap (Русский)\n- zram (Русский)\n- Swap on video ram\n- ZFS#Swap volume\n- dm-crypt/Swap encryption\n\nНа этой странице представлено введение в пространство подкачки и подкачку страниц в GNU/Linux. Она охватывает создание и активацию файлов и разделов подкачки.\n\nИз All about Linux swap space:\n\nРабота с подкачкой обеспечивается ядром Linux и инструментами из пакета util-linux в пользовательском пространстве.\n\n"
    },
    {
      "title": "Пространство подкачки",
      "level": 2,
      "content": "Пространство подкачки может быть разделом диска или файлом. Пользователи могут создать пространство подкачки во время установки или позднее в любое желаемое время. Пространство подкачки может быть использовано для двух целей: для расширения доступной виртуальной памяти и для сохранения данных при переходе в спящий режим.\n\nИмеет ли смысл расширять виртуальную память с помощью подкачки, зависит от объёма установленной физической памяти. Если он меньше, чем объём памяти, необходимый для запуска всех нужных программ, то добавление подкачки может оказаться полезно. Это позволит избежать состояния нехватки памяти (out of memory) и срабатывания OOM killer в ядре, который попытается освободить память путём убийства процессов. Чтобы увеличить количество виртуальной памяти до требуемого уровня, добавьте необходимую разницу (или больше) в качестве пространства подкачки.\n\nСамый большой недостаток использования подкачки — снижение производительности; смотрите раздел #Производительность. Поэтому включение подкачки — это вопрос личных предпочтений: кому-то может быть предпочтительнее убить процессы при нехватке памяти, а кому-то важно сохранить работу ценой снижения скорости работы системы.\n\nПроверить статус подкачки можно командой:\n\n```\n$ swapon --show\n```\n\nПосмотреть использование физической памяти и подкачки:\n\n```\n$ free -h\n```\n\n"
    },
    {
      "title": "Раздел подкачки",
      "level": 2,
      "content": "Раздел подкачки может быть создан в большинстве инструментов для разметки. Разделы подкачки обычно обозначаются как тип 82 в MBR и как 0657FD6D-A4AB-43C4-84E5-0933C84B4F4F в GPT.\n\nЧтобы создать пространство подкачки на месте нужного раздела, используйте команду mkswap(8):\n\n```\n# mkswap /dev/sdxy\n```\n\nЧтобы задействовать его:\n\n```\n# swapon /dev/sdxy\n```\n\nЧтобы автоматически подключать этот раздел подкачки при загрузке системы, добавьте запись в /etc/fstab:\n\n```\nUUID=UUID_устройства none swap defaults 0 0\n```\n\nГде UUID_устройства — это UUID раздела, используемого в качестве пространства подкачки.\n\nСинтаксис файла описан в статье fstab (Русский).\n\n"
    },
    {
      "title": "Активация с использованием systemd",
      "level": 3,
      "content": "systemd может автоматически активировать разделы подкачки, используя два различных механизма. Оба являются исполняемыми файлами в каталоге /usr/lib/systemd/system-generators. Это генераторы, которые запускаются при загрузке системы и создают mount-юниты. Первый — systemd-fstab-generator, который считывает файл fstab и из его содержимого генерирует systemd-юниты, в том числе юниты для подкачки. Второй — systemd-gpt-auto-generator, который сканирует корневой диск для создания юнитов. Он работает только с GPT-дисками и ищет разделы подкачки по GUID; смотрите раздел systemd (Русский)#Автомонтирование GPT-раздела для более подробной информации.\n\n"
    },
    {
      "title": "Отключение подкачки",
      "level": 3,
      "content": "Чтобы деактивировать определённое пространство подкачки:\n\n```\n# swapoff /dev/sdxy\n```\n\nТакже можно использовать ключ -a, чтобы деактивировать все пространства подкачки.\n\nПоскольку подкачкой управляет systemd, она вновь будет активирована при следующем старте системы. Чтобы навсегда отключить активацию автоматически обнаруженного пространства подкачки, выполните systemctl --type swap для получения списка .swap юнитов и замаскируйте те юниты, которые вы хотите отключить.\n\n"
    },
    {
      "title": "Файл подкачки",
      "level": 2,
      "content": "Вместо создания целого раздела можно использовать файл подкачки. Он даёт возможность менять свой размер на лету, а также его гораздо легче полностью удалить. Это может быть особенно важно, если место на диске ограничено (например, небольшие SSD).\n\n"
    },
    {
      "title": "Создание файла подкачки",
      "level": 3,
      "content": "Используйте команду dd для создания файла подкачки нужного вам размера. Пример для создания файла размером 8 ГиБ:\n\n```\n# dd if=/dev/zero of=/swapfile bs=1M count=8k status=progress\n```\n\nУстановите правильные права доступа (файл подкачки, доступный для чтения всем, — это огромная локальная уязвимость):\n\n```\n# chmod 0600 /swapfile\n```\n\nПосле создания файла нужного размера отформатируйте его как подкачку:\n\n```\n# mkswap -U clear /swapfile\n```\n\nАктивируйте файл подкачки:\n\n```\n# swapon /swapfile\n```\n\nНаконец, добавьте запись для файла подкачки в файл fstab:\n\n```\n/etc/fstab\n```\n\n```\n/swapfile none swap defaults 0 0\n```\n\nСинтаксис файла описан в статье fstab (Русский).\n\n"
    },
    {
      "title": "Удаление файла подкачки",
      "level": 3,
      "content": "Перед удалением файла подкачки сперва отключите его:\n\n```\n# swapoff /swapfile\n# rm -f /swapfile\n```\n\nНе забудьте удалить соответствующую строку в /etc/fstab.\n\n"
    },
    {
      "title": "Сжатое блочное устройство в ОЗУ",
      "level": 2,
      "content": "zswap используется по умолчанию, если вы используете файл или раздел подкачки, но вы можете обойтись вообще без файла или раздела подкачки и вместо него создать сжатое блочное устройство в оперативной памяти с помощью zram. Информация о различиях между использованием zram и zswap описана в разделе Увеличение производительности#zram или zswap.\n\n"
    },
    {
      "title": "Шифрование подкачки",
      "level": 2,
      "content": "Смотрите dm-crypt/Swap encryption.\n\n"
    },
    {
      "title": "Производительность",
      "level": 2,
      "content": "Операции с подкачкой обычно выполняются значительно медленнее, чем прямой доступ к данным в ОЗУ. Полное отключение подкачки ради повышения производительности иногда может привести к её ухудшению, поскольку уменьшается объём памяти, доступной для кэша виртуальной файловой системы (VFS), что приводит к более частым дорогостоящим обращениям к накопителю.\n\nЗначения подкачки можно настроить, чтобы помочь производительности:\n\n"
    },
    {
      "title": "Swappiness",
      "level": 3,
      "content": "Когда использование памяти достигает определённого порога, ядро начинает просматривать активную память и смотреть, что можно освободить. Изменённые данные файлов можно записать в файловую систему, выгрузить из памяти и по необходимости загрузить позже; другие данные, не связанные с файлами, нужно будет записать в подкачку перед выгрузкой.\n\nПараметр sysctl swappiness отображает предпочтение ядра записывать подкачку вместо записи файлов. Он может иметь значение от 0 до 200 (максимум 100 на Linux < 5.8); значение по умолчанию равно 60. При низком значении ядро будет предпочитать выгрузку открытых файлов, при высоком — предпочитать использование подкачки, а значение 100 означает, что затраты на ввод-вывод считаются равными. Известно, что использование низкого значения при достаточном количестве памяти улучшает отзывчивость на системах с ядрами <4.0.\n\nЧтобы проверить текущее значение swappiness:\n\n```\n$ sysctl vm.swappiness\n```\n\nТакже можно посмотреть файл /sys/fs/cgroup/memory/memory.swappiness (специфичный для cgroup v1) или /proc/sys/vm/swappiness.\n\nЧтобы временно установить значение swappiness:\n\n```\n# sysctl -w vm.swappiness=10\n```\n\nЧтобы сделать изменение постоянным, создайте файл настроек sysctl.d(5), например:\n\n```\n/etc/sysctl.d/99-swappiness.conf\n```\n\n```\nvm.swappiness = 10\n```\n\nЧтобы значение swappiness задавал загрузчик при загрузке ядра, добавьте параметр ядра, например sysctl.vm.swappiness=10.\n\nЧтобы проверить и больше узнать, почему оно так работает, посмотрите эту статью. Смотрите также более новую статью о распространённых заблуждениях.\n\n"
    },
    {
      "title": "VFS cache pressure",
      "level": 3,
      "content": "Ещё один sysctl параметр, влияющий на производительность подкачки, — vm.vfs_cache_pressure. Он контролирует склонность ядра к задействованию (reclaim) памяти, которая используется для кэширования VFS caches, вместо кэша страниц и подкачки. Увеличение этого значения увеличивает частоту, с которой будет забираться память VFS caches[1]. Более подробная информация есть в документации ядра Linux.\n\n"
    },
    {
      "title": "Приоритет",
      "level": 3,
      "content": "Если у вас несколько файлов или разделов подкачки, можно присвоить им приоритеты (от 0 до 32767). Система будет использовать пространства подкачки с высоким приоритетом перед использованием пространств с низким приоритетом. Например, если у вас есть быстрый диск (/dev/sda) и медленный (/dev/sdb), назначьте высокий приоритет для подкачки, расположенной на быстром устройстве. Приоритет можно задать в файле fstab с помощью параметра pri:\n\n```\n/dev/sda1 none swap defaults,pri=100 0 0\n/dev/sdb2 none swap defaults,pri=10  0 0\n```\n\nИли с помощью параметра --priority в команде swapon:\n\n```\n# swapon --priority 100 /dev/sda1\n```\n\nЕсли несколько подкачек будут иметь одинаковый приоритет и он будет самым высоким из доступным приоритетов, то страницы будут распределяться по кругу между этими подкачками.\n\n"
    },
    {
      "title": "Чередование",
      "level": 3,
      "content": "Нет необходимости использовать RAID для повышения производительности подкачки. Ядро самостоятельно может чередовать подкачку на нескольких устройствах, если вы присвоите им одинаковый приоритет в /etc/fstab. Подробнее смотрите The Software-RAID HOWTO.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- В защиту свопа: распространенные заблуждения\n\n"
    }
  ]
}