{
  "title": "Расширения для браузеров",
  "url": "https://wiki.archlinux.org/title/%D0%A0%D0%B0%D1%81%D1%88%D0%B8%D1%80%D0%B5%D0%BD%D0%B8%D1%8F_%D0%B4%D0%BB%D1%8F_%D0%B1%D1%80%D0%B0%D1%83%D0%B7%D0%B5%D1%80%D0%BE%D0%B2",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Плагины для браузеров\n\nВ этой статье перечислены некоторые расширения для браузеров, доступные для Firefox и/или Chromium.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Расширения Firefox можно установить с сайта addons.mozilla.org; управление расширениями выполняется через страницу about:addons.\n\nРасширения Chrome можно установить из Chrome Web Store; управление расширениями выполняется через страницу chrome://extensions/.\n\nНекоторые расширения для Firefox также доступны в официальных репозиториях и в AUR.\n\nЧтобы упростить обслуживание, в этой статье нет ссылок на страницы магазинов или пакеты расширений в AUR. Если пакет недоступен, читателям рекомендуется получать расширения через официальные сайты по указанным ссылкам.\n\n"
    },
    {
      "title": "Конфиденциальность",
      "level": 2,
      "content": "Смотрите также Firefox/Privacy и Chromium#Security.\n\n"
    },
    {
      "title": "Блокировщики контента",
      "level": 3,
      "content": "- uBlock Origin — Лёгкий, эффективный блокировщик, который не требует много памяти и процессора. Он поставляется с несколькими списками фильтров, готовыми к использованию из коробки (включая EasyList, Peter Lowe, несколько списков фильтров вредоносных программ). Ведущий разработчик uBlock форкнул проект и создал uBlock Origin. По состоянию на июль 2015 года бо́льшая часть разработки ведётся в uBlock Origin, и кодовые базы существенно расходятся.\n\n- Adblock Plus — Было популярным расширением для блокировки рекламы. Сейчас, когда оно специально не блокирует некоторые объявления [1], возможно, лучше использовать другой блокировщик, например uBlock Origin.\n\n"
    },
    {
      "title": "Расширенный контроль",
      "level": 3,
      "content": "- uMatrix — Форк HTTP Switchboard. Позволяет выборочно блокировать Javascript, плагины или другие ресурсы и контролировать сторонние ресурсы. Он также обладает широкими возможностями обеспечения конфиденциальности, такими как маскировка user-agent, блокировка ссылок и так далее. Он фактически заменяет NoScript и RequestPolicy. О различных способах его использования читайте в old HTTP Switchboard wiki.\n\n- ScriptSafe — Предоставляет пользователям контроль и более безопасный просмотр сайтов, подчёркивая при этом простоту и интуитивность. В связи с характером этого расширения оно будет ломать большинство сайтов! Оно разработано для того, чтобы со временем обучаться на сайтах, которые вы разрешаете.\n\n- NoScript — Отключает JavaScript и Flash на любом сайте, не внесённом пользователем в белый список. Это расширение защитит вас от эксплуатации уязвимостей, не позволяя ни одному сайту, кроме доверенных (например, вашего банка или веб-почты), выполнять свой код. После установки вы можете изменить параметры NoScript, щёлкнув его значок на панели инструментов или щёлкнув правой кнопкой мыши на странице и перейдя к NoScript. После этого у вас будет возможность включить/выключить скрипты для текущей страницы, а также для любых сторонних скриптов, на которые ссылается страница. Кроме того, вы можете временно включить скрипты только для текущего сеанса. Помните, что многие современные сайты используют скрипты для вёрстки, поэтому содержимое может выглядеть иначе. Например, проблемы с рендерингом из-за отсутствия шрифтов может произойти на сайтах, которые подгружают шрифты на лету с помощью скриптов, которые заблокировал NoScript. Важно: По умолчанию NoScript разрешает JavaScript-код некоторых корпораций, что может вам не понравиться. Это влияет на вашу конфиденциальность. Чтобы изменить это, перейдите в Настройки > Разрешения для сайтов и установите значение НЕДОВЕРЕННЫЕ для всех сайтов, которым вы не доверяете. В Tor Browser при использовании в более безопасных режимах (где используется NoScript) это уже сделано изначально.\n\nNote: **Это влияет на вашу конфиденциальность** \n\n- ScriptBlock — Аналогичен NoScript, который является расширением Firefox. Оба расширения блокируют выполнение веб-сайтом любого вида JavaScript. Однако ScriptBlock имеет более простой дизайн и его легче использовать. Он блокирует JavaScript по умолчанию. Вы можете временно или навсегда разрешить JavaScript. Как только вы разрешаете их запуск, он разрешает выполнение всех JavaScript на этой странице, поэтому, возможно, стоит использовать ScriptBlock в сочетании с Privacy Badger. Также стоит проверить его белый список по умолчанию, который вы, возможно, захотите изменить.\n\n- Cookie AutoDelete — Удаляет файлы cookie сразу после закрытия вкладки. Поддерживает автоматический и ручной режимы очистки кук. (Поддержка очистки LocalStorage была добавлена в версии 2.1, но только для Firefox версий 58+. В этом же выпуске добавлена поддержка first party isolation, но только для Firefox версий 59+).\n\n- Vanilla Cookie Manager — Менеджер белых списков файлов cookie, который автоматически удаляет нежелательные файлы cookie. Куки могут использоваться для аутентификации, хранения предпочтений сайта или чего-либо ещё, что можно сохранить в виде текстовых данных. К сожалению, они также могут использоваться для слежки за вами. Вы можете полностью отключить все куки или отключить только сторонние куки. Но это также приведёт к отключению полезных кук, на которые полагаются многие веб-приложения (например, Google Mail или Calendar). В Vanilla вы можете выбрать, какие файлы cookie вы хотите сохранить в белом списке. Все нежелательные файлы cookie удаляются автоматически (или вручную, по вашему желанию).\n\n"
    },
    {
      "title": "Автоматические блокировщики трекеров",
      "level": 3,
      "content": "- Privacy Badger — Отслеживает сторонние трекеры. Он блокирует трекеры, как только они появляются на различных сайтах. Он не задумывался для блокировки рекламы, но, поскольку реклама полагается на отслеживание, на неё это тоже влияет. Для получения дополнительной информации о механизме смотрите FAQ[устаревшая ссылка 2024-12-14 ⓘ].\n\n- Disconnect — Стремится помешать 2000 сторонним сайтам отслеживать пользователя. Он шифрует данные, отправляемые на популярные сайты, и утверждает, что веб-страницы загружаются на 27 процентов быстрее. Disconnect показывает своим пользователям в режиме реального времени, сколько попыток слежения со стороны Google, Twitter, Facebook и других сайтов было остановлено. Он разделяет попытки отслеживания на рекламные, аналитические, социальные и контентные, что позволяет легко отслеживать, как за человеком следят. Disconnect также может остановить side-jacking, который использует украденные куки для кражи персональных данных. Он прост в использовании и хорошо поддерживается. Firefox получил функцию, основанную на списке Disconnect; смотрите Firefox/Privacy#Tracking protection.\n\n"
    },
    {
      "title": "Генераторы шума",
      "level": 3,
      "content": "- AdNauseam — Лёгкое расширение для браузера, сочетающее в себе программный инструмент и художественное вмешательство для борьбы с отслеживанием рекламными сетями. AdNauseam работает как блокировщик рекламы (построен на базе uBlock-Origin), по-тихому имитируя клики по каждой заблокированной рекламе, сбивая с толку трекеры в отношении реальных интересов пользователя.\n\n- TrackMeNot — Периодически отправляет случайные поисковые запросы популярным поисковым системам, что помогает спрятать ваши настоящие запросы в облаке «призрачных» запросов.\n\n"
    },
    {
      "title": "Разное",
      "level": 3,
      "content": "- HTTPS Everywhere — Заставляет устанавливать соединение по HTTPS вместо HTTP везде, где это возможно. HTTPS Everywhere будет автоматически настроен и включен после перезапуска Firefox. Информацию о том, как настроить собственные правила для различных веб-сайтов, можно найти на официальном сайте. HTTPS Everywhere не добавляет поддержку HTTPS магическим образом для каждого сайта в Интернете. Сайт должен поддерживать HTTPS, а HTTPS Everywhere должен иметь набор правил, настроенный для этого сайта.\n\n- Decentraleyes — Защищает вас от слежки через «бесплатные» CDN. Он предотвращает попадание большого количества запросов в такие сети, как Google Hosted Libraries, и вместо них отдаёт локальные файлы, чтобы сайты не ломались. Дополняет обычные блокировщики контента.\n\n- LocalCDN — Форк Decentraleyes с поддержкой большего количества библиотек и функций\n\n- CanvasBlocker — Блокирует или подделывает JS-API для работы с <canvas>, чтобы предотвратить Canvas-Fingerprinting. Firefox имеет встроенную функцию защиты от фингерпринтинга, которую можно включить, установив privacy.resistFingerprinting в true в about:config.\n\n- Privacy Settings — Предоставляет панель инструментов для лёгкого изменения встроенных настроек конфиденциальности браузера.\n\n"
    },
    {
      "title": "Кастомизация сайтов",
      "level": 2,
      "content": "Внешний вид и содержимое веб-сайтов можно модифицировать с помощью пользовательских стилей и пользовательских скриптов.\n\n- Stylus — Менеджер пользовательских таблиц стилей, форк Stylish.\n\n- Violentmonkey — Свободный менеджер пользовательских скриптов.\n\n- Tampermonkey — Проприетарный менеджер пользовательских скриптов.\n\n- Dark Reader — Инвертирует яркость веб-страниц для снижения усталости глаз при просмотре веб-страниц.\n\n- Toggle Website Colors — Заменяет цвета на выбранные пользователем.\n\n"
    },
    {
      "title": "Сочетания клавиш",
      "level": 2,
      "content": "Расширения, предоставляющие сочетания клавиш в стиле vi.\n\n- Vimium — Позволяет просматривать веб-страницы без использования мыши, имеет экспериментальную версию для Firefox.\n\n- Vim-Vixen — Vim-подобная работа в Firefox.\n\n- Saka Key — Позволяет просматривать веб-страницы без использования мыши, ориентируется на доступность.\n\n- Krabby — Позволяет просматривать веб-страницы без использования мыши, вдохновлён Kakoune.\n\n- Tridactyl — Заменяет механизм управления Firefox на механизм, созданный по образцу Vim.\n\n- wasavi — Может преобразовывать текстовые области в редакторы Vi.\n\n"
    },
    {
      "title": "Редактирование текста с помощью внешнего текстового редактора",
      "level": 2,
      "content": "Расширения для редактирования <textarea> в системных текстовых редакторах:\n\n- Textern — Расширение для редактирования текста в вашем любимом внешнем редакторе, требует Python скрипт, доступен как firefox-extension-textern-native-gitAUR.\n\n- withExEditor — Просмотр исходного текста, выделение и редактирование текста с помощью внешнего редактора, требует Node.js.\n\n- GhostText — Использование внешнего текстового редактора для написания текста в браузере. Всё, что вы набираете в редакторе, будет мгновенно обновляться в браузере (и наоборот). Имеет плагины для Vim, Emacs, Neovim и Visual Studio Code.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Список расширений Firefox, отсортированный по числу пользователей\n- Список расширений Firefox на Википедии\n\n"
    }
  ]
}