{
  "title": "Репозиторій Користувачів Arch",
  "url": "https://wiki.archlinux.org/title/%D0%A0%D0%B5%D0%BF%D0%BE%D0%B7%D0%B8%D1%82%D0%BE%D1%80%D1%96%D0%B9_%D0%9A%D0%BE%D1%80%D0%B8%D1%81%D1%82%D1%83%D0%B2%D0%B0%D1%87%D1%96%D0%B2_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nРепозиторій Користувачів Arch (AUR) — репозиторій, що керується спільнотою для користувачів Arch. Він містить опис пакетів (PKGBUILD), які дозволяють компілювати пакет з вихідного джерела з makepkg, а потім встановлювати його через пакетний менеджер Pacman. AUR був створений для організації та обміну новими пакетами спільноти та допомоги прискоренню включення популярних пакетів до репозиторію спільноти. Цей документ пояснює, як користувачі можуть отримати доступ і використовувати AUR.\n\nЗначна кількість нових пакетів, які входять до офіційних репозитаріїв, починаються в AUR. Користувачі можуть вносити свої власні скрипти побудови пакетів (PKGBUILD та пов'язаних файлів) в AUR. Спільнота AUR має можливість голосувати за пакети в AUR. Якщо пакет стає досить популярним, і якщо він має сумісну ліцензію та хорошу техніку упаковки, він може бути внесений до сховища спільноти (стаючи прямо доступним через Pacman або Arch build system (ABS)).\n\n"
    },
    {
      "title": "Початок роботи",
      "level": 2,
      "content": "Користувачі можуть шукати і завантажувати PKGBUILD з веб-сторінки AUR. Такі (PKGBUILDs) скрипти можуть бути вбудовані в установчі пакети з використанням makepkg, а потім встановлений в систему за допомогою Pacman.\n\n- Переконайтеся, що встановлено базові інструменти побудови пакетів (base-devel).\n- Перегляньте розділ #F.A.Q. Часті запитання для отримання відповідей на найпоширеніші питання.\n- Можливо, ви захочете налаштувати /etc/makepkg.conf щоб оптимізувати процес побудови на вашій системі перед створенням пакетів з AUR. Значне поліпшення часу збірки пакетів може бути реалізовано на системах з багатоядерними процесорами, налаштувавши змінну MAKEFLAGS, використовуючи кілька ядер для стискання, або за допомогою різних алгоритму стискання. Користувачі також можуть увімкнути оптимізацію компілятора, специфічних для апаратних засобів, через змінну СFLAGS. Дивіться makepkg#Tips and tricks для отримання додаткової інформації.\n\nТакож можна взаємодіяти з AUR через SSH: введіть команду ssh aur@aur.archlinux.org help щоб отримати список доступних команд.\n\n"
    },
    {
      "title": "Встановлення та оновлення пакетів",
      "level": 2,
      "content": "Встановлення пакетів з AUR є відносно простим процесом. По суті:\n\n1. Просто, отримайте файли збірки, включаючи PKGBUILD та, можливо, інші необхідні файли, як-от модулі systemd і \"заплатки\" (часто це не є фактичний код).\n1. Переконайтеся, що файли PKGBUILD та супровідні файли не є шкідливими чи ненадійними. Це важливо.\n1. Запустіть makepkg у каталозі, де збережено файли. Це завантажить код, скомпілює його та запакує.\n1. Запустіть pacman -U package_file, щоб інсталювати зібраний пакет, у вашій системі.\n\n"
    },
    {
      "title": "Передумови",
      "level": 3,
      "content": "По-перше, переконайтеся, що необхідні інструменти встановлено , встановивши base-devel; Цей мета-пакет містить інструмент make та інші інструменти, що зазначені, як залежності і необхідні для компіляції з вихідного коду.\n\nДалі виберіть відповідний каталог збірки. Каталог збірки — це просто каталог, у якому пакунок буде створено або «збірно» з джерела, і може бути будь-яким каталогом. Далі в цьому розділі буде використовуватись як як приклад, каталог збірки - ~/builds.\n\n"
    },
    {
      "title": "Отримати файли збірки",
      "level": 3,
      "content": "Знайдіть пакет у AUR. Це робиться за допомогою поля пошуку у верхній частині домашньої сторінки AUR. Якщо клацнути назву програми в списку пошуку, відкриється сторінка з інформацією про пакет. Прочитайте опис, щоб переконатися, що це потрібний пакет, зверніть увагу на час останнього оновлення пакета та прочитайте коментарі.\n\nІснує кілька методів отримання файлів збірки для пакету:\n\n- Склонувати git-репозиторій із позначкою «URL-адреса клонування з Git» у описі пакету на сторінці AUR. Це найкращий метод, перевага якого полягає в тому, що ви можете легко отримати оновлення пакета через git pull.\n\n```\n$ git clone https://aur.archlinux.org/назва_пакета.git\n```\n\n- Завантажити \"знімок\", натиснувши посилання «Завантажити знімок» у розділі «Дії пакета» праворуч на сторінці AUR або в терміналі:\n\n```\n$ curl -L -O https://aur.archlinux.org/cgit/aur.git/snapshot/назва_пакета.tar.gz\n```\n\n- Використати незмінне дзеркало archlinux/aur на GitHub, де кожен пакет знаходиться у гілці. Рекомендується клонувати лише одну гілку (все сховище занадто велике, і продуктивність буде низькою). Це можна зробити одним із двох способів: Використавши команду git clone --single-branch: $ git clone --branch назва_гілки/назва_пакета --single-branch https://github.com/archlinux/aur Або, зробивши часткове клонування цього сховища (git clone --depth=1) із вибірковим додаванням гілок: : $ git clone --depth=1 https://github.com/archlinux/aur; cd aur$ git remote set-branches --add origin назва_пакета$ git fetch$ git checkout назва_пакета\n\n- Використавши команду git clone --single-branch: $ git clone --branch назва_гілки/назва_пакета --single-branch https://github.com/archlinux/aur\n- Або, зробивши часткове клонування цього сховища (git clone --depth=1) із вибірковим додаванням гілок: : $ git clone --depth=1 https://github.com/archlinux/aur; cd aur$ git remote set-branches --add origin назва_пакета$ git fetch$ git checkout назва_пакета\n\n```\n$ git clone --branch назва_гілки/назва_пакета --single-branch https://github.com/archlinux/aur\n```\n\n```\n$ git clone --depth=1 https://github.com/archlinux/aur; cd aur$ git remote set-branches --add origin назва_пакета$ git fetch$ git checkout назва_пакета\n```\n\n"
    },
    {
      "title": "За потреби отримайте відкритий ключ PGP",
      "level": 3,
      "content": "Перевірте, чи є файл підпису у форматі .sig або .asc частиною вихідного масиву PKGBUILD. Якщо це так, отримайте один із відкритих ключів, указаних у масиві validpgpkeys. Для отримання додаткової інформації зверніться до makepkg#Signature checking.\n\n"
    },
    {
      "title": "Створіть пакет",
      "level": 3,
      "content": "Перейдій у каталог, що містить PKGBUILD.\n\n```\n$ cd назва_пакета\n```\n\nПерегляньте вміст усіх наданих файлів. Наприклад, щоб переглядати \"по-сторінково\" PKGBUILD, виконайте:\n\n```\n$ less PKGBUILD\n```\n\n- Щоб переглянути зміни з моменту останнього коміту git, ви можете використовувати git show.\n- Щоб переглянути зміни з часу останнього коміту за допомогою vimdiff , виконайте git difftool @~..@ vimdiff. Перевагою vimdiff є те, що ви переглядаєте весь вміст кожного файлу разом із індикаторами змін..\n\nЗберіть пакет. Після ручного підтвердження вмісту файлів запустіть makepkg як звичайний користувач.\n\nДеякі корисні позначки:\n\n- -s/--syncdeps автоматично вирішує та встановлює будь-які залежності за допомогою pacman перед збиранням. Якщо пакет залежить від інших пакетів AUR, вам потрібно буде спочатку встановити їх вручну.\n- -i/--install встановлює пакет, якщо він успішно зібраний. Це дозволяє пропустити наступний крок, який зазвичай виконується вручну.\n- -r/--rmdeps видаляє залежності потрібні під час збирання після завершення, оскільки вони більше не потрібні. Однак під час наступного оновлення пакета може знадобитися перевстановити ці залежності.\n- -c/--clean очищає тимчасові файли збірки після збирання, оскільки вони більше не потрібні. Ці файли зазвичай потрібні лише під час налагодження процесу збірки.\n\n"
    },
    {
      "title": "Встановлення пакета",
      "level": 3,
      "content": "Тепер пакунок можна встановити за допомогою pacman:\n\n```\n# pacman -U назва_пакета-версія-архітектура.pkg.tar.zst\n```\n\nNote: **Наполегливо** \n\n- Якщо ви змінили PKGEXT в makepkg.conf, назва файла пакета може дещо відрізнятися.\n- Наведений вище приклад є лише коротким описом процесу збирання. Наполегливо рекомендуємо прочитати статті про makepkg та Arch build system для отримання детальної інформації\n\n"
    },
    {
      "title": "Перехід на нову версію пакетів",
      "level": 3,
      "content": "У каталозі, що містить PKGBUILD пакету, необхідно спочатку оновити файли і зміни за допомогою команди\n\n```\n$ git pull\n```\n\nпісля чого слідувати попереднім інструкціям зі збирання та встановлення.\n\n"
    },
    {
      "title": "Оновлення пакетів",
      "level": 3,
      "content": "AUR не підтримується, тому оновлення пакетів, які ви встановлюєте є вашим обов'язком а не pacman. Якщо пакунки з офіційних сховищ буде оновлено, вам потрібно буде перезбирати всі пакунки AUR, які залежать від цих бібліотек.\n\n"
    },
    {
      "title": "Статус облікового запису",
      "level": 2,
      "content": "Інформація щодо статусу (поточного стану) облікового запису користувача, що є супровідником пакету.\n\n"
    },
    {
      "title": "Призупинення",
      "level": 3,
      "content": "При редагуванні користувача як довіреного Користувача можна встановити поле Призупинено, що призупиняє зазначеного користувача.Коли користувач призупинений, він не може:\n\n- Увійти на https://aur.archlinux.org\n- Отримувати сповіщення\n- Взаємодіяти з інтерфейсом git\n\n"
    },
    {
      "title": "Неактивність",
      "level": 3,
      "content": "При редагуванні власного облікового запису або іншого, як довіреного користувача, неактивне поле може бути встановлено. Неактивні обліковки використовуються з двох причин:\n\n- Відобразити дату, яку хтось відмітив як початок неактивності на сторінці свого облікового запису.\n- Згенерувати поточну кількість активних (TU) Довірених користувачів на основі їх бездіяльності щодо нових пропозицій.\n\n"
    },
    {
      "title": "Коментування пакетів",
      "level": 3,
      "content": "У веб-інтерфейсі AUR є можливість коментування, яка дозволяє користувачам надавати пропозиції та відгуки щодо покращень дописувачу PKGBUILD.\n\n.\n\nPython-Markdown надає базовий синтаксис Markdown для форматування коментарів.\n\n- Ця реалізація має деякі розбіжності з офіційними правилами синтаксису.\n- Хеші коммітів до сховища Git пакунка та посилання на квитки Flyspray автоматично перетворюються на посилання.\n- Довгі коментарі згортаються і за потреби можуть бути розгорнуті.\n\n"
    },
    {
      "title": "Голосування за пакети",
      "level": 3,
      "content": "Однією з найпростіших дій для всіх користувачів Arch є перегляд AUR і голосування за улюблені пакунки за допомогою онлайн-інтерфейсу. Усі пакунки можуть бути прийняті TU (Trusted Users - Довірені Користувачі) для включення до extra, а підрахунок голосів є одним з аспектів цього процесу; голосування в інтересах кожного!\n\nЗареєструйтеся на веб-сайті AUR, щоб отримати опцію \"Проголосувати за цей пакет\" під час перегляду пакетів. Після реєстрації ви також зможете голосувати з командного рядка за допомогою aurvoteAUR[пакет відсутній: package not found], aurvote-gitAUR[пакет відсутній: package not found] або aur-auto-vote-gitAUR.\n\nКрім того, якщо ви налаштували автентифікація ssh, ви можете голосувати безпосередньо з командного рядка за допомогою вашого ключа ssh. Це означає, що вам не потрібно буде зберігати або вводити пароль AUR.\n\n```\n$ ssh aur@aur.archlinux.org vote назва_пакунка\n```\n\n"
    },
    {
      "title": "Позначення пакунків як застарілих",
      "level": 3,
      "content": "Перш за все, вам слід позначити пакунок як \"застарілий\", вказавши деталі, чому він є застарілим, бажано включно з посиланнями на оголошення про випуск або архів нового випуску.\n\nВам також слід спробувати зв'язатися з супровідником безпосередньо електронною поштою. Якщо протягом двох тижнів від супровідника немає відповіді, ви можете подати осиротілий запит. Дивіться Настанови щодо подання запитів до AUR#Запити для отримання детальної інформації.\n\n"
    },
    {
      "title": "Налагодження процесу збирання пакунків",
      "level": 2,
      "content": "1. Переконайтеся, що ваше середовище збірки оновлене за допомогою оновлення[broken link: invalid section] перед тим, як щось збирати.\n1. Переконайтеся, що у вас встановлено base-devel.\n1. Використовуйте опцію -s з makepkg для перевірки та встановлення усіх необхідних залежностей перед початком процесу збирання.\n1. Спробуйте типовий варіант конфігурації makepkg.\n1. Див. розділ Makepkg#Виправлення неполадок[broken link: invalid section] щодо типових проблем.\n\nЯкщо у вас виникли проблеми зі збиранням пакунка, спершу прочитайте його PKGBUILD та коментарі на його сторінці AUR.\n\nМожливо, PKGBUILD не працює для всіх. Якщо ви не можете з'ясувати це самостійно, повідомте про це супроводжувачу (наприклад, опублікувавши помилки, які ви отримуєте, у коментарях на сторінці AUR[broken link: invalid section]). Ви також можете звернутися за допомогою до Форуму проблем, обговорень та запитів AUR та PKGBUILD.\n\nПричина може бути нетривіальною. Нестандартні CFLAGS, LDFLAGS і MAKEFLAGS можуть спричинити збої. Щоб уникнути проблем, спричинених особливостями конфігурації вашої системи, збирайте пакунки у чистому chroot. Якщо процес збирання у чистому chroot все одно завершується невдало, ймовірно, проблема у PKGBUILD.\n\nПро використання namcap див. розділ Створення пакунків#Перевірка нормальності пакунків. Якщо ви бажаєте, щоб PKGBUILD було перевірено, опублікуйте його у aur-general mailing list, щоб отримати відгук від TU та інших членів AUR, або на форумі Створення та модифікація пакунків. Ви також можете звернутися за допомогою на IRC-канал #archlinux-aur у мережі Libera Chat.\n\n"
    },
    {
      "title": "Надсилання пакунків",
      "level": 2,
      "content": "Користувачі можуть ділитися PKGBUILDами за допомогою AUR. Дивіться Настанови щодо надсилання до AUR для отримання детальної інформації.\n\n"
    },
    {
      "title": "Переклад веб-інтерфейсу",
      "level": 2,
      "content": "Дивіться i18n.txt у дереві джерел AUR для отримання інформації про створення та підтримку перекладу веб-інтерфейсу AUR.\n\n"
    },
    {
      "title": "Історія",
      "level": 2,
      "content": "На початку, був лише ресурс ftp://ftp.archlinux.org/incoming, і люди, які зробили внесок, просто завантажували скрипт побудови PKGBUILD, необхідних додаткові файли і сам пакет, який буде побудовано на сервер. Пакет та пов'язані файли залишалися там, поки Супроводжувач пакетів не побачить програму і не прийме її.\n\nПізніше народилися довірені репозиторії користувачів. Деяким особам у суспільстві дозволялося розміщувати свої власні сховища для використання будь-ким. На основі цього, AUR і розширився, з метою зробити його більш гнучким і більш корисним. Насправді, супровідники АУР все ще називають TU (Trusted Users - довірені користувачі).\n\nУ період з 2015-06-08 по 2015-08-08, АУР перетворився з версії 3.5.1 до 4.0.0, впровадивши використання репозиторіїв Git для публікації PKGBUILD. Існуючі пакети були відкинуті, якщо не мігрували вручну до нової інфраструктури їх супровідниками.\n\n"
    },
    {
      "title": "Репозиторії Git для пакетів AUR3",
      "level": 3,
      "content": "Архів AUR на GitHub має сховище для кожного пакету, який був у AUR-3 під час міграції. Крім того, існує aur3-mirror репозиторій, який забезпечує те ж саме.\n\n"
    },
    {
      "title": "Які пакунки дозволено розміщувати на AUR?",
      "level": 3,
      "content": "Пакунки на AUR - це просто \"скрипти збірки\", тобто рецепти збірки двійкових файлів для pacman. У більшості випадків дозволено все, за умови дотримання Настанови щодо подання пакунків на AUR#Настанови щодо подання пакунків#Настанови щодо корисності та обсягу, якщо ви дотримуєтесь умов ліцензування контенту. В інших випадках, коли зазначено, що \"ви не можете посилатися\" на завантаження, тобто на вміст, який не підлягає розповсюдженню, ви можете використовувати лише саму назву файлу як джерело. Це означає і вимагає, щоб користувачі вже мали джерело з обмеженим доступом у каталозі збірки до початку збирання пакунка. Якщо у вас є сумніви, запитайте.\n\n"
    },
    {
      "title": "Як я можу проголосувати за пакунки на AUR?",
      "level": 3,
      "content": "Див. розділ #Голосування за пакунки[broken link: invalid section].\n\n"
    },
    {
      "title": "Що таке довірений користувач / TU?",
      "level": 3,
      "content": "Довірений користувач, скорочено TU, - це людина, яку обрано для нагляду за AUR та додатковим сховищем. Саме вони підтримують популярні PKGBUILDи у \"додатковому\", і загалом підтримують роботу AUR.\n\n"
    },
    {
      "title": "Яка різниця між репозиторіями AUR та extra?",
      "level": 3,
      "content": "AUR є місцем зберігання усіх PKGBUILDів, які надсилають користувачі, і його слід збирати вручну за допомогою makepkg. Коли PKGBUILD отримує достатній інтерес спільноти та підтримку TU, його переміщують до extra (підтримується TU), де бінарні пакунки можна встановити за допомогою pacman.\n\n"
    },
    {
      "title": "Foo у AUR застарілий; що мені робити?",
      "level": 3,
      "content": "Див. розділ #Позначення пакунків як застарілих.\n\nТим часом, ви можете спробувати оновити пакунок самостійно, відредагувавши PKGBUILD локально. Іноді оновлення не потребують змін у процесі збирання або пакування, у цьому випадку достатньо просто оновити масив pkgver або source.\n\n"
    },
    {
      "title": "Foo у AUR не компілюється під час запуску makepkg; що мені робити?",
      "level": 3,
      "content": "Ймовірно, ви пропустили щось тривіальне; див. #Налагодження процесу збирання пакунків.\n\n"
    },
    {
      "title": "ERROR: One or more PGP signatures could not be verified!; що робити?",
      "level": 3,
      "content": "Найімовірніше, у вашій особистій зв'язці ключів немає необхідного відкритого ключа (ключів) для перевірки завантажених файлів. Дивіться Makepkg#Перевірка підписів[broken link: invalid section] для більш детальної інформації.\n\n"
    },
    {
      "title": "Як створити PKGBUILD?",
      "level": 3,
      "content": "Ознайомтеся з Настановами щодо подання до AUR#Правила подання, а потім дивіться створення пакунків.\n\n"
    },
    {
      "title": "У мене є PKGBUILD, який я хочу подати; чи може хтось перевірити його на наявність помилок?",
      "level": 3,
      "content": "Існує декілька каналів для надсилання вашого пакунка на перевірку; див. Налагодження процесу збирання пакунків.\n\n"
    },
    {
      "title": "Як перенести PKGBUILD до репозиторію extra?",
      "level": 3,
      "content": "Зазвичай, для переміщення чогось до extra потрібно щонайменше 10 голосів. Однак, якщо TU хоче підтримати пакунок, його часто можна знайти у репозиторії.\n\nДосягнення необхідного мінімуму голосів - не єдина вимога; має бути TU, який бажає підтримувати пакунок. TU не зобов'язані переміщувати пакунок до extra, навіть якщо він має тисячі голосів.\n\nЗазвичай, коли дуже популярний пакунок залишається у AUR, це відбувається тому, що:\n\n- Arch Linux вже має іншу версію пакунка у сховищах\n- Його ліцензія забороняє розповсюдження\n- Це допомагає отримати надіслані користувачами PKGBUILDи. Помічники AUR є непідтримуваними за визначенням.\n\nДивіться також Правила для пакунків, що вносяться до extra.\n\n"
    },
    {
      "title": "Як прискорити повторювані процеси збирання?",
      "level": 3,
      "content": "Дивіться Makepkg#Покращення часу компіляції[broken link: invalid section].\n\n"
    },
    {
      "title": "Яка різниця між пакунками foo та foo-git?",
      "level": 3,
      "content": "Багато пакунків AUR постачаються у \"стабільних\" версіях випуску та \"нестабільних\" версіях для розробки. Пакунки для розробки зазвичай мають суфікс, що позначає їхню Систему керування версіями і не призначені для регулярного використання, але можуть пропонувати нові можливості або виправлення помилок. Оскільки ці пакунки завантажують лише найновіші доступні джерела під час виконання makepkg, їхній pkgver() у AUR не відображає попередніх змін. Так само ці пакунки не можуть виконувати перевірку контрольної суми автентичності для будь-якого Джерела VCS.\n\nДивіться також Обслуговування системи#Використання перевірених програмних пакетів.\n\n"
    },
    {
      "title": "Чому foo зник з AUR?",
      "level": 3,
      "content": "Можливо, пакунок було прийнято у ТУ і зараз він знаходиться у додатковому сховищі.\n\nПакунки можуть бути видалені, якщо вони не відповідають правилам подання. Причини видалення див. в архіві aur-запитів.\n\n"
    },
    {
      "title": "Як дізнатися, чи не зникли з AUR встановлені мною пакунки?",
      "level": 3,
      "content": "Найпростіший спосіб - перевірити HTTP-статус сторінки AUR пакунка:\n\n```\n$ comm -23 <(pacman -Qqm | sort) <(curl https://aur.archlinux.org/packages.gz | gzip -cd | sort)\n```\n\n"
    },
    {
      "title": "Як отримати список усіх пакунків AUR?",
      "level": 3,
      "content": "- https://aur.archlinux.org/packages.gz\n- Використовуйте aurpkglist з python3-aurAUR\n\n"
    },
    {
      "title": "Дивіться також",
      "level": 2,
      "content": "- Веб-інтерфейс АУР\n- Список розсилки AUR\n\n"
    }
  ]
}