{
  "title": "Руководство по ArchWiki",
  "url": "https://wiki.archlinux.org/title/%D0%A0%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE_%D0%BF%D0%BE_ArchWiki",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- ArchWiki:О проекте\n- Help:Шпаргалка\n- Help:Стиль\n- Help:Чтение\n- Help:Шаблон\n- Help:Обсуждение\n- Песочница\n- ArchWiki:Bots\n\nArchWiki использует MediaWiki — пакет свободного программного обеспечения, написанный на PHP и изначально разработанный для Википедии. Подробную информацию о MediaWiki вы найдёте на страницах Справка:Содержание в MediaWiki и Википедия:Справка.\n\nПеред вами краткое руководство по редактированию ArchWiki. Прежде чем редактировать или создавать страницы, познакомитесь с общими характером, разметкой и стилем существующих статей. Необходимо стремиться поддерживать качество и единый стиль вики-статей. Общие правила перечислены в статьях ArchWiki:Внесение вклада, Help:Стиль и Help:Чтение. Для экспериментов можно использовать песочницу. Краткую информацию о вики-разметке вы найдёте на странице Help:Шпаргалка.\n\n"
    },
    {
      "title": "Создание аккаунта",
      "level": 2,
      "content": "Для внесения правок на страницы ArchWiki необходимо создать аккаунт; чтобы ответить на вопрос-капчу, потребуется обновлённое до последней версии окружение Arch Linux. Пользователи других дистрибутивов также могут править ArchWiki, для ответа на капчу они могут, например, загрузить live-окружение Arch c помощью последней версии установочного образа.\n\nПосле создания аккаунта выполните вход на странице Special:UserLogin.\n\n"
    },
    {
      "title": "Редактирование",
      "level": 2,
      "content": "Чтобы начать вносить изменения на странице, выберите вкладку \"править\" наверху. Вы можете также редактировать конкретный раздел на странице, нажав на ссылку \"править\" справа от его заголовка. После этого появится страница Редактирование, которая состоит из следующих элементов:\n\n- панель инструментов для редактирования (необязательно);\n- поле редактирования;\n- поле Описание изменений;\n- ссылки Записать страницу, Предварительный просмотр, Внесенные изменения и Отменить.\n\nПоле редактирования будет содержать викитекст текущей версии статьи или раздела — редактируемый исходный код, из которого сервер создает web-страницу. Чтобы выполнить редактирование:\n\n1. Измените викитекст как вам нужно (подробнее в разделе #Форматирование).\n1. Кратко объясните ваши изменения в поле Описание изменений (например, \"исправлена опечатка\" или \"добавлена информация о xyz\").Примечание: Все правки должны сопровождаться описанием изменений. Описание позволяет администраторам и другим мейнтейнерам легко определять спорные правки и вандализм. Подробнее см. ArchWiki:Внесение вклада#Три основных правила.\n1. Старайтесь всегда использовать кнопку Предварительный просмотр, чтобы проверить форматирование перед сохранением.\n1. Если правка не вносит смысловые изменения в содержимое (например, вы исправили только форматирование), отметьте ее как незначительную, установив флажок Малое изменение.\n1. Сохраните изменения, нажав на кнопку Записать страницу. Если вы передумали вносить изменения, нажмите Отменить.\n\nNote: **не должны** \n\n"
    },
    {
      "title": "Отмена правок",
      "level": 3,
      "content": "Изменения должны улучшать содержимое страницы. Если какая-то правка наоборот, ухудшает содержимое или просто сделана по ошибке, следующие шаги помогут вам правильно ее отменить:\n\n1. Выберите вкладку история наверху страницы (рядом с вкладкой править). Вы увидите список изменений на странице.\n1. Найдите неверную правку и кликните по ссылке отменить напротив нее. Вы увидите предварительный просмотр, показывающий текущую версию (слева) и текст для сохранения (справа).\n1. В поле описания изменений укажите причину, почему вы отменяете правку.\n1. Если все правильно, нажмите на кнопку Записать страницу внизу страницы.\n\nПосле этого страница будет возвращена в изначальное состояние.\n\nИногда необходимо отменить сразу несколько последних правок за раз. Для этого:\n\n1. Выберите вкладку история наверху страницы (рядом с вкладкой править). Вы увидите список изменений на странице.\n1. Найдите версию, до которой вы хотите отменить все изменения (то есть, последнюю хорошую версию). Нажмите на соответствующую ей временную метку. Вы увидите выбранную версию страницы.\n1. Если все правильно, нажмите на вкладку править вверху страницы. Вы увидите предупреждение: Вы редактируете устаревшую версию данной страницы.\n1. В поле описания изменений скопируйте временную метку версии (отображается наверху) и укажите причину, почему вы отменяете последние правки.\n1. Теперь просто нажмите на кнопку Записать страницу, чтобы откатить все изменения до выбранной версии.\n\nПосле отмены правок будет создана новая правка, которую вы сможете увидеть в истории изменений страницы.\n\n"
    },
    {
      "title": "Создание страниц",
      "level": 2,
      "content": "Прежде чем создавать новую страницу, пожалуйста, ответьте на следующие вопросы:\n\n- Относится ли ваша тема к Arch Linux? Ненужные и бесполезные статьи будут удаляться.\n- Будет ли ваша тема интересна другим? Учитывайте не только то, о чем вы желаете написать, но и то, что другие хотели бы прочитать. Личные заметки должны находиться на вашей странице пользователя (либо на ее подстранице).\n- Достойна ли ваша тема новой страницы? Поищите похожие статьи. Если такая статья есть, подумайте о ее улучшении.\n- Будет ли ваш вклад существенным? Избегайте создания страниц-заглушек, если не планируете расширять их вскоре после этого.\n\nСоздавая новую страницу, выберите подходящий заголовок и соответствующую категорию.\n\nСтраницы Help:Указания по выбору имен статей и Help:Стиль#Заголовок помогут вам выбрать хороший заголовок. Не включайте \"Arch Linux\" или его разновидности в заголовки страниц. Это — ArchWiki, соответственно предполагается, что статьи здесь так или иначе относятся к Arch Linux (например, Установка Openbox, а не Установка Openbox в Arch Linux).\n\nПосетите Оглавление, которое поможет вам выбрать подходящую категорию. Статья может принадлежать сразу нескольким категориям.\n\nЧтобы добавить новую страницу к какой-либо категории (скажем, \"Моя новая страница\" в \"Некоторая категория\"), вам необходимо:\n\n1. Создать страницу с вашим новым заголовком, перейдя по ссылке: https://wiki.archlinux.org/title/My_new_page (само собой, вам необходимо заменить \"My_new_page\" на реальный заголовок).\n1. Добавить [[Category:Какая-либо категория]] на самом верху страницы.\n\nНа этом этапе новая страница всё ещё считвается страницей-сиротой. Чтобы завершить процесс создания, добавьте в другие статьи ссылки на неё. Это повысит её \"видимость\" и, возможно, побудит других пользователей внести свои улучшения. В первую очередь подумайте о страницах связанных с вашей статьё программ, обзорных статьях и различного рода списках вроде Список приложений.\n\nВ некоторых случаях имеет смысл вместо написания отдельной стать создать подстраницу, т.е. \"потомка\" другой страницы: заголовок подстраницы отделяется от основной страницы символом слэша /. Это можно использовать для работы с черновиками статей в пространстве страницы вашего профиля, например https://wiki.archlinux.org/title/User:Myself/My_new_subpage.\n\n"
    },
    {
      "title": "Форматирование",
      "level": 2,
      "content": "Везде, где это возможно, форматирование текста производится при помощи вики-разметки, так что вам не придется изучать HTML. Различные шаблоны также доступны для распространенных задач форматирования: подробнее смотрите на странице Help:Шаблон. Help:Шпаргалка резюмирует наиболее распространенные опции форматирования.\n\n"
    },
    {
      "title": "Заголовки и подзаголовки",
      "level": 3,
      "content": "Заголовки и подзаголовки являются простым способом организовать содержимое статьи. Если вы можете выделить в тексте несколько отдельных тем, разделите их, создав для каждой из них свой раздел. Страницы Help:Стиль#Заголовки разделов и Help:Эффективное использование заголовков помогут вам сделать это правильно и придумать разделам подходящие названия.\n\nВсего предусмотрено 6 уровней разделов, которые позволяют упорядочить текст в иерархическую структуру и оформить для них блок оглавления со ссылками на разделы. Для содержимого статьи вам доступны все заголовки начиная со второго уровня; они создаются следующим образом:\n\n```\n== Заголовок второго уровня ==\n\n=== Заголовок третьего уровня ===\n\n==== Заголовок четвертого уровня ====\n\n===== Заголовок пятого уровня =====\n\n====== Заголовок шестого уровня ======\n```\n\nЕсли в статье имеется хотя бы четыре заголовка, автоматически будет сгенерирован блок оглавления. Если вы этого не желаете, поместите специальное слово __NOTOC__ в начале статьи. Попробуйте создать несколько заголовков на странице Песочница и посмотрите на результат в содержании.\n\n"
    },
    {
      "title": "Переносы строк",
      "level": 3,
      "content": "Пустая строка в коде страницы используется для разделения текста на абзацы. Обратите внимание, что текст на двух соседних строках воспринимается как один абзац.\n\nДля ручной вставки переносов вы можете использовать HTML-тег <br>, однако этого следует избегать везде, где возможно. Его использование необходимо только при совмещении с некоторыми другими элементами разметки, например, списками.\n\nTable content:\nвикитекст | результат\nЭто предложение разделено на три строки. | Это предложение разделено на три строки.\nАбзац номер один. Абзац номер два. | Абзац номер один. Абзац номер два.\n* Так можно оформить пункт списка <br> на нескольких строках * Однако, обычный перенос строки заканчивает список | Так можно оформить пункт списка на нескольких строках Однако, обычный перенос строки заканчивает список\n\n```\nЭто предложение\nразделено на\nтри строки.\n```\n\nЭто предложение разделено на три строки.\n\n```\nАбзац номер один.\n\nАбзац номер два.\n```\n\nАбзац номер один.\n\nАбзац номер два.\n\n```\n* Так можно оформить пункт списка <br> на нескольких строках\n* Однако, обычный перенос строки\nзаканчивает список\n```\n\n- Так можно оформить пункт списка на нескольких строках\n- Однако, обычный перенос строки\n\nзаканчивает список\n\nСмотрите статью Help:Стиль/Пробелы для получения дополнительной информации об использовании пробельных символов в исходном коде страниц.\n\n"
    },
    {
      "title": "Полужирный и курсив",
      "level": 3,
      "content": "Полужирный шрифт, курсив и полужирный курсив добавляются путем заключения слова или фразы в два, три или пять апострофов ('):\n\nTable content:\nвикитекст | результат\n''курсив'' | курсив\n'''полужирный''' | полужирный\n'''''полужирный и курсив''''' | полужирный и курсив\n\n''курсив''\n\nкурсив\n\n'''полужирный'''\n\nполужирный\n\n'''''полужирный и курсив'''''\n\nполужирный и курсив\n\n"
    },
    {
      "title": "Зачеркнутый текст",
      "level": 3,
      "content": "Используйте зачеркнутый текст, чтобы стилистически отобразить, что какое-то утверждение перестало быть истинным или стало бесполезным.\n\nTable content:\nвикитекст | результат\n<s>Зачеркнутый текст</s> | Зачеркнутый текст\n\n```\n<s>Зачеркнутый текст</s>\n```\n\nЗачеркнутый текст\n\n"
    },
    {
      "title": "Списки",
      "level": 3,
      "content": "Помните, что синтаксис wiki не поддерживает многострочные элементы списков: использование \"Enter\" в конце строки означает конец элемента списка. Чтобы начать с новой строки внутри элемента, используйте тег <br>. Чтобы создать многострочный блок с кодом внутри элемента, используйте Template:bc и окружите содержимое тегом <nowiki>...</nowiki>. Смотрите также статьи Help:Стиль/Пробелы и Help:Шаблон.\n\n"
    },
    {
      "title": "Маркированные списки",
      "level": 4,
      "content": "Маркированные списки не указывают наличие строгого порядка следования пунктов. Они используются главным образом для перечисления чего-либо и подходят в большинстве случаев.\n\nЧтобы вставить маркер, используйте звездочку (*). Вы можете создавать вложенные списки, используя несколько звездочек *.\n\nTable content:\nвикитекст | результат\n* Первый пункт * Второй пункт ** Подпункт * Третий пункт | Первый пункт Второй пункт Подпункт Третий пункт\n\n```\n* Первый пункт\n* Второй пункт\n** Подпункт\n* Третий пункт\n```\n\n- Первый пункт\n- Второй пункт Подпункт\n- Третий пункт\n\n- Подпункт\n\n"
    },
    {
      "title": "Нумерованные списки",
      "level": 4,
      "content": "Пунктам нумерованных списков присваиваются номера, таким образом обозначая, что порядок их следования важен.\n\nЧтобы создавать нумерованные списки, используйте знак номера или символ решетки (#). Вы можете создавать вложенные списки, используя несколько таких символов #.\n\nTable content:\nвикитекст | результат\n# Первый пункт # Второй пункт ## Подпункт # Третий пункт | Первый пункт Второй пункт Подпункт Третий пункт\n# Первый пункт # Второй пункт #* Подпункт # Третий пункт | Первый пункт Второй пункт Подпункт Третий пункт\n\n```\n# Первый пункт\n# Второй пункт\n## Подпункт\n# Третий пункт\n```\n\n1. Первый пункт\n1. Второй пункт Подпункт\n1. Третий пункт\n\n1. Подпункт\n\n```\n# Первый пункт\n# Второй пункт\n#* Подпункт\n# Третий пункт\n```\n\n1. Первый пункт\n1. Второй пункт Подпункт\n1. Третий пункт\n\n- Подпункт\n\n"
    },
    {
      "title": "Списки определений",
      "level": 4,
      "content": "Списки определений создаются с помощью точки с запятой (;) и двоеточия (:), следующего за термином.\n\nTable content:\nвикитекст | результат\nСписки определений: ; Клавиатура: устройство ввода с кнопками или клавишами. ; Мышь: указательное устройство для двумерного ввода. или ; Клавиатура : устройство ввода с кнопками или клавишами. ; Мышь : указательное устройство для двумерного ввода. | Списки определений: Клавиатура устройство ввода с кнопками или клавишами. Мышь указательное устройство для двумерного ввода. или Клавиатура устройство ввода с кнопками или клавишами. Мышь указательное устройство для двумерного ввода.\nИспользуйте дополнительные двоеточия, если термин имеет несколько значений: ; Термин : первое значение; : второе значение. | Используйте дополнительные двоеточия, если термин имеет несколько значений: Термин первое значение; второе значение.\n\n```\nСписки определений:\n; Клавиатура: устройство ввода с кнопками или клавишами.\n; Мышь: указательное устройство для двумерного ввода.\nили\n; Клавиатура\n: устройство ввода с кнопками или клавишами.\n; Мышь\n: указательное устройство для двумерного ввода.\n```\n\nСписки определений:\n\nили\n\n```\nИспользуйте дополнительные двоеточия, если термин имеет несколько значений:\n; Термин\n: первое значение;\n: второе значение.\n```\n\nИспользуйте дополнительные двоеточия, если термин имеет несколько значений:\n\nСписки определений не должны использоваться только для форматирования, смотрите Примеры от W3C.\n\n"
    },
    {
      "title": "Отступы",
      "level": 3,
      "content": "Чтобы сделать отступ в тексте, поместите двоеточие (:) в начале строки. Чем больше двоеточий вы поставите, тем дальше текст на этой строке в коде будет сдвинут. Новая строка отмечает окончание сдвинутого абзаца.\n\nTable content:\nвикитекст | результат\nЭтот текст вовсе не сдвинут. :Этот текст немного сдвинут. ::Этот текст чуть более сдвинут. | Этот текст вовсе не сдвинут. Этот текст немного сдвинут. Этот текст чуть более сдвинут.\n\n```\nЭтот текст вовсе не сдвинут.\n:Этот текст немного сдвинут.\n::Этот текст чуть более сдвинут.\n```\n\nЭтот текст вовсе не сдвинут.\n\n"
    },
    {
      "title": "Код",
      "level": 3,
      "content": "Чтобы добавить блок кода в wiki, используйте один из шаблонов форматирования кода. Также вы можете просто начинать каждую строку с единичного пробела, например:\n\n```\n$ echo Hello World\n```\n\nСмотрите также Help:Стиль#Форматирование кода.\n\n"
    },
    {
      "title": "Таблицы",
      "level": 3,
      "content": "При правильном использовании таблицы могут помочь организовать большое количество данных в наглядном виде. Разметка таблиц является несколько сложной темой, которую не может покрыть данный раздел. За более подробной информацией о вики-таблицах обратитесь к руководству Wikipedia:ru:Википедия:Оформление таблиц.\n\nTable content:\nвикитекст | результат\n{| class=\"wikitable\" |+ Табличные данные ! Дистрибутив !! Цвет |- | Arch || Синий |- | Gentoo || Фиолетовый |- | Ubuntu || Оранжевый |} | Табличные данные Дистрибутив Цвет Arch Синий Gentoo Фиолетовый Ubuntu Оранжевый | Дистрибутив | Цвет | Arch | Синий | Gentoo | Фиолетовый | Ubuntu | Оранжевый\nДистрибутив | Цвет\nArch | Синий\nGentoo | Фиолетовый\nUbuntu | Оранжевый\n{| class=\"wikitable\" ! Файловая система !! Размер !! Использовано !! Доступно !! % использования !! Точка монтирования |- | rootfs || 922G || 463G || 413G || 53% || / |- | /dev || 1.9G || 0 || 1.9G || 0% || /dev |} | Файловая система Размер Использовано Доступно % использования Точка монтирования rootfs 922G 463G 413G 53% / /dev 1.9G 0 1.9G 0% /dev | Файловая система | Размер | Использовано | Доступно | % использования | Точка монтирования | rootfs | 922G | 463G | 413G | 53% | / | /dev | 1.9G | 0 | 1.9G | 0% | /dev\nФайловая система | Размер | Использовано | Доступно | % использования | Точка монтирования\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n```\n{| class=\"wikitable\"\n|+ Табличные данные\n! Дистрибутив !! Цвет\n|-\n| Arch || Синий\n|-\n| Gentoo || Фиолетовый\n|-\n| Ubuntu || Оранжевый\n|}\n```\n\nTable content:\nДистрибутив | Цвет\nArch | Синий\nGentoo | Фиолетовый\nUbuntu | Оранжевый\n\n```\n{| class=\"wikitable\"\n! Файловая система !! Размер !! Использовано !! Доступно !! % использования !! Точка монтирования\n|-\n| rootfs || 922G || 463G || 413G || 53% || /\n|-\n| /dev || 1.9G || 0 || 1.9G || 0% || /dev\n|}\n```\n\nTable content:\nФайловая система | Размер | Использовано | Доступно | % использования | Точка монтирования\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n"
    },
    {
      "title": "Ссылки",
      "level": 2,
      "content": "Ссылки необходимы, чтобы помочь читателям перемещаться по сайту. Главным образом от редакторов статей требуется, чтобы она содержала ссылки на другие вики-страницы (во избежание появления \"тупиковых\" страниц), а также сама была доступна по ссылкам с других страниц (вы можете использовать специальную страницу Ссылки сюда для поиска таких ссылок).\n\n"
    },
    {
      "title": "Внутренние ссылки",
      "level": 3,
      "content": "Вы можете делать очень много перекрестных ссылок в вики, используя внутренние ссылки. Чтобы создать ссылку на другую страницу в той же wiki, просто возьмите ее название в двойные квадратные скобки.\n\nНапример, ссылка на статью pacman (Русский) в тексте будет выглядеть так:\n\n```\n[[pacman (Русский)]]\n```\n\nЕсли вы хотите использовать слова, отличные от заголовка статьи, в качестве текста ссылки, вы можете добавить альтернативное имя после символа |.\n\nНапример:\n\n```\n[[ArchWiki:About (Русский)|ArchWiki]] является основным источником документации по Arch Linux в сети.\n```\n\nРезультат:\n\nВы можете также воспользоватсья возможностью добавления окончаний к последнему слову в ссылке (вроде \"s\", \"es\" для мн. ч., или, например, \"ing\" для герундия), при котором окончание включается в отображаемый текст ссылки, но не затрагивает ее саму.\n\nВот как это работает:\n\n```\nmakepkg is used in conjunction with [[PKGBUILD]]s.\n```\n\nРезультат:\n\nК сожалению, для русских букв это не работает.\n\n"
    },
    {
      "title": "Ссылки на разделы",
      "level": 4,
      "content": "Чтобы создать ссылку на раздел, просто добавьте # сразу за заголовком статьи и укажите заголовок раздела.\n\nНапример:\n\n```\n[[Help:Редактирование#Ссылки на разделы]]\n```\n\nРезультат:\n\n"
    },
    {
      "title": "Pipe trick",
      "level": 4,
      "content": "В некоторых случая удобно воспользоваться так называемым приемом \"pipe trick\" (\"трюк с пайпом\"), который позволяет упростить работу, автоматически подставляя подходящий текст ссылки. В ArchWiki он может быть полезен в двух случаях:\n\n1. Чтобы автоматически убирать языковой суффикс из текста ссылок. Например, викитекст [[Main page (Русский)|]] будет заменен на Main page.\n1. Когда требуется явное указание пространства имен в ссылке, эта возможность позволяет автоматически убрать префикс пространства имен из текста ссылки. Например, викитекст [[ArchWiki:About|]] будет заменен на About, а [[Wikipedia:Help:Pipe trick|]] — на Help:Pipe trick.\n\nКогда вы сохраняете страницу, все ссылки с пайпом в конце заменяются на ссылки с текстом, который вычисляется по специальным правилам на основе самой ссылки. При этом изменяется сам исходный код страницы. Смотрите подробнее на странице Wikipedia:Help:Pipe trick.\n\n"
    },
    {
      "title": "Межъязыковые ссылки",
      "level": 3,
      "content": "Смотрите раздел Help:Интернационализация#Межъязыковые ссылки.\n\n"
    },
    {
      "title": "Интервики-ссылки",
      "level": 3,
      "content": "Так называемые интервики-ссылки используются для упрощения создания ссылок на страницы во внешних вики-сайтах, например, Википедии. Интервики-ссылки оформляются точно так же, как и обычные ссылки, за тем испключением, что к названию страницы прибавляется префикс внешнего вики-сайта.\n\nНапример, вместо прямой ссылки на страницу в Википедии wikipedia:Arch Linux, вы можете указать просто:\n\n```\n[[Wikipedia:Arch Linux]]\n```\n\nГде Wikipedia — зарегистрированный в ArchWiki префикс сайта Википедии.\n\nТочно так же вы можете указать собственный текст ссылки, например, статья Arch Linux в Wikipedia:\n\n```\n[[Wikipedia:Arch Linux|статья Arch Linux в Wikipedia]]\n```\n\nСписок всех интервики-префиксов, зарегистрированных в ArchWiki, можно посмотреть по ссылке https://wiki.archlinux.org/api.php?action=query&meta=siteinfo&siprop=interwikimap&format=xml (формат XML). Как и везде, кроме первой буквы имена префиксов чувствительны к регистру.\n\n```\n[[Wikipedia:ru:Arch Linux]]\n```\n\n"
    },
    {
      "title": "Внешние ссылки",
      "level": 3,
      "content": "Если вы хотите добавить ссылку на внешний сайт, просто напишите полный URL-адрес страницы:\n\n```\nhttp://www.google.com/\n```\n\nЧасто бывает полезно указать собственный текст ссылки вместо отображаемого URL. Для этого укажите URL в квадратных скобках, а текст ссылки укажите сразу после URL, отделив его пробелом (не вертикальной чертой!). Например:\n\n```\n[http://www.google.com/ Поисковая машина Google]\n```\n\nРезультат: Поисковая машина Google.\n\nNote: **используйте #Внутренние ссылки и #Интервики-ссылки, а не внешние ссылки!** \n\n"
    },
    {
      "title": "Перенаправления",
      "level": 2,
      "content": "Страницы-перенаправления позволяют создавать дополнительные имена для основной страницы, которые можно использовать в ссылках.\n\nСтраницы-перенаправления должны содержать единственную строку с директивой #REDIRECT, за которой через пробел должна быть указана ссылка на основную страницу.\n\nНапример, вы можете создать перенаправление со страницы \"Кошки\" на страницу \"Кот\":\n\n```\n#REDIRECT [[Кот]]\n```\n\nТаким образом, если в поле поиска указать один из двух вариантов — \"Кот\" или \"Кошка\", вы автоматически попадете на страницу \"Кот\".\n\nПеренаправления также помогают отслеживать причину создания ссылок, объединяя последние в группы на странице \"Ссылки сюда\". Это позволяет быстро исправить большое количество ссылок, например, при изменении названия раздела, на который указывает перенаправление — достаточно лишь его отредактировать. В противном случае пришлось бы исправлять каждую ссылку по отдельности. В качестве обратной стороны медали можно назвать то, что при наведении в браузере указателя на ссылку-перенаправление не отображается полный адрес цели.\n\nПеред созданием перенаправления стоит проверить, нет ли уже подходящего. Пример: перенаправления на страницу Xorg (Русский).\n\nТакже смотрите Help:Стиль#Страницы перенаправления и Help:Procedures#Deal with talk pages after redirecting a page to another.\n\n- Перенаправления не должны вести на другие сайты.\n- Перенаправления не работают для страниц категорий.\n- Перенаправления выполняются на сервере и не замедляют открытие страниц.\n- Создание перенаправление из существующей страницы может привести к появлению двойного перенаправления. Исправление двойных перенаправлений описано в статье Help:Procedures#Fix double redirects.\n\n"
    },
    {
      "title": "Волшебные слова, переменные и шаблоны",
      "level": 2,
      "content": "В код страницы могут быть включены специальные волшебные слова, управляющие ее отображением. Например, слово __NOTOC__, добавленное в любое место в коде, предотвращает генерирование блока содержания. Аналогичным образом, слово __TOC__ может быть использовано, чтобы указать нужное вам место расположения блока содержания. Подробнее см. Справка:Волшебные слова.\n\nШаблоны и переменные представляют собой специальные участки вики-текста, который позволяет улучшить форматирование страниц.\n\nПеременные, как правило, используются для вставки в текст определенного динамического содержимого. Например, на месте {{SITENAME}}, будет отображено имя вики-сайта (на нашем сайте это \"ArchWiki\"). Переменная DISPLAYTITLE несколько отличается — она используется для управления отображением заголовка страницы: {{DISPLAYTITLE:Новый Заголовок}}. (Правда, это работает очень ограниченно — вы можете менять лишь регистр первой буквы и заменять пробелы символами подчеркивания, то есть, нормализованный заголовок должен совпадать с реальным названием страницы. Используйте шаблон {{Lowercase title|New Title}} , чтобы выводить название страницы с первой буквой в нижнем регистре.)\n\nНаличие и возможности той или иной переменной устанавливаются системой. Шаблоны, с другой стороны, могут создаваться и изменяться пользователями сайта. Их содержимое можно включать в любое место страницы.\n\nОбобщая, содержимое любой страницы может быть включено в другую страницу добавлением {{Пространство имен:Название страницы}} в статью. Однако, чаще всего таким образом на страницы включаются именно шаблоны (которые являются страницами из пространства имен \"Template\"). При включении шаблонов, вы можете опустить пространство имен: например, Template:Note (Русский) можно включить в статью следующим кодом:\n\n```\n{{Note (Русский)|Это заметка.}}\n```\n\nРезультат:\n\nПодробнее см. Help:Шаблон, а также список других доступных шаблонов, вроде Template:Совет и Template:Примечание.\n\n"
    }
  ]
}