{
  "title": "Список игр",
  "url": "https://wiki.archlinux.org/title/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%B8%D0%B3%D1%80",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Эмуляторы игровых приставок\n- Список приложений\n- Gaming (Русский)\n\nНа этой странице представлен список всех игр, доступных в официальных репозиториях или в AUR. Помимо этого, есть много других игр, которые не находятся в репозиториях; получить их можно способами, описанными в разделе Gaming#Getting games.\n\nДополнительные сведения о запуске игр и соответствующие советы по настройке системы смотрите в статье Gaming (Русский). Актуальный список игр, доступных в AUR, можно получить по ключевому слову 'game'.\n\n"
    },
    {
      "title": "Приключенческие боевики",
      "level": 2,
      "content": "- Abuse — Сайд-скроллер, в котором вам предстоит сразиться с безжалостными инопланетными убийцами.\n\n- Aquaria — 2D сайд-скроллер, ориентированный на исследование и решение головоломок, с нелинейным геймплеем. Игровой движок с открытым исходным кодом.\n\n- Astromenace — Современная космическая 3D-стрелялка с возможностью модернизации кораблей.\n\n- Barrage — Жестокая point-and-click стрелялка с красивыми эффектами.\n\n- Beneath a Steel Sky — Научно-фантастический триллер point-and-click, действие которого разворачивается в мрачном видении будущего.\n\n- Blob Wars: Metal Blob Solid — Приключенческая 2D-игра с различным оружием и миссиями.\n\n- Broken Sword 2.5: The Return of the Templars — Фанатское продолжение серии приключенческих игр Broken Sword.\n\n- BZFlag — Многопользовательская артиллерия от первого лица.\n\n- Commander Keen — Платформер.\n\n- C-Dogs — Расширенный SDL-порт DOS-аркады C-Dogs (aka \"Cyberdogs 2\")\n\n- Dráscula: The Vampire Strikes Back — Рисованный юмористический квест.\n\n- Dream Web — Приключенческая игра с видом сверху, действие которой разворачивается в мрачном футуристическом антиутопическом городе.\n\n- Flight of the Amazon Queen — Графический point-and-click квест-приключение.\n\n- Freedink — Свободная версия игры «Dink Smallwood», расширяемая с помощью модов.\n\n- Gish — 2D-платформер с физикой о приключениях шарика из смолы.\n\n- Grand Theft Auto III — Открытый проект по реверс-инжинирингу Grand Theft Auto III.\n\n- Grand Theft Auto: Vice City — Открытый проект по реверс-инжинирингу Grand Theft Auto: Vice City.\n\n- GNOME Nibbles — Игра Nibbles, цель которой — проглотить как можно больше предметов, избегая стен лабиринта и других червей. Входит в состав gnome-extra.\n\n- Hammerfight — Двухмерная боевая игра с физикой.\n\n- Unix-порт Haaf's Game Engine с открытым исходным кодом доступен на icculus.org.\n\n- Hollow Knight — Платформер в жанре метроидвания с глубокой историей и сложными битвами с боссами.\n\n- Ib — Хоррор-приключенческая игра о ребенке, запертом в музее эльдрического искусства.\n\n- kobodeluxe — Расширенная версия игры Акиры Хигучи XKobo, захватывающего космического шутера.\n\n- Kollision — Перемещайте шарик, избегая других шариков. Входит в состав kde-games.\n\n- KSpaceDuel — Игрок пытается уничтожить спутник противника и удержать свой спутник на орбите. Входит в состав kde-games.\n\n- Liquid War — Многопользовательская 2D-игра с простой и уникальной игровой механикой. Её можно классифицировать как быстро развивающуюся стратегию.\n\n- Lure of the Temptress — Фэнтезийный приключенческий квест с элементами комедии.\n\n- Naikari — Свободная двухмерная космическая торгово-наёмническая игра.\n\n- Neverball — 3D-игра, в которой нужно провести шарик через лабиринт.\n\n- OpenClonk — Многопользовательская 2D-игра в жанре приключенческой песочницы.\n\n- OpenLieroX — Чрезвычайно увлекательный шутер с червяками в реальном времени, поддерживаемый активным сообществом геймеров.\n\n- Rune — Слэшер с видом от третьего лица, работающий на Unreal Engine.\n\n- Space Station 14 — Многопользовательская игра о паранойе и хаосе на космической станции. Ремейк культовой классической игры Space Station 13.\n\n- S.U.A.V.E. — Весёлая гоночная игра, в которой вы управляете очень маленьким, но очень юрким танчиком. Он оснащён современным тяжелым оружием, которое поражает соперников на разных расстояниях.\n\n- The Ur-Quan Masters — Порт Star Control 2.\n\n- Veloren — Открытая воксельная RPG с открытым миром.\n\n- XBill — Уничтожьте все экземпляры вируса до того, как он заразит все компьютеры вредоносной программой, напоминающей Microsoft Windows.\n\n"
    },
    {
      "title": "Аркады",
      "level": 2,
      "content": "- Bomber — 2D-игра, в которой нужно поразить цели бомбами до того, как самолёт врежется в них. Входит в состав kde-games.\n\n- Bomberclone — Свободная игра, похожая на Bomberman, для Linux и Windows. Правила игры просты: бегайте по уровню и взрывайте других игроков.\n\n- Cave Story/Doukutsu — Захватывающий платформер в жанре метроидвания, созданный одним человеком. Если при большом количестве врагов на экране или на больших уровнях возникают лаги, попробуйте запустить версию для Windows через Wine.\n\n- Chromium — Быстрый космический шутер в аркадном стиле с видом сверху.\n\n- Counter-Strike 2D — 2D-клон (+дополнительные возможности) популярной игры Counter-Strike.\n\n- Crack-attack — Свободная OpenGL-игра, основанная на классической игре Tetris Attack от Super Nintendo.\n\n- DDNet — DDraceNetwork, мод Teeworlds.\n\n- Doom 2D — Двухмерный платформер на основе Doom от Prikol Software, современные порты оригинальной версии (рекомендуется flatwaifu).\n\n- Doom 2D Classic — Двухмерный платформер на основе Doom от Prikol Software, оригинальная (классическая) версия. Использует DOSBox.\n\n- Doom 2D: Forever — Двухмерный платформер на основе Doom с мультиплеером, современный порт Doom 2D от Prikol Software.\n\n- Frozen Bubble — Аркадная игра с красочным анимированным пингвином eyecandy.\n\n- Granatier — Клон Bomberman. Входит в состав kde-games.\n\n- Hedgewars — Клон Worms, который многие считают лучше своего предшественника. По очереди уничтожайте своих противников, добиваясь комичных результатов! В многопользовательской игре ещё лучше.\n\n- irrlamb — 3D-игра про управление мячом с упором на физику.\n\n- kapman — Клон PacMan. Входит в состав kde-games.\n\n- kbreakout — Игра в стиле Breakout. Входит в состав kde-games.\n\n- lbreakout2 — Аркадная игра в стиле Breakout на манер Arkanoid.\n\n- kbounce — Строительство стен для ограничения пространства, занимаемого мячами, отскакивающими от стен. Входит в состав kde-games.\n\n- ksnakeduel — Игра, похожая на Snake, для двух игроков, которые соревнуются в том, чтобы продержаться дольше соперника. Входит в состав kde-games.\n\n- LTris — Аркадная версия Tetris.\n\n- Mari0 — Марио с портальной пушкой.\n\n- Nikki and the Robots — Милый платформер с физикой.\n\n- Not Tetris 2 — Игра, похожая на тетрис, но с реалистичной физикой.\n\n- Open Hexagon — Очень сложная музыкальная аркадная игра, вдохновлённая игрой Super Hexagon от Терри Кавано.\n\n- Penguin Command — Клон классической игры «Missile Command» с улучшенной графикой и звуком.\n\n- Pinball — Симулятор пинбола с открытым исходным кодом для Linux и других Unix-систем.\n\n- PowerManga — Аркадная 2D-игра в стиле shoot-em-up с 41 уровнем и более чем 200 спрайтами.\n\n- Quadrapassel — Ремейк тетриса для GNOME. Входит в состав gnome-extra.\n\n- Streets of Rage Remake — Ремейк Streets of Rage 1, 2 и 3 от Sega.\n\n- Tecnoballz — Увлекательная игра про разрушение кирпичей.\n\n- Teeworlds — Быстрый многопользовательский 2D-шутер.\n\n- Tetrinet — Многопользовательский тетрис, поддерживающий до шести игроков.\n\n- Trackballs — 3D-игра про управление мраморным шариком, вдохновлённая игрой Marble Madness.\n\n- Warmux (ранее Wormux) — Игра, похожая на Worms 2/Worms Armageddon.\n\n- XInvaders3D — Клон Space Invaders с трёхмерной векторной графикой для X11.\n\n"
    },
    {
      "title": "Казуальные игры",
      "level": 2,
      "content": "- Aisleriot — Коллекция карточных пасьянсов.\n\n- Atanks — Мультиплатформенный клон Scorched Earth, похожий на серию игр Worms.\n\n- bs — Консольная версия классического морского боя с игрой против компьютера.\n\n- BSD Games — Коллекция классических текстовых игр, распространяемых с *BSD.\n\n- Kajongg — Маджонг для 4 игроков. Входит в состав kde-games.\n\n- KPatience — Набор карточных пасьянсов. Входит в состав kde-games.\n\n- KSquares — Игра «Палочки» для двух игроков. Входит в состав kde-games.\n\n- Lskat — Вариант игры «Скат» для двух игроков. Входит в состав kde-games.\n\n- Mah-Jong — Китайский классический маджонг (не пасьянс) с поддержкой сети.\n\n- nInvaders — Клон invaders на ncurses.\n\n- Pasang Emas — Традиционная брунейская настольная игра для двух игроков.\n\n- QCheckers — Шашки на Qt.\n\n- Tali — Победите в игре в кости в стиле покера. Входит в состав gnome-extra.\n\n- xroach — Тараканы прячутся под вашими окнами.\n\n"
    },
    {
      "title": "Симуляторы шахмат",
      "level": 2,
      "content": "- GNU Chess — Одна из старейших компьютерных шахматных программ для Unix, позволяет большинству современных компьютеров играть в полноценную шахматную партию.\n\n- GNU XBoard — Графический пользовательский интерфейс, поддерживающий множество вариантов шахмат и служащий фронтендом для шахматных сервисов, таких как движки.\n\n- chessx — Шахматная база данных и просмотрщик PGN.\n\n- cutechess — Графический интерфейс пользователя, интерфейс командной строки и библиотека для игры в шахматы.\n\n- Eboard — Интерфейс для ICS и шахматных движков.\n\n- Knights — Шахматная доска от KDE с поддержкой протокола XBoard.\n\n- PyChess — Продвинутый клиент шахмат для linux, соответствующий GNOME Human Interface Guidelines.\n\n- GNOME Chess — Двухмерная шахматная игра, которая может использовать сторонние шахматные движки. Входит в состав gnome-extra.\n\n- glChess — Трёхмерный фронтенд.\n\n- Scidb — Браузер шахматных баз данных: включает движки для шахмат, chess960 и т.д.; импорт из PGN, Scid, Chessbase и т.д.; поиск на CQL++.\n\n"
    },
    {
      "title": "Цифровые коллекционные карточные игры",
      "level": 2,
      "content": "- Duelyst — Гибрид цифровой коллекционной карточной игры и пошаговой стратегии, разработанный компанией Counterplay Games.\n\n"
    },
    {
      "title": "Образование",
      "level": 2,
      "content": "- Artikulate — Тренажёр, который помогает улучшить навыки произношения иностранного языка. Входит в состав kde-education.\n\n- Blinken — Игра про запоминание последовательностей для тренировки памяти. Входит в состав kde-education.\n\n- GCompris — Комплект образовательных программ, включающий множество занятий для детей в возрасте от 2 до 10 лет.\n\n- Kanagram — Игра про разгадывание анаграмм. Входит в состав kde-education.\n\n- KBruch — Небольшая программа для тренировки вычислений с дробями и процентами. Входит в состав kde-education.\n\n- KGeography — Инструмент для изучения географии, который позволяет узнать о политическом делении некоторых стран (деления, столицы этих делений и связанные с ними флаги, если таковые имеются). Входит в состав kde-education.\n\n- KHangMan — Игра «Виселица». Входит в состав kde-education.\n\n- KLettres — Приложение, помогающее пользователю выучить алфавит на новом языке, а затем научиться читать простые слоги. Входит в состав kde-education.\n\n- Minuet — Приложение для обучения музыке. Входит в состав kde-education.\n\n- Nootka — Приложение для изучения классической музыкальной нотации.\n\n- Tux Math — Аркадная игра, которая помогает детям практиковать математические факты.\n\n- Tux Paint — Программа рисования, ориентированная для детей младшего возраста.\n\n- Tux Typing — Программа для обучения детей набору текста.\n\n"
    },
    {
      "title": "Интерактивная художественная литература",
      "level": 2,
      "content": "Смотрите также Wikipedia:Interactive fiction#Development systems.\n\n- Inform — Система проектирования интерактивной художественной литературы на основе естественного языка.\n\n- INSTEAD — Интерпретатор текстографических приключений, использующий Lua в качестве языка написания игр.\n\n- TADS — Язык программирования на основе прототипов и набор стандартных библиотек для создания игр в жанре интерактивной литературы.\n\n"
    },
    {
      "title": "Массовые многопользовательские онлайн-игры (MMO)",
      "level": 2,
      "content": "Смотрите также Wikipedia:List of massively multiplayer online games и Wikipedia:Comparison of massively multiplayer online role-playing games.\n\n- Dofus — Бесплатная массовая многопользовательская ролевая онлайн-игра (MMORPG) для Adobe AIR.\n\n- Eternal Lands — 3D фэнтезийная ролевая онлайн-игра.\n\n- Isleward — Модифицируемая многопользовательская roguelike-игра.\n\n- Overte — Платформа виртуальных миров с открытым исходным кодом.\n\n- One Hour One Life — Бинарный пакет для игры One Hour One Life Джейсона Рорера.\n\n- Planeshift — Ролевая игра, погружающая в трёхмерный виртуальный фантастический мир. Она полностью бесплатна, что означает, что у вас не будет никаких сюрпризов в виде премиум-контента, который ограничит ваш игровой процесс или сломает игровой баланс. Нет никаких ограничений в навыках, званиях, способностях, предметах, которые вы можете получить с помощью своего бесплатного аккаунта.\n\n- RuneScape — Массовая приключенческая онлайн-игра от Jagex.\n\n- Ryzom — 3D MMORPG в стиле фэнтези.\n\n- Savage: The Battle for Newerth — Онлайновый многопользовательский командный гибрид FPS/RTS. Был опубликован исходный код в сентябре 2006 года. Savage XR, наиболее усовершенствованное продолжение (включая патчи SFE), полностью бесплатное (без покупок и рекламы), но с закрытым исходным кодом, чтобы затруднить читерство.\n\n- Savage 2: A Tortured Soul — Тематический многопользовательский командный онлайн гибрид FPS/RTS/RPG. Free-to-play по состоянию на декабрь 2008 года. Платные премиум-аккаунты предоставляют важнейшие игровые элементы, такие как дополнительные слоты инвентаря, доступ к кланам и снятие ограничений на юнитов Hellbourne (для каждого аккаунта), а также доступ к реплеям и статистике.\n\n- Stendhal — Бесплатная многопользовательская приключенческая онлайн-игра в стиле «старой школы».\n\n- The Mana World — Попытка создания инновационной бесплатной MMORPG с открытым исходным кодом.\n\n"
    },
    {
      "title": "Minecraft (клоны/лаунчеры)",
      "level": 2,
      "content": "- Freeminer — Игра-песочница с открытым исходным кодом, вдохновлённая игрой Minecraft.\n\n- Minecraft — Песочница с открытым миром, работает на Java.\n\n- VoxeLibre — Клон Minecraft для Luanti.\n\n- Luanti — Воксельный игровой движок и игра-песочница.\n\n- Terasology — Воксельный мир, открытый исходный код.\n\n- Vintage Story — Разрабатываемая инди-игра в жанре песочницы, посвящённая инновациям и исследованиям.\n\n- Voxelands — Форк Minetest, игра, вдохновлённая Infiniminer/Minecraft.\n\n- WolkenWelten — Микс Minecraft, Quake ]I[ и Emacs на C99.\n\n"
    },
    {
      "title": "Платформеры",
      "level": 2,
      "content": "- CaveExpress — Классический 2D-платформер с физическим геймплеем и десятками уровней.\n\n- Frogatto — Платформер с элементами приключения.\n\n- KGoldrunner — Платформер, цель которого — собрать золото. Входит в состав kde-games.\n\n- Knyttstories — Платформер с элементами приключения, интенсивным исследованием и скачиваемыми уровнями.\n\n- Project Sushi — Короткий, но сложный 2D-платформер.\n\n- Secret Maryo Chronicles — Игра в стиле Марио.\n\n- SuperTux — Игра в стиле Марио с Таксом в главной роли.\n\n- The Legend of Edgar — 2D-платформер: Путешествуйте по миру, сражайтесь со страшными существами и решайте головоломки, чтобы спасти своего отца.\n\n- Toppler — Воссоздание классической игры «Nebulus» с прыжками и бегом.\n\n"
    },
    {
      "title": "Головоломки",
      "level": 2,
      "content": "- Antichamber — Психологическая игра-исследование, в которой ничего нельзя принимать на веру.\n\n- Atomix — Сборка молекул из отдельных атомов.\n\n- Blockout II — 3D-тетрис, свободная адаптация оригинальной игры BlockOut DOS, созданной California Dreams в 1989 году.\n\n- Bovo — Игра, похожая на гомоку. Входит в состав kde-games.\n\n- Cgoban3 — Клиент Kiseido Go и SGF.\n\n- Chroma — Головоломка типа Sokoban с ncurses и графическим режимом.\n\n- Crack Attack! — Свободная OpenGL игра, основанная на классической игре Tetris Attack от Super Nintendo.\n\n- Five or More — GNOME-порт некогда популярной игры для Windows под названием Color Lines. Цель игры — как можно чаще выстраивать пять и более объектов одного цвета и формы, чтобы они исчезали. Входит в состав gnome-extra.\n\n- Flying Robots — Избегайте роботов-убийц. Похожа на bsd-robots, но с возможностью перемещения в третьем измерении.\n\n- GNOME 2048 — Перемещайте плитки до тех пор, пока не получите плитку 2048. Входит в состав gnome-extra.\n\n- GNOME Klotski — Клон игры Klotski. Задача состоит в том, чтобы переместить узорчатый блок в область, отмеченную зелёными маркерами. Входит в состав gnome-extra.\n\n- GNOME Mahjongg — Пасьянс (для одного игрока) — версия классической восточной игры с плитками, Маджонг. Входит в состав gnome-extra.\n\n- GNOME Mines — Сапёр: вы находите мины, плавающие в океане, используя только свой мозг и немного удачи. Входит в состав gnome-extra.\n\n- GNOME Sudoku — Проверьте свои логические навыки в судоку — головоломке с числовой сеткой. Входит в состав gnome-extra.\n\n- GNOME Taquin — Компьютерная версия пятнашек и других похожих игр. Входит в состав gnome-extra.\n\n- GNOME Tetravex — Простая головоломка с сопоставлением краёв (edge-matching puzzle), в которой нужно расположить фигуры так, чтобы одинаковые цифры касались друг друга. Входит в состав gnome-extra.\n\n- Gnu Go — Реализация игры го для командной строки от GNU.\n\n- Gopanda — Клиент для Pandanet-IGS go Server.\n\n- gweled — Убирайте плитки, соединяя их по три в ряд.\n\n- Hitori — Небольшое приложение, написанное для того, чтобы можно было играть в одноимённую головоломку Хитори, которая по тематике похожа на более популярные головоломки, такие как судоку. Входит в состав gnome-extra.\n\n- iQPuzzle — Увлекательная и сложная головоломка пентомино.\n\n- KAtomic — Сдвиньте элементы так, чтобы они напоминали химическую молекулу. Входит в состав kde-games.\n\n- KBlackbox — Поиск положения спрятанных шариков с помощью подсказок. Входит в состав kde-games.\n\n- KBlocks — Клон тетриса. Входит в состав kde-games.\n\n- KDiamond — Убирайте плитки, соединяя их по три в ряд. Входит в состав kde-games.\n\n- KFourInLine — Соревнование между двумя игроками по выставлению линии из четырёх фигур перед соперником. Входит в состав kde-games.\n\n- Kigo — Игра го для KDE. Входит в состав kde-games.\n\n- Killbots — Пошаговая игра с целью избежать роботов, которые пытаются убить игрока. Входит в состав kde-games.\n\n- KJumpingCube — Игрок захватывает клетки, увеличивая значение одной из своих клеток. Входит в состав kde-games.\n\n- Klickety — Очистка доски путём удаления групп соседних плиток с одинаковым цветом. Входит в состав kde-games.\n\n- KLines — Перемещайте шарики по доске, чтобы сформировать линию из 5 шариков одного цвета. Входит в состав kde-games.\n\n- Klooni1010 — Отполированный и аддиктивный клон игры «1010!». Игрок размещает блоки, пытаясь собрать полные вертикальные или горизонтальные линии.\n\n- KMines — Игра «Сапёр», входит в состав kde-games.\n\n- KNetwalk — Вращайте плитки с проводами для подключения всех компьютеров к Интернету. Входит в состав kde-games.\n\n- Kolf — Игра в мини-гольф с 2D видом сверху. Входит в состав kde-games.\n\n- Sabaki — Элегантная доска го и редактор SGF-файлов.\n\n- KShisen — Сисэн-сё. Входит в состав kde-games.\n\n- KSudoku — Игра судоку и многое другое для KDE. Входит в состав kde-games.\n\n- Kubrick — Кубик Рубика. Входит в состав kde-games.\n\n- Lights Off — Логическая игра, цель которой — выключить все плитки на доске. Также известна как Lights Out. Входит в состав gnome-extra.\n\n- Lix — Клон игры «Lemmings»: назначайте роли некоторым из множества постоянно ходящих существ, чтобы безопасно провести их через выход.\n\n- Marvellous Inc. — Zachlike головоломка с историей, рассказанной через электронные письма.\n\n- Palapeli — Пазл. Входит в состав kde-games.\n\n- Picmi — Японский кроссворд.\n\n- Pingus — Клон игры «Lemmings».\n\n- Ri-li — Игрушечный деревянный паровозик собирает вагончики. Лицензия GPL.\n\n- qgo — Клиент го и полнофункциональный редактор SGF.\n\n- Simon Tatham's Portable Puzzle Collection — 30+ «быстрых» игр-головоломок с упрощённым, но отполированным графическим интерфейсом на GTK.\n\n- Swell Foop — Очистите экран, удаляя группы цветных и фигурных плиток. Также известна как SameGame. Входит в состав gnome-extra.\n\n- VVVVVV — Высоко оценённая инди-игра в жанре 2D-головоломки с ретро-тематикой C64, с отличным чиптюн-саундтреком.\n\n- XMahjongg — Маджонг для X.\n\n- Xscorch — Клон классической DOS-игры Scorched Earth.\n\n- World of Goo — Отличная 2D-головоломка с физикой.\n\n- Fish Fillets — Порт замечательной игры-головоломки Fish Fillets.\n\n"
    },
    {
      "title": "Гонки",
      "level": 2,
      "content": "- Armagetron Advanced — Клон Tron в 3D.\n\n- Extreme Tux Racer — 3D-игра, в которой вы направляете пингвина Такса по снегу и льду, собирая рыбу.\n\n- Maniadrive — Аркадная автомобильная игра на акробатических трассах с быстрым и нервным геймплеем.\n\n- Moon Buggy — Простая игра для текстового режима.\n\n- Q3Rally — Игра про вождение автомобиля и автомобильные бои, основанная на движке Quake III Arena.\n\n- Rigs of Rods — Песочница-симулятор транспортных средств, предшественник Beam.NG drive с открытым исходным кодом. Реализует реалистичную физическую модель мягких тел и имеет активное моддинг-сообщество по состоянию на 2020 год.\n\n- RVGL — Ремейк Re-Volt, популярной трёхмерной гоночной игры 1999 года с активным онлайн-сообществом.\n\n- Speed Dreams — Форк Torcs, стремящийся реализовать новые захватывающие возможности, а также улучшить реалистичность.\n\n- Stunt Rally — Гоночная игра с раллийным стилем вождения, в основном по гравию.\n\n- SuperTuxKart — Открытая аркадная гонка на картах с Таксом и его друзьями.\n\n- Torcs — 3D-симулятор гоночных автомобилей с использованием OpenGL.\n\n- Trigger Rally — Гонка на OpenGL с ралли-автомобилями.\n\n- Ultimate Stunts — Ремейк знаменитой DOS-игры 'stunts'.\n\n- VDrift — Симулятор вождения с открытым исходным кодом, созданный с учётом особенностей дрифт-гонок.\n\n- XMoto — 2D-мотокросс на платформах, где физика играет важную роль.\n\n"
    },
    {
      "title": "Ритм-игры",
      "level": 2,
      "content": "- Clone Hero — Клон Guitar Hero/Rock Band, который в точности соответствует тому, как игралась серия. Поддерживает оригинальные контроллеры и импорт песен, сделанных сообществом.\n\n- Etterna — Ритм-игра с открытым исходным кодом, форк Stepmania, ориентированная на клавиатуру и соревновательную игру (демонстрация различных навыков, онлайн-таблица лидеров и т. д.).\n\n- Friday Night Funkin' — Donationware ритм-игра с открытым исходным кодом, впервые выпущенная в 2020 году для game jam.\n\n- Open Hexagon — Очень сложная музыкальная аркадная игра, вдохновлённая игрой Super Hexagon от Терри Кавано.\n\n- opsu! — Java-клиент для ритм-игры «osu!».\n\n- osu! — Ритм-игра с четырьмя игровыми режимами: osu!standard — симулятор кликанья по кругам; osu!taiko — эмулятор игры на барабанах; osu!catch — ловец фруктовых салатов; и osu!mania — разбиватель клавиш.\n\n- Project Outfox — Универсальный движок для ритм-игр. Начинался как форк Stepmania, с последними патчами, классической поддержкой скриптов OpenITG и многим другим. В настоящее время поддерживает 17 стилей ритм-игр, включая танцы, гитару, парапару, тайко, бонго и т.д.\n\n- Performous — Караоке и танцевальная игра для нескольких играющих с открытым исходным кодом.\n\n- Stepmania — Продвинутая игра-симулятор танца.\n\n- Ultrastar Deluxe — Караоке, клон SingStar.\n\n"
    },
    {
      "title": "Рогалик (Rogue-like)",
      "level": 2,
      "content": "Смотрите также Wikipedia:Chronology of roguelike video games.\n\n- ADOM — Ancient Domains Of Mystery.\n\n- Angband — Игра по исследованию подземелий, основанная на произведениях Дж. Р. Р. Толкина.\n\n- ASCIIpOrtal — Игра с сайдскроллингом и ANSI-графикой, в которой вы являетесь человеком, держащим устройство, которое создаёт порталы.\n\n- Brogue — Рогалик для начинающих.\n\n- Cataclysm: Dark Days Ahead — Постапокалиптическая игра с упором на реализм.\n\n- Linley's Dungeon Crawl — Ролевая игра с открытым исходным кодом, в которой вам предстоит пройти через подземелья, наполненные опасными монстрами, и найти могущественный артефат — Orb of Zot.\n\n- DoomRL — Простая roguelike-игра, основанная на Doom. Идеально подходит для начинающих.\n\n- Dwarf Fortress — Однопользовательская фэнтезийная игра. Вы управляете крепостью дварфов или приключенцем в случайно генерируемом постоянном мире.\n\n- glHack — OpenGL-клон NetHack.\n\n- HyperRogue — Неевклидовая roguelike-игра, шедевр, расплавляющий сознание.\n\n- Infra-Arcana — Игра, вдохновлённая трудами Г.Ф. Лавкрафта.\n\n- Nethack — Однопользовательская игра по исследованию подземелий.\n\n- Rogue — Оригинальная игра, породившая жанр.\n\n- Shadow Of The Wyrm — Однопользовательская традиционная roguelike от Джулиана Дtя.\n\n- Stone Soup — Dungeon Crawl Stone Soup.\n\n- KeeperRL — Амбициозный симулятор подземелья с элементами roguelike и RPG. Возьмите на себя роль злого волшебника и изучите методы чёрной магии.\n\n- Tales of Maj'Eyal (ранее Troubles of Middle Earth) — Игра по исследованию подземелий, похожая на Angband, основанная на произведениях Толкина.\n\n- wanderer — Игра, похожая на Boulderdash, Repton, XOR и другие.\n\n- Shattered Pixel Dungeon — Форк популярной игры Pixel Dungeon.\n\n"
    },
    {
      "title": "Ролевые игры (RPG)",
      "level": 2,
      "content": "- Arx Libertatis — Порт с открытым исходным кодом Arx Fatalis, ролевой игры от первого лица 2002 года, разработанной Arkane Studios. В нём есть некоторые улучшения по сравнению с оригинальным движком, такие как исправление ошибок и поддержка широких экранов.\n\n- Daggerfall Unity — The Elder Scrolls: Daggerfall, воссозданная на движке Unity.\n\n- DevilutionX — Сборка Diablo для современных операционных систем.\n\n- Egoboo — Ролевая игра с 3D-графикой OpenGL.\n\n- falltergeist — Игровой движок Fallout с открытым исходным кодом, написанный на C++ и SDL.\n\n- fallout1-ce — Fallout для современных операционных систем.\n\n- fallout2-ce — Fallout 2 для современных операционных систем.\n\n- fheores2 — Попытка реализовать движок игры Heroes of Might and Magic II с использованием SDL.\n\n- Flare — Экшн-игра, похожая на Diablo.\n\n- FoundryVTT — Создание многопользовательских настольных ролевых игр с помощью многофункционального и современного self-hosted приложения, к которому игроки подключаются непосредственно через браузер.\n\n- FreedroidRPG — Научно-фантастическая ролевая игра, действие которой происходит в будущем.\n\n- GemRB — Написанная с нуля реализация движка Infinity Engine с лицензией GNU GPL.\n\n- OFF — Игра на RPG Maker, известная своими сюрреалистическими окружениями и сюжетом. (Фанатский перевод на английский язык).\n\n- OpenMW — Открытая реализация движка популярной ролевой игры Morrowind.\n\n- Pokete — Небольшая консольная игра в стиле очень популярной и старой игры от Gamefreak.\n\n- Sulis — Пошаговая тактическая ролевая игра с несколькими кампаниями, написанная на языке Rust.\n\n- Undertale — RPG, в которой атаковать необязательно. Включает элементы bullet hell. Игру часто хвалят за сюжет и саундтрек.\n\n- Tuxemon — Свободная ролевая игра про борьбу с монстрами.\n\n- Valyria Tear — Попытка создания свободной (в соответствии с Gnu Public License) J-RPG игры.\n\n- VCMI — Попытка реализовать Heroes of Might and Magic III.\n\n- xu4 — Ремейк компьютерной игры Ultima IV.\n\n"
    },
    {
      "title": "Шутеры",
      "level": 2,
      "content": "- Alien Arena — Шутер, ориентированный в основном на многопользовательскую онлайн-игру, но можно играть и в одиночную игру против ботов.\n\n- AssaultCube — Многопользовательский шутер на движке Cube. Реалистичное окружение, быстрый, аркадный геймплей. Во многом напоминает Counter-Strike.\n\n- AssaultCube Reloaded — Улучшенный AssaultCube.\n\n- Cube 2: Sauerbraten — Шутер на улучшенной версии движка Cube.\n\n- Doom: знаменитый шутер от ID Software имеет несколько портов для Linux. Ни одна из игр компании не имеет свободных игровых ресурсов; открыт был только код движка. Смотрите [1] для более подробной информации.\n\n- Ресурсы демо-версии Doom 1 – doom1-wadAUR\n- Ashes 2063 — Полная переработка на тему постапокалипсиса для движка GZDoom.\n\n- Brutal Doom — Мод для Doom, созданный в 2010 году Маркосом Aбенанте (Sergeant_Mark_IV).\n\n- Freedoom — Проект, направленный на создание свободных ресурсов Doom.\n\n- Chocolate Doom — Порт Doom, воспроизводящий поведение оригинальной DOS-версии.\n\n- Doomsday — Усовершенствованный порт игрового движка Doom, способный также запускать игры Heretic и Hexen.\n\n- GZDoom — Порт Doom с OpenGL, основанный на ZDoom.\n\n- PrBoom Plus — Улучшенная версия порта движка PrBoom.\n\n- ZDoom — Улучшенный порт Doom с дополнительной поддержкой Heretic, Hexen и Strife.\n\n- Doom 3\n\n- Doom 3 Engine — Движок Doom 3, компилируемый из исходников.\n\n- dhemw3 — Форк iodoom3.\n\n- RBDOOM-3-BFG — Форк Doom 3 BFG Edition.\n\n- ezQuake — Быстрый многопользовательский шутер с упором на движение и прыжки. Популярный, современный и поддерживаемый клиент Quake/QuakeWorld. Можно играть онлайн бесплатно.\n\n- Duke Nukem 3D\n\n- eduke32 — Продвинутый порт.\n\n- Enemy Territory: Quake Wars — Коммерческая командная многопользовательская игра с классами. Для игры в полную версию требуется оригинальный DVD.\n\n- HHeretic — Linux-порт старого шутера Heretic от Raven Game.\n\n- Ресурсы демо-версии Heretic – heretic1-wadAUR\n\n- HHexen — Linux-порт старого шутера Hexen от Raven Game.\n\n- Ресурсы демо-версии Hexen 1 – hexen1-wadAUR\n\n- Hypersomnia — Хардкорный киберспортивный шутер с внутриигровым редактором.\n\n- nQuake — Быстрый многопользовательский шутер с упором на движение и прыжки. Это популярный пакет Quake / QuakeWorld, включающий клиент ezQuake, 24-битные текстуры, карты, ботов и многое другое. Можно играть в режиме онлайн бесплатно.\n\n- OpenArena — Быстрый многопользовательский шутер на базе движка quake3.\n\n- OpenXRay — Улучшенная версия X-Ray Engine, игрового движка, используемого во всемирно известной серии игр S.T.A.L.K.E.R. от GSC Game World. Игровые ресурсы необходимо приобретать отдельно.\n\n- S.T.A.L.K.E.R.: Зов Припяти — единственная поддерживаемая игра по состоянию на январь 2023 года. Поддержка игр S.T.A.L.K.E.R.: Тень Чернобыля и S.T.A.L.K.E.R.: Чистое небо находится в разработке [2] [3].\n\n- Prey — Шутер от первого лица, выпущенный в 2006 году (с портом GNU/Linux в 2008 году), изданный 3D Realms.\n\n- Quake\n\n- Продвинутый движок Quake 1 – darkplacesAUR\n- Текстуры высокого качества от Quake Revitalization Project – quake-qrp-texturesAUR\n- Современный движок Quake 1, форк Fitzquake, стабильная версия с дополнительными desktop-файлами для Mission pack'ов – quakespasmAUR\n\n- Quake II\n\n- Quake 2 — Версия движка от Icculus.\n\n- True color текстуры для Quetoo и других движков Quake2, поддерживающих 32-битные tga-текстуры – quake2-retextureAUR\n- Версия движка Quake 2, оптимизированная для современных систем – yamagi-quake2AUR\n- Quake 2 v3.21 с поддержкой Vulkan – vkquake2AUR\n\n- Quake III Arena\n\n- Официальные исполняемые файлы Quake III Arena – quake3AUR\n- ioquake3 — Улучшенный движок Quake 3.\n\n- Quake 4\n\n- Демо-версия – quake4-demoAUR\n- Движок Quake 4 – quake4AUR\n\n- Red Eclipse — Однопользовательский и многопользовательский шутер от первого лица, созданный как полная переработка Cube Engine 2.\n\n- Serious Sam: The First Encounter — Открытая версия игрового движка, разработанного компанией Croteam для игры Serious Sam Classic, с поддержкой Vulkan.\n\n- Serious Sam: The Second Encounter — Открытая версия игрового движка, разработанного компанией Croteam для игры Serious Sam Classic, с поддержкой Vulkan.\n\n- Spear of Destiny\n\n- ECWolf — Продвинутый порт.\n\n- Super 3D Noah's Ark\n\n- ECWolf — Продвинутый порт.\n\n- Tesseract — Плавный шутер с редактированием карт, инстагибом, дезматчем и захватом флага.\n\n- Tremulous — Шутер с элементами стратегии в реальном времени с участием людей и инопланетян.\n\n- Unreal Tournament (2014) — Бесплатный ремейк оригинала с открытым исходным кодом на движке Unreal Engine 4.\n\n- Unvanquished — Гибридная fps/rts командная игра, в которой пришельцы противостоят людям. Ежемесячный релиз, в который можно играть на официальных серверах.\n\n- Urban Terror — Современный многопользовательский шутер на движке ioquake3.\n\n- War Trigger 2 — Ранее известный как Red Crucible®: Reloaded, бесплатный онлайн-шутер.\n\n- War Trigger 3 — Ранее известный как Red Crucible®: Firestorm, бесплатный онлайн-шутер.\n\n- Warsow — Многопользовательский быстрый шутер, в котором основное внимание уделяется движению и прыжкам.\n\n- Wolfenstein 3D\n\n- ECWolf — Продвинутый порт.\n\n- Wolfenstein: Enemy Territory\n\n- Полностью бесплатный командный многопользовательский шутер от первого лица – enemy-territoryAUR\n- Продвинутый порт с открытым исходным кодом и полностью совместимые клиент и сервер – etlegacy32AUR\n\n- World of Padman — Stand slone somplex – многопользовательский шутер от первого лица в мультяшном стиле.\n\n- Xonotic — Свободный шутер от первого лица (форк Nexuiz, но с изменённым геймплеем).\n\n- XPilot — Многопользовательская двухмерная космическая игра. Некоторые особенности заимствованы из классики, такой как Atari coin-ups Asteroids и Gravitar, и игр для домашних компьютеров Thrust (Commodore 64) и Gravity Force (Commodore Amiga), но XPilot имеет и много новых аспектов.\n\n"
    },
    {
      "title": "Симуляторы",
      "level": 2,
      "content": "- A/B Street — Программа планирования транспорта и моделирования движения для создания городов, более благоприятных для пешеходов, велосипедистов и общественного транспорта.\n\n- Beyond the Red Line — Переработка Freespace 2, основанная на телешоу Battlestar Galactica. Считается заброшенной, в качестве альтернативы смотрите Diaspora: Shattered Armistice.\n\n- openblack — Открытая реализация игры Black & White (2001).\n\n- Endless Sky — Двухмерная космическая торгово-боевая игра, похожая на классическую серию Escape Velocity.\n\n- Flight Gear — Мультиплатформенный свободный авиасимулятор.\n\n- Foobillard++ — Преемник Foobillard, OpenGL-бильярд для Linux.\n\n- FreeSpace 2 — Космический симулятор с открытым исходным кодом.\n\n- Koi Farm — Выращивание карпов кои.\n\n- Linux Air Combat — Многопользовательский 3D-симулятор боевых полётов с открытым исходным кодом, включающий самолёты Второй мировой войны. Поддерживает управление джойстиком, геймпадом или мышью.\n\n- LPub3D — Редактор LDraw™ для создания цифровых инструкций по строительству в стиле LEGO®.\n\n- Micropolis — Микрополис с открытым исходным кодом, основанный на оригинальной игре SimCity Classic от Maxis, автор Уилл Райт.\n\n- Naev — Двухмерная космическая торгово-боевая игра с открытым исходным кодом, черпающая вдохновение в серии Escape Velocity.\n\n- openBVE — Симулятор поезда, доступный как общественное достояние.\n\n- Oolite — Космический 3D-симулятор торговли и боя в духе Elite.\n\n- Orbiter 2016 — Симулятор космического полёта Orbiter.\n\n- Pioneer — Космическое приключение в галактике Млечный путь на рубеже 31-го века в духе Frontier: Elite II.\n\n- Principia — Основанная на физике строительная игра-песочница.\n\n- Pydance — Игра в стиле Dance Dance Revolution на Python.\n\n- Rigs of Rods — Песочница-симулятор транспортных средств, предшественник Beam.NG drive с открытым исходным кодом. Реализует реалистичную физическую модель мягких тел и имеет активное моддинг-сообщество по состоянию на 2020 год.\n\n- Thrive — Игра об эволюции, в которой игрок ведёт вид от зарождения в виде микроба до космической эры и далее.\n\n- The Powder Toy — Игра-песочница с открытым исходным кодом, которая моделирует давление и скорость воздуха, тепло, гравитацию и бесчисленное количество взаимодействий между различными веществами.\n\n- Vega Strike — Реалистичный симулятор космического полёта с торговлей и боями.\n\n"
    },
    {
      "title": "В реальном времени",
      "level": 3,
      "content": "- 0 A.D. — Историческая 3D-стратегия в реальном времени, альфа-стадия. Основана на серии Age of Empires.\n\n- 20,000 Light Years Into Space — Стимпанк-стратегия, в которой вам предстоит управлять сетью парового снабжения на далёкой планете.\n\n- Augustus — Расширенная реализация Caesar III.\n\n- Beyond All Reason — RTS-игра с открытым исходным кодом, построенная на базе движка Spring RTS Engine.\n\n- Dark Oberon — Стратегия реальном времени с открытым исходным кодом, похожая на Warcraft II.\n\n- Dune Legacy — Обновлённый клон игры от Westood Studios — Dune2.\n\n- Factorio — Проприетарная игра о добыче ресурсов, планировании и строительстве заводов, автоматизации производства и борьбе с инопланетными врагами.\n\n- FTL: Faster Than Light — Популярная космическая rogue-like игра, вышедшая в 2012 году и получившая положительные отзывы.\n\n- Globulation 2 — Многопользовательская стратегия с некоторыми «экономическими» элементами, минимизирующими количество микроменеджмента.\n\n- Julius — Открытая реализация Caesar III (требуются файлы оригинальной игры).\n\n- Kernel Panic — Игра, основанная на борьбе внутри компьютера, с 3 уникальными сторонами: системой, хакером и сетью, ведущими войну в матрице DOOM! В KP не существует экономики ресурсов, единственными ограничениями являются время и пространство.\n\n- MegaGlest — Форк Glest, 3D-стратегия в реальном времени в фантастическом мире.\n\n- Mindustry — Песочница с открытым исходным кодом про защиту башен и строительство фабрик.\n\n- openage — Свободный клон движка Age of Empires II.\n\n- OpenDUNE — Открытая реализация популярной игры Dune II.\n\n- OpenRA — Стратегия, написанная на C# и основанная на игровой франшизе Command & Conquer.\n\n- OpenHV — Пиксельная научно-фантастическая стратегия в реальном времени на основе OpenRA.\n\n- Spring:1944 — Игра на тему Второй мировой войны с четырьмя полностью функциональными сторонами (США, Германия, СССР, Великобритания), точными по периоду юнитами и сильными сторонами. Реализм стоит на втором месте после создания игры, в которую весело и доступно играть. Игру можно загрузить через SpringLobby, официальный лобби-клиент для лобби Spring.\n\n- Unknown Horizons — 2.5D изометрический симулятор с элементами стратегии в реальном времени с упором на экономику и строительство городов. Развивайте своё небольшое поселение до сильной и богатой колонии, собирайте налоги и снабжайте жителей ценными товарами. Увеличивайте своё могущество благодаря хорошо сбалансированной экономике, а также стратегической торговле и дипломатии.\n\n- Warzone 2100 — Вы командуете силами The Project в битве за восстановление мира после того, как человечество было почти уничтожено ядерными ракетами. В игре есть режимы кампании, многопользовательской игры и одиночного боя. Обширное дерево технологий, включающее более 400 различных технологий, в сочетании с системой проектирования юнитов позволяет создавать большое разнообразие возможных юнитов и тактик. Пакет AUR устанавливает видео (FS#55310).\n\n- Widelands — Стратегия с медленным темпом игры, похожая на «The Settlers 2».\n\n- Zero-K — Стратегия в реальном времени с открытым исходным кодом на движке Spring.\n\n- Wrymsun — Фэнтезийная игра, изначально основанная на движке Stratagus.\n\n"
    },
    {
      "title": "Пошаговые",
      "level": 3,
      "content": "- Ancient Beast — Пошаговая стратегическая игра.\n\n- C-evo — Игра в стиле Civilization, эпохи Civ II.\n\n- Endgame Singularity — Стратегия/симулятор о скрывающемся, растущем и развивающемся ИИ.\n\n- Four in a Row — Четыре в ряд — выстройте линию из четырех своих шариков, стараясь не дать противнику сделать то же самое. Входит в состав gnome-extra.\n\n- Freeciv — Многопользовательский клон знаменитой игры Civilization от Microprose.\n\n- FreeCol — Клон Colonization.\n\n- FreeOrion — Игра про космическую империю и покорение галактики. Вдохновлена традициями игр серии Master of Orion, но не пытается быть клоном или ремейком этой серии или какой-либо другой игры.\n\n- Iagno — Доминируйте на доске в классической версии игры Реверси. Входит в состав gnome-extra.\n\n- GNOME Robots — Классическая игра Chase, в которой вам нужно избегать роботов, пытающихся вас убить. Входит в состав gnome-extra.\n\n- KReversi — Реверси. Входит в состав kde-games.\n\n- KsirK — Игра в стиле risk, в которой игроки пытаются завоевать мир, решая, какая область будет захвачена следующей. Входит в состав kde-games.\n\n- OpenXCom — Открытая реализация игры UFO: Enemy Unknown (X-Com: UFO defence в Северной Америке), с множеством созданных сообществом модов.\n\n- Расширенная и более кастомизируемая версия Open X-COM (OXCE) [4] – openxcom-extendedAUR\n- Моды для Open X-COM и OXCE – openxcom-mod-40kAUR, openxcom-mod-area51AUR, openxcom-mod-twotsAUR, openxcom-mod-xfilesAUR, openxcom-mod-xpiratezAUR\n\n- Pioneers — Клон известной игры Settlers of Catan с онлайном.\n\n- Signus — Signus: The Artefact Wars — классическая пошаговая военная стратегия, похожая на старую серию Battle Isle.\n\n- TripleA — Онлайновая многопользовательская пошаговая стратегическая игра и движок для настольных игр.\n\n- The Battle for Wesnoth — Пошаговая тактическая стратегия на тему фэнтези с одиночной игрой и многопользовательскими боями.\n\n"
    },
    {
      "title": "Tycoon/Бизнес-симуляторы",
      "level": 2,
      "content": "- Cytopia — Симулятор строительства города.\n\n- Lincity-ng — Симулятор, в котором вам предстоит построить и поддерживать город. Вы можете выиграть игру, либо построив устойчивую экономику, либо эвакуировав всех жителей с помощью космических кораблей.\n\n- Konquest — Пошаговая игра, в которой игрок ведёт войны, управляя флотом космических кораблей и завоёвывая другие планеты. Входит в состав kde-games.\n\n- Simutrans — Ещё один Transport-симулятор, работающий на linux с sdl.\n\n- OpenLoco — Открытая реализация игры Криса Сойера Locomotion.\n\n- OpenTTD — Открытый клон игры Microprose «Transport Tycoon Deluxe», первоначально написанной Крисом Сойером. Он пытается как можно точнее имитировать оригинальную игру, при этом расширяя её новыми возможностями.\n\n- OpenRCT2 — Открытая реализация игры «RollerCoaster Tycoon 2 (RCT2)» с поддержкой мультиплеера. Требуется копия оригинальной игры.\n\n"
    },
    {
      "title": "Визуальные новеллы",
      "level": 2,
      "content": "- Juniper's Knot — Короткая игра о мальчике и демоне.\n\n- Katawa Shoujo — Игра в стиле визуальной новеллы Bishoujo, рассказывающая историю молодого человека и ещё пяти девушек, страдающих различными нарушениями. Игра лицензирована под Creative Commons CC-BY-NC-ND.\n\n- Narcissu — Визуальный роман, рассказывающий историю смертельно больных молодых парня и девушки.\n\n- School Days — История о Макото Ито, ученике средней школы, в которого влюбляются несколько девушек, и о том, как это влияет на него самого и его отношения с другими персонажами.\n\n- Summer Days — Спин-офф из серии Days и ремейк Summer Days.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- PCGamingWiki - \"PCGamingWiki aims to list fixes and workarounds for every single PC game\"\n- ProtonDB - \"The goal of ProtonDB is to gather reports from other gamers as they test games with Proton on Linux and provide aggregate scores of how well games perform. A growing pool of [...] tweaks\".\n- Linux Installers for Linux Gamers\n- The Linux Gamers' Game List\n- Linux game database\n- Penguspy\n- Debian games portal, links, and suggested games\n- ./play.it list of games\n- Wikipedia:Category:Linux games\n- Wikipedia:Humble Bundle\n- Wikipedia:Game engine recreation\n- itch.io Linux games\n- Steam Linux store\n\n"
    },
    {
      "title": "Открытые и свободные игры",
      "level": 3,
      "content": "- \"LibreGameWiki, the libre, opensource and free games encyclopedia\"\n- reddit.com/r/linux list of free games\n- LGames - open source games for Linux\n- Source ports: Open Source Game Clones\n\n"
    }
  ]
}