{
  "title": "Тачпад Synaptics",
  "url": "https://wiki.archlinux.org/title/%D0%A2%D0%B0%D1%87%D0%BF%D0%B0%D0%B4_Synaptics",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Xorg (Русский)\n\nЭта статья описывает установку и настройку Synaptics input driver для тачпадов Synaptics (и ALPS), установленных на многих ноутбуках.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Драйвер Synaptics можно установить с помощью пакета xf86-input-synaptics.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Основной способ конфигурации тачпада - через настройку файла сервера Xorg. После установки xf86-input-synaptics, файл с настройками по умолчанию находится в /usr/share/X11/xorg.conf.d/70-synaptics.conf. Пользователь может скопировать этот файл в /etc/X11/xorg.conf.d/ и отредактировать под своё специфичное устройство. Для получения списка всех доступных опций, необходимо обратиться к synaptics(4) man-руководства. Специфичные для текущей машины опции можно узнать с помощью #Synclient.\n\n"
    },
    {
      "title": "Часто используемые опции",
      "level": 3,
      "content": "Следующий листинг удовлетворит потребности большинства пользователей. При использовании данной конфигурации включается вертикальная, горизонтальная и круговая прокрутка:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier \"touchpad\"\n    Driver \"synaptics\"\n    MatchIsTouchpad \"on\"\n        Option \"TapButton1\" \"1\"\n        Option \"TapButton2\" \"3\"\n        Option \"TapButton3\" \"2\"\n        Option \"VertEdgeScroll\" \"on\"\n        Option \"VertTwoFingerScroll\" \"on\"\n        Option \"HorizEdgeScroll\" \"on\"\n        Option \"HorizTwoFingerScroll\" \"on\"\n        Option \"CircularScrolling\" \"on\"\n        Option \"CircScrollTrigger\" \"2\"\n        Option \"EmulateTwoFingerMinZ\" \"40\"\n        Option \"EmulateTwoFingerMinW\" \"8\"\n        Option \"CoastingSpeed\" \"0\"\n        Option \"FingerLow\" \"30\"\n        Option \"FingerHigh\" \"50\"\n        Option \"MaxTapTime\" \"125\"\n        ...\nEndSection\n```\n\nСинтаксис: Система будет думать, что это именно эта кнопка: (если ей соответствует код) код можно узнать с помощью команды xev.\n\n- TapButton1: (1) определяет клик одним пальцем как левую кнопку мыши\n- TapButton2: (3) определяет клик двумя пальцами как правую кнопку мыши\n- TapButton3: (2) определяет клик тремя пальцами как среднюю кнопку мыши\n- RBCornerButton: (целое число) определяет, какой кнопке мыши соответствует реакция на клик в правом нижнем углу тачпада (ислользуйте Option \"RBCornerButton\" \"3\" для имитации клика правой кнопки мыши при касании правого нижнего угла тачпада). См. man synaptics для назначения кнопок на другие углы.\n- RTCornerButton: (целое число) аналогично для правого верхнего угла\n- VertEdgeScroll: (on/0) включает вертикальную прокрутку при скольжении пальцем вдоль правого края тачпада.\n- HorizEdgeScroll: (on/0) включает горизонтальную прокрутку при скольжении пальцем вдоль нижнего края тачпада.\n- VertTwoFingerScroll: вертикальная прокрутка двумя пальцами\n- HorizTwoFingerScroll: горизонтальная прокрутка двумя пальцами\n- EmulateTwoFingerMinZ/W: (целое число) поиграйтесь с этими значениями, чтобы подобрать удобную для вас точность прокрутки двумя пальцами\n- FingerLow: (целое число) если давление пальцем падает ниже этого значения, драйвер считает это отпусканием\n- FingerHigh: (целое число) если давление пальцем поднимается выше этого значения, драйвер считает это касанием\n- MaxTapTime: Определяет, насколько «чётким» должно быть нажатие, чтобы его можно было считать настоящим. Уменьшите значение, чтобы нажатие было более чётким. Правильная настройка этого параметра может уменьшить количество ложных срабатываний, когда руки наведены или слегка касаются тачпада.\n- VertScrollDelta и HorizScrollDelta: (целое число) настраивает скорость прокрутки, это немного противоречит интуиции, потому что более высокие значения обеспечивают бо́льшую точность и, следовательно, более медленную прокрутку. Отрицательные значения вызывают естественную прокрутку, как в macOS.\n\n- Если вы внезапно обнаружили, что ваши руки касаются тачпада при печати текста и это вызывает нежелательное нажатие средней клавиши, то измените значение опции TapButton2 на 0, чтобы отключить ее. Смотрите также #Отключение тачпада во время печати.\n- В последних версиях включена по умолчанию автопрокрутка (\"Coasting\"), при котором прокрутка продолжается до следующего нажатия, даже если вы уже больше не касаетесь тачпада после начала прокрутки. То есть, если вам нужно прокрутить совсем чуть-чуть, вам придётся чуть-чуть прокрутить и почти сразу нажать на тачпад для остановки, иначе прокрутка будет вечной. Если вас не устраивает такое поведение, пропишите для настройки CoastingSpeed значение 0.\n- Если ваш тачпад слишком чувствительный, пропишите значения побольше для FingerLow и FingerHigh. Помните, что FingerLow должен быть меньше чем FingerHigh.\n\n"
    },
    {
      "title": "Конфигурирование \"на лету\"",
      "level": 3,
      "content": "Кроме традиционного, есть еще несколько способов конфигурирования. Драйвер Synaptics поддерживает изменение настроек \"на лету\". Это предполагает, что пользователи могут выбирать нужные им опции в приложении, которые вступят в силу немедленно, без перезапуска X. Это удобно для тестирование настроек перед прописыванием в файл конфигурации или в скрипт. Имейте в виду, что изменённые \"на лету\" настройки сбрасываются при перезапуске сервера Xorg.\n\n"
    },
    {
      "title": "Консольные инструменты",
      "level": 4,
      "content": "- Synclient — утилита командной строки для настройки и обращения к драйверам Synaptics.\n\n- xinput — инструмент общее назначения для настройки устройств ввода X.\n\n"
    },
    {
      "title": "Графические инструменты",
      "level": 4,
      "content": "- GPointing Device Settings — Предоставляет графическую конфигурацию \"на лету\" для нескольких указывающих устройств, подключенных к системе, в том числе Synaptics. Это приложение заменяет GSynaptics в качестве предпочтительного инструмента для настройки графической тачпада с помощью драйвера Synaptics.\n\n- kcm_touchpad — Новый инструмент настройки для KDE Plasma 5. Он предоставляет модуль под устройствами ввода в системных настройках. Он рассматривается как замена synaptiks и старого модуля kcm-touchpad.\n\n"
    },
    {
      "title": "Xfce4/Cinnamon",
      "level": 3,
      "content": "Для изменения настроек в XFCE 4:\n\n1. Откройте Диспетчер настроек.\n1. Нажмите Мышь и тачпад.\n1. Выберите ваш тачпад в списке устройств и измените настройки на вкладке Тачпад.\n\nДля изменения настроек в Cinnamon:\n\n1. Откройте Параметры системы.\n1. Нажмите Мышь и сенсорная панель.\n1. Измените настройки на вкладке Сенсорная панель.\n\n"
    },
    {
      "title": "MATE",
      "level": 3,
      "content": "Можно настроить способ, которым MATE обрабатывает тачпад:\n\n1. Запустите dconf-editor.\n1. Измените ключи в папке org.mate.desktop.peripherals.touchpad.\n\nВо избежание затирания настроек демоном Mate settings сделайте следующее:\n\n1. Запустите dconf-editor.\n1. Измените org.mate.SettingsDaemon.plugins.mouse.\n1. Отключите настройку active.\n\n"
    },
    {
      "title": "Использование xinput для определения возможностей тачпада",
      "level": 3,
      "content": "В зависимости от модели вашего тачпада, он может иметь или не иметь некоторые возможности. Можно определить поддерживаемые возможности с помощью xinput(1).\n\n- левая, средняя и правая аппаратные кнопки\n- обнаружение двух пальцев\n- обнаружение трёх пальцев\n- настраиваемое разрешение\n\nСперва найдите название вашего тачпада в списке устройств:\n\n```\n$ xinput list\n```\n\nЗатем, зная его имя, вы можете найти доступные возможности:\n\n```\n$ xinput list-props \"SynPS/2 Synaptics TouchPad\" | grep Capabilities\n```\n\n```\nSynaptics Capabilities (309):  1, 0, 1, 0, 0, 1, 1\n```\n\nЭти числа означают (слева направо):\n\n- 1: есть физическая левая кнопка\n- 0: нет физической средней кнопки\n- 1: есть физическая правая кнопка\n- 0: нет поддержки определения двух пальцев\n- 0: нет поддержки определения трёх пальцев\n- 1: можно настроить вертикальное разрешение\n- 1: можно настроить горизонтальное разрешение\n\nИспользуйте xinput list-props \"SynPS/2 Synaptics TouchPad\" для просмотра всех свойств. Полное описание всех свойств Synaptics можно почитать в synaptics(4).\n\n"
    },
    {
      "title": "Synclient",
      "level": 3,
      "content": "Synclient позволяет изменить любые доступные пользователю настройки, описанные в synaptics(4). Посмотреть полный список текущих пользовательских настроек можно так:\n\n```\n$ synclient -l\n```\n\nНапример:\n\n- Включение распознавания ладони:\n\n```\n$ synclient PalmDetect=1\n```\n\n- Настройка кликов (здесь клик правой кнопкой при нажатием двумя пальцами):\n\n```\n$ synclient TapButton2=3\n```\n\n- Отключение тачпада:\n\n```\n$ synclient TouchpadOff=1\n```\n\nПосле успешного тестирования опций с помощью synclient вы можете сделать эти изменения постоянными, записав их в /etc/X11/xorg.conf.d/70-synaptics.conf.\n\n"
    },
    {
      "title": "evtest",
      "level": 3,
      "content": "evtest показывает давление и положение пальцев на тачпаде в реальном времени, что позволяет дополнительно уточнить стандартные настройки Synaptics. Наблюдение с помощью evtest можно запустить так:\n\n```\n$ evtest /dev/input/eventX\n```\n\nГде X означает ID тачпада. Найти его можно выводе cat /proc/bus/input/devices.\n\nevtest требует монопольный доступ к устройству, что означает, что его нельзя запускать вместе с X-сервером. Вы можете либо убить X-сервер, либо запустить evtest с другого виртуального терминала (например, нажав Ctrl+Alt+F2).\n\n"
    },
    {
      "title": "xev",
      "level": 3,
      "content": "xorg-xev может показывать касания, клики, давление, положение и другие измерения в режиме реального времени, что позволяет ещё больше уточнить настройки Synaptics. xev может запускаться в X. С помощью параметра -event можно ограничить типы выводимых событий.\n\n"
    },
    {
      "title": "Круговая прокрутка",
      "level": 3,
      "content": "Круговая прокрутка — это удобство, предлагаемое вам synaptics, которое вы могли знать по iPod. Вместо (или, в придачу к) прокрутке по горизонтали или по вертикали, вы можете осуществлять прокрутку по кругу. Многие пользователи находят этот способ более быстрым и точным. Для включения круговой прокрутки добавьте следующие опции в секцию устройства ввода /etc/X11/xorg.conf.d/70-synaptics.conf:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    ...\n    Option      \"CircularScrolling\"          \"on\"\n    Option      \"CircScrollTrigger\"          \"0\"\n    ...\nEndSection\n```\n\nВы наверное догадались, что опция CircularScrolling включает или выключает круговую прокрутку. Опция CircScrollTrigger может принимать одно из следующих значений, определяющий с какой границы тачпада должна начинаться круговая прокрутка:\n\n```\n0    любая\n1    верхняя\n2    правый верхний угол\n3    правая\n4    правый нижний угол\n5    нижняя\n6    левый нижний угол\n7    левая\n8    левый верхний угол\n```\n\nЗадание этой опции отличной от нуля может быть полезным если вы хотите использовать круговую прокрутку совместно с горизонтальной и/или вертикальной прокруткой. В таком случае тип прокрутки будет определяться границей тачпада с которой вы её начинаете.\n\nДля быстрой прокрутки рисуйте маленькие круги в центре вашего тачпада. Для медленной и более точной прокрутки рисуйте большие.\n\n"
    },
    {
      "title": "Естественная прокрутка",
      "level": 3,
      "content": "Можно сделать естественную прокрутку (natural scrolling). Для этого просто укажите отрицательные значения в оциях VertScrollDelta и HorizScrollDelta:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    ...\n    Option      \"VertScrollDelta\"          \"-111\"\n    Option      \"HorizScrollDelta\"         \"-111\"\n    ...\nEndSection\n```\n\n"
    },
    {
      "title": "Программное переключение",
      "level": 3,
      "content": "Возможно, вы захотите включать и выключать тачпад простым нажатием кнопки или ярлыком. Это можно сделать, добавив сочетание клавиш для запуска следующего скрипта:\n\n```\n/usr/local/bin/touchpad_toggle.sh\n```\n\n```\n#!/bin/bash\n\ndeclare -i ID\nID=`xinput list | grep -Eio '(touchpad|glidepoint)\\s*id\\=[0-9]{1,2}' | grep -Eo '[0-9]{1,2}'`\ndeclare -i STATE\nSTATE=`xinput list-props $ID | grep 'Device Enabled' | awk '{print $4}'`\nif [ $STATE -eq 1 ]\nthen\n    xinput disable $ID\n    # echo \"Touchpad disabled.\"\n    # notify-send -a 'Touchpad' 'Disabled' -i input-touchpad\nelse\n    xinput enable $ID\n    # echo \"Touchpad enabled.\"\n    # notify-send -a 'Touchpad' 'Enabled' -i input-touchpad\nfi\n```\n\nТакже для отключения можно использовать synclient, но он отключает только касания, оставляя физические кнопки работающими:\n\n```\n/usr/local/bin/touchpad.sh\n```\n\n```\n#!/bin/bash\n\nsynclient TouchpadOff=$(synclient -l | grep -c 'TouchpadOff.*=.*0')\n```\n\n"
    },
    {
      "title": "Используя автоматическое определение ладони драйвером",
      "level": 4,
      "content": "Прежде всего проверьте, правильно ли он работает с вашим тачпадом и правильны ли настройки. Включите обнаружение ладони с помощью\n\n```\n$ synclient PalmDetect=1\n```\n\nЗатем попечатайте что-нибудь. Вы можете настроить определение, установив минимальную ширину касания, которое будет считаться ладонью, например:\n\n```\n$ synclient PalmMinWidth=8\n```\n\nЕщё можно настроить минимальное давление, необходимое для того, чтобы касание считалось ладонью, например:\n\n```\n$ synclient PalmMinZ=100\n```\n\nПосле подбора наилучших значений запишите их в файл конфигурации:\n\n```\nOption \"PalmDetect\" \"1\"\nOption \"PalmMinWidth\" \"8\"\nOption \"PalmMinZ\" \"100\"\n```\n\n"
    },
    {
      "title": "Используя syndaemon",
      "level": 4,
      "content": "syndaemon(1) отслеживает активность клавиатуры и отключает тачпад во время печати. У него есть несколько опций, чтобы контролировать, когда происходит отключение. Посмотреть их можно командой\n\n```\n$ syndaemon -h\n```\n\nНапример, чтобы отключить касание и прокрутку на полсекунды после каждого нажатия клавиши (без учёта клавиш-модификаторов вроде Ctrl), используйте\n\n```\n$ syndaemon -i 0.5 -t -K -R\n```\n\nПосле определения нужных вам параметров используйте менеджер входа или xinitrc, чтобы он запускался автоматически при запуске X. Параметр -d заставит его запускаться в фоновом режиме как демон.\n\n"
    },
    {
      "title": "Отключение тачпада при подключенной мыши",
      "level": 3,
      "content": "При помощи udev можно автоматически отключать тачпад при подключении внешней мыши. Для этого используйте одно из приведённых ниже правил.\n\n"
    },
    {
      "title": "Базовый рабочий стол",
      "level": 4,
      "content": "Это базовое правило для сеансов, не использующих среду рабочего стола:\n\n```\n/etc/udev/rules.d/01-touchpad.rules\n```\n\n```\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]*\", ACTION==\"add\", ENV{DISPLAY}=\":0\", ENV{XAUTHORITY}=\"/home/пользователь/.Xauthority\", RUN+=\"/usr/bin/synclient TouchpadOff=1\"\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]*\", ACTION==\"remove\", ENV{DISPLAY}=\":0\", ENV{XAUTHORITY}=\"/home/пользователь/.Xauthority\", RUN+=\"/usr/bin/synclient TouchpadOff=0\"\n```\n\nЕсли тачпад всегда отключается при запуске, даже если мышь не подключена, попробуйте добавить следующие критерии между параметрами KERNEL и ACTION:\n\n```\nATTRS{name}!=\"*TouchPad\", ATTRS{name}!=\"*Stick\",\n```\n\n"
    },
    {
      "title": "GDM",
      "level": 4,
      "content": "GDM обычно хранит файлы Xauthority в /var/run/gdm в подкаталоге со случайным именем. Вы должны найти свой фактический путь к файлу Xauthority, что можно сделать с помощью ps ax. По какой-то причине у пользователя может появиться несколько authority файлов, поэтому потребуется такое правило:\n\n```\n/etc/udev/rules.d/01-touchpad.rules\n```\n\n```\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]\", ACTION==\"add\", PROGRAM=\"/usr/bin/find /var/run/gdm -name пользователь -print0 -quit\", ENV{DISPLAY}=\":0\", ENV{XAUTHORITY}=\"$result/database\", RUN+=\"/usr/bin/synclient TouchpadOff=1\"\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]\", ACTION==\"remove\", PROGRAM=\"/usr/bin/find /var/run/gdm -name пользователь -print0 -quit\", ENV{DISPLAY}=\":0\", ENV{XAUTHORITY}=\"$result/database\", RUN+=\"/usr/bin/synclient TouchpadOff=0\"\n```\n\nКроме того, вы должны убедиться, что ваш скрипт udev работает правильно. Вы можете проверить условия, запустив udevadm monitor -p с правами root.\n\nsyndaemon, запущенный пользователем или средой рабочего стола, может конфликтовать с synclient, и его необходимо отключить. Понадобится такое правило:\n\n```\n/etc/udev/rules.d/01-touchpad.rules\n```\n\n```\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]\", ACTION==\"add\", PROGRAM=\"/usr/bin/find /var/run/gdm -name пользователь -print -quit\", ENV{DISPLAY}=\":0\", ENV{XAUTHORITY}=\"$result/database\", RUN+=\"/bin/sh -c '/usr/bin/synclient TouchpadOff=1 ; sleep 1; /bin/killall syndaemon; '\"\n```\n\nПакет touchpad-state-gitAUR сделан с использованием правил udev, описанных в разделе #С запущенным syndaemon. Он включает в себя правило udev и скрипт:\n\n```\ntouchpad-state [--off] [--on]\n```\n\n"
    },
    {
      "title": "GNOME",
      "level": 4,
      "content": "Пользователи GNOME могут установить расширение Touchpad Indicator, изменить Switch Method на Synclient и включить настройку Automatically switch Touchpad On/Off.\n\n"
    },
    {
      "title": "KDE",
      "level": 4,
      "content": "Можно использовать plasma-desktop для управления тачпадом.\n\n"
    },
    {
      "title": "Система с несколькими сеансами X",
      "level": 4,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nВ окружении с несколькими пользователями нужен немного другой подход для определения среды X текущих пользователей. Поможет этот скрипт:\n\n```\n/usr/bin/mouse-pnp-event-handler.sh\n```\n\n```\n#!/bin/sh\n## $1 = \"add\" / \"remove\"\n## $2 = %k from udev\n\n## Set TRACKPAD_NAME according to your configuration.\n## Check your trackpad name with:\n## find /sys/class/input/ -name mouse* -exec udevadm info -a {} \\; | grep 'ATTRS{name}'\nTRACKPAD_NAME=\"SynPS/2 Synaptics TouchPad\"\n\nUSERLIST=$(w -h | cut -d' ' -f1 | sort | uniq)\nMOUSELIST=$(find /sys/class/input/ -name mouse*)\n\nfor CUR_USER in ${USERLIST}; do\n        CUR_USER_XAUTH=\"$(sudo -Hiu ${CUR_USER} env | grep -e \"^HOME=\" | cut -d'=' -f2)/.Xauthority\"\n\n        ## Can't find a way to get another users DISPLAY variable from an isolated root environment. Have to set it manually.\n        #CUR_USER_DISPL=\"$(sudo -Hiu ${CUR_USER} env | grep -e \"^DISPLAY=\" | cut -d'=' -f2)\"\n        CUR_USER_DISPL=\":0\"\n\n        export XAUTHORITY=\"${CUR_USER_XAUTH}\"\n        export DISPLAY=\"${CUR_USER_DISPL}\"\n\n        if [ -f \"${CUR_USER_XAUTH}\" ]; then\n                case \"$1\" in\n                        \"add\")\n                                /usr/bin/synclient TouchpadOff=1\n                                /usr/bin/logger \"USB mouse plugged. Disabling touchpad for $CUR_USER. ($XAUTHORITY - $DISPLAY)\"\n                        ;;\n                        \"remove\")\n                                ## Only execute synclient if there are no external USB mice connected to the system.\n                                EXT_MOUSE_FOUND=\"0\"\n                                for CUR_MOUSE in ${MOUSELIST}; do\n                                        if [ \"$(cat ${CUR_MOUSE}/device/name)\" != \"${TRACKPAD_NAME}\" ]; then\n                                                EXT_MOUSE_FOUND=\"1\"\n                                        fi\n                                done\n                                if [ \"${EXT_MOUSE_FOUND}\" == \"0\" ]; then\n                                        /usr/bin/synclient TouchpadOff=0\n                                        /usr/bin/logger \"No additional external mice found. Enabling touchpad for $CUR_USER.\"\n                                else\n                                        logger \"Additional external mice found. Won't enable touchpad yet for $CUR_USER.\"\n                                fi\n                        ;;\n                esac\n        fi\ndone\n```\n\nИзмените переменную TRACKPAD_NAME в соответствии с конфигурацией вашей системы. Запустите find /sys/class/input/ -name mouse* -exec udevadm info -a {} \\; | grep 'ATTRS{name}' для получения списка имён мышей.\n\nЗатем можно запускать этот скрипт при подключении или отключении USB-мышей с помощью такого правила udev:\n\n```\n/etc/udev/rules.d/01-touchpad.rules\n```\n\n```\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]*\", ACTION==\"add\", RUN+=\"/usr/bin/mouse-pnp-event-handler.sh add %k\"\nSUBSYSTEM==\"input\", KERNEL==\"mouse[0-9]*\", ACTION==\"remove\", RUN+=\"/usr/bin/mouse-pnp-event-handler.sh remove %k\"\n```\n\n"
    },
    {
      "title": "Тачпады без кнопок (кликпады)",
      "level": 3,
      "content": "Всё больше ноутбуков имеют особый вид тачпада, в котором есть одна кнопка, являющаяся частью площади отслеживания, а не отдельными кнопками. Например, в 2015 Dell XPS 13, HP series 4500 ProBooks, ThinkPad X220 и X1 ThinkPad есть такой тачпад. По умолчанию вся область кнопки определяется как левая кнопка, поэтому функции нажатия правой и средней кнопкой мыши и нажатие+перетаскивание не работают. Можно определить нажатия двумя и тремя пальцами как нажатия правой и средней кнопки и/или определить части поверхности панели управления как правая и средняя кнопки. Обратите внимание, что хотя драйвер регистрирует несколько касаний, он не отслеживает отдельные пальцы (начиная с версии 1.7.1), что приводит к запутанному поведению при использовании физических кнопок тачпада для перетаскивания и других жестов: вы должны щелкать с помощью двумя или тремя пальцами, но затем двигайте только одним из них, удерживая кнопку другим. Вы можете заглянуть в драйвер xf86-input-mtrackAUR для лучшей поддержки мультитач.\n\nНекоторые среды рабочего стола (по крайней мере, KDE и GNOME) определяют разумные и полезные конфигурации по умолчанию для кликпадов, предоставляя правую кнопку в правом нижнем углу панели, распознавая нажатия двумя и тремя пальцами в любом месте панели как правые и средние нажатия и обеспечивая параметры конфигурации для определения касаний двумя и тремя пальцами как правого и среднего щелчка. Если ваш рабочий стол этого не делает или если вам нужен больший контроль, вы можете изменить раздел тачпада в /etc/X11/xorg.conf.d/70-synaptics.conf (или, что лучше, в отдельном файле с бо́льшим номером префикса). Например:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier \"touchpad\"\n    Driver \"synaptics\"\n    MatchIsTouchpad \"on\"\n        # Enable clickpad/multitouch support\n        Option \"ClickPad\" \"true\"\n        # Middle-button emulation is not supported\n        Option \"EmulateMidButtonTime\" \"0\"\n        # Define right soft button at the bottom\n        Option \"SoftButtonAreas\"  \"50% 0 82% 0 0 0 0 0\"\nEndSection\n```\n\nФормат опции SoftButtonAreas такой (как описано в synaptics(4)):\n\n```\nRightButtonAreaLeft RightButtonAreaRight RightButtonAreaTop RightButtonAreaBottom MiddleButtonAreaLeft MiddleButtonAreaRight MiddleButtonAreaTop MiddleButtonAreaBottom\n```\n\nЭта опция обычно встречается в документации или пакетах synaptics, и в данном примере она определяет правую половину нижних 18% тачпада как правую кнопку. Средняя кнопка не определена. Если вы хотите определить среднюю кнопку, запомните одну ключевую информацию из руководства; край, установленный на 0, простирается до бесконечности в этом направлении.\n\nВ следующем примере правая кнопка будет занимать крайние правые 40% области кнопок, а средняя кнопка - 20% в центре. Крайние левые 40% остаются левой кнопкой (как и остальная часть тачпада):\n\n```\n...\nOption     \"SoftButtonAreas\"  \"60% 0 82% 0 40% 59% 82% 0\"\n...\n```\n\nМожно использовать synclient для проверки областей кнопок:\n\n```\n$ synclient -l | grep -i ButtonArea\n```\n\n```\nRightButtonAreaLeft     = 3914\n        RightButtonAreaRight    = 0\n        RightButtonAreaTop      = 3918\n        RightButtonAreaBottom   = 0\n        MiddleButtonAreaLeft    = 3100\n        MiddleButtonAreaRight   = 3873\n        MiddleButtonAreaTop     = 3918\n        MiddleButtonAreaBottom  = 0\n```\n\nЕсли кнопки не работают и области кнопок не меняются, убедитесь, что у вас нет файла конфигурации synaptics, распространяемого каким-нибудь пакетом, который переопределяет ваши настройки (например, некоторые пакеты AUR распространяют конфигурации с очень большими числами в префиксе).\n\nЭти настройки нельзя изменить на лету через synclient, но можно через xinput:\n\n```\nxinput set-prop \"SynPS/2 Synaptics TouchPad\" \"Synaptics Soft Button Areas\" 4000 0 4063 0 3000 4000 4063 0\n```\n\nОднако xinput не использует проценты, поэтому смотрите диапазоны x и y вашего тачпада в файле /var/log/Xorg.0.log.\n\n"
    },
    {
      "title": "Исправление нижнего края",
      "level": 4,
      "content": "В некоторых случаях, например, в Toshiba Satellite P50, всё работает «из коробки», за исключением того, что часто ваш щелчок воспринимается как движение мыши, а курсор отпрыгивает непосредственно перед регистрацией щелчка. Это легко решить, запустив\n\n```\n$ synclient -l | grep BottomEdge\n```\n\nвозьмите значение BottomEdge и вычтите желаемую высоту вашей кнопки, затем временно примените:\n\n```\n$ synclient AreaBottomEdge=4000\n```\n\nпосле подбора хорошего значения запишите его в файл конфигурации:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\n...\nOption \"AreaBottomEdge\"         \"4000\"\n...\n```\n\nNote: **начинается** \n\n"
    },
    {
      "title": "Тачпад не работает после выхода из ждущего/спящего режима",
      "level": 3,
      "content": "Иногда тачпады перестают работать при выходе из ждущего или спящего режима. Часто это можно исправить без перезагрузки с помощью\n\n- перехода на консоль и обратно,\n- повторного входа/выхода в ждущий/спящий режим, или\n- поиска нужного модуля ядра, его выгрузки и повторной загрузки.\n- занесения модуля ядра psmouse в чёрный список может быть постоянной опцией (если тачпад обрабатывается другим модулем, например i2c_designware_platform)\n- добавления параметра ядра psmouse.synaptics_intertouch=0, который может решить проблему навсегда (проверено на T440s)\n\n```\nmodprobe -r psmouse #psmouse happens to be the kernel module for my touchpad (Alps DualPoint)\nmodprobe psmouse\n```\n\nТеперь переключитесь обратно на tty, на котором работает X. Если вы выбрали правильный модуль, тачпад должен снова заработать.\n\nЕсли у вас ноутбук и тачпад не работает после закрытия крышки ноутбука, можно просто изменить политику управления питанием: при закрытии крышки настроить выключение экрана место ждущего/спящего режима. Это полезно для некоторых ноутбуков.\n\n"
    },
    {
      "title": "Настройки из xorg.conf.d/70-synaptics.conf не применяются в MATE",
      "level": 3,
      "content": "По умолчанию MATE прописывает свои настройки для тачпада. Чтобы отключить это, смотрите #MATE.\n\n"
    },
    {
      "title": "Тачпад не работает, Xorg.0.log пишет \"Query no Synaptics: 6003C8\"",
      "level": 3,
      "content": "Из-за способа настройки Synaptics в настоящее время загружаются 2 экземпляра модуля Synaptics. Мы можем распознать эту ситуацию, открыв файл журнала xorg (/var/log/Xorg.0.log) и обнаружив в нём это:\n\n```\n/var/log/Xorg.0.log\n```\n\n```\n[ 9304.803] (**) SynPS/2 Synaptics TouchPad: Applying InputClass \"evdev touchpad catchall\"\n[ 9304.803] (**) SynPS/2 Synaptics TouchPad: Applying InputClass \"touchpad catchall\"\n```\n\nПредотвратить двойную загрузку можно добавлением MatchDevicePath \"/dev/input/event*\" в файл /etc/X11/xorg.conf.d/70-synaptics.conf:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier \"touchpad catchall\"\n    Driver \"synaptics\"\n    MatchIsTouchpad \"on\"\n    MatchDevicePath \"/dev/input/event*\"\n        Option \"TapButton1\" \"1\"\n        Option \"TapButton2\" \"2\"\n        Option \"TapButton3\" \"3\"\nEndSection\n```\n\nПерезапустите X и проверьте журнал Xorg ещё раз, ошибка должна пропасть и тачпад должен заработать.\n\nСвязанное сообщение об ошибке: FS#20830\n\nСвязанные темы на форуме:\n\n- https://bbs.archlinux.org/viewtopic.php?id=104769\n- https://bbs.archlinux.org/viewtopic.php?pid=825690\n\n"
    },
    {
      "title": "Тачпад определяется как \"PS/2 Generic Mouse\" или \"Logitech PS/2 mouse\"",
      "level": 3,
      "content": "Это может быть вызвано разными причинами.\n\n"
    },
    {
      "title": "Ноутбуки с сенсорным экраном и тачпадом",
      "level": 4,
      "content": "Есть проблема с ноутбуками, которые имеют как сенсорный экран, так и тачпад, например, Dell XPS 12 или Dell XPS 13. Чтобы исправить это, вы можете запретить загрузку драйверв i2c_hid, Однако это даёт побочный эффект — отключение сенсорного экрана.\n\nЭто известная проблема. Смотрите также эту тему на форуме.\n\nНачиная с версии ядра 3.15, запрет загрузки модуля может привести к полной неработоспособности тачпада. Удаление запрета должно позволить этому начать работу с ограниченной функциональностью, смотрите FS#40921.\n\n"
    },
    {
      "title": "Не работают специальные возможности Synaptics (множественное нажатие, прокрутка и т. д.)",
      "level": 3,
      "content": "Иногда тачпады Synaptics работают только частично. Такие функции, как прокрутка двумя пальцами или нажатие средней кнопки двумя пальцами, не работают, даже если они включены должным образом. Вероятно, это связано с упомянутой выше проблемой #Тачпад не работает, Xorg.0.log пишет \"Query no Synaptics: 6003C8\". Исправляется аналогично, предотвращением двойной загрузки модуля.\n\nЕсли это не поможет, попробуйте закомментировать опцию MatchIsTouchpad (которая теперь включена по умолчанию в конфигурацию Synaptics).\n\n"
    },
    {
      "title": "Нет мультитача на некоторых тачпадах Elantech",
      "level": 4,
      "content": "Смотрите https://unix.stackexchange.com/questions/28736/what-does-the-i8042-nomux-1-kernel-option-do-during-booting-of-ubuntu\n\n"
    },
    {
      "title": "Курсор прыгает",
      "level": 3,
      "content": "У некоторых пользователей курсор необъяснимо прыгает по экрану. В настоящее время для этого нет патча, но разработчики знают о проблеме и работают над ней.\n\nТакже возможно, что вы испытываете IRQ losses, что связано с контроллером i8042 (это устройство управляет клавиатурой и тачпадом многих ноутбуков), поэтому здесь у вас есть две возможности:\n\n1. Сделать rmmod && insmod для модуля psmouse.\n1. Добавить i8042.nomux=1 в параметры ядра и перезагрузить систему.\n\n"
    },
    {
      "title": "Мой тачпад отсутствует в /dev/input/*",
      "level": 3,
      "content": "В этом случае вы можете посмотреть информацию по всем вашим устройствам ввода следующей командой:\n\n```\ncat /proc/bus/input/devices\n```\n\nНайдите устройство с именем \"SynPS/2 Synaptics TouchPad\". Вам нужно смотреть на параметр Handler, который подскажет вам какое устройство нужно указать в xorg.conf.\n\nПример вывода:\n\n```\nI: Bus=0011 Vendor=0002 Product=0007 Version=0000\nN: Name=\"SynPS/2 Synaptics TouchPad\"\nP: Phys=isa0060/serio4/input0\nS: Sysfs=/class/input/input1\nH: Handlers=mouse0 event1 \nB: EV=b\nB: KEY=6420 0 7000f 0\n```\n\nТ.к. выши Handler'ы mouse0 и event1, вам нужно использовать /dev/input/mouse0.\n\n"
    },
    {
      "title": "Firefox и специальные события тачпада",
      "level": 3,
      "content": "Вы можете включить/отключить некоторые специальные события, которые Firefox обрабатывает при касании или прокрутке определённых частей тачпада, отредактировав настройки этих действий. Введите about:config в адресную строку Firefox. Чтобы изменить параметры, дважды щёлкните нужную строку.\n\n"
    },
    {
      "title": "Firefox 17.0 и новее",
      "level": 4,
      "content": "Горизонтальная прокрутка теперь по умолчанию будет прокручивать страницы, а не историю. Чтобы включить переход вперёд/назад в стиле Mac с проведением двумя пальцами, измените параметр:\n\n```\nmousewheel.default.action.override_x = 2\n```\n\nВы можете столкнуться со случайным переключением вперёд/назад при вертикальной прокрутке. Чтобы изменить чувствительность Firefox к горизонтальному движению, измените параметр:\n\n```\nmousewheel.default.delta_multiplier_x\n```\n\nОптимальное значение будет зависеть от вашего тачпада и от того, как вы его используете. Попробуйте начать со значения 10. Отрицательное значение изменит направление на противоположное.\n\n"
    },
    {
      "title": "Прокрутка и множественные действия с Synaptics на ноутбуках LG",
      "level": 3,
      "content": "Эти проблемы, похоже, возникают на нескольких моделях ноутбуков LG. Симптомы включают: при нажатии Mouse Button 1 Synaptics интерпретирует это как ScrollUP и как button 1 click; То же самое и с button 2.\n\nЭто можно решить добавлением в xorg.conf:\n\n```\n/etc/X11/xorg.conf.d/xorg.conf\n```\n\n```\nOption \"UpDownScrolling\" \"0\"\n```\n\nПо-видимому, скомпилировать это с последней версией Synaptics не удается. Решением этой проблемы является использование Git-версии Synaptics [5].\n\nЧтобы собрать пакет после загрузки и распаковки tar-архива, выполните:\n\n```\n$ cd synaptics-git\n$ makepkg\n```\n\n"
    },
    {
      "title": "Другие проблемы с внешней мышью",
      "level": 3,
      "content": "Во-первых, убедитесь, что ваш раздел, описывающий внешнюю мышь, содержит эту строку (или что она выглядит так):\n\n```\n/etc/X11/xorg.conf.d/xorg.conf\n```\n\n```\nOption     \"Device\" \"/dev/input/mice\"\n```\n\nЕсли строка \"Device\" отличается, измените её на указанную выше и попробуйте перезапустить X. Если это не решит вашу проблему, сделайте свой тачпад CorePointer в разделе \"Server Layout\":\n\n```\n/etc/X11/xorg.conf.d/xorg.conf\n```\n\n```\nInputDevice    \"Touchpad\" \"CorePointer\"\n```\n\nИ сделайте внешнее устройство \"SendCoreEvents\":\n\n```\n/etc/X11/xorg.conf.d/xorg.conf\n```\n\n```\nInputDevice    \"USB Mouse\" \"SendCoreEvents\"\n```\n\nНаконец, добавьте это в раздел вашего внешнего устройства:\n\n```\n/etc/X11/xorg.conf.d/xorg.conf\n```\n\n```\nOption      \"SendCoreEvents\"    \"true\"\n```\n\nЕсли ничего из этого не работает, проверьте соответствующие баг-трекеры на предмет возможных ошибок или просмотрите форумы, чтобы узнать, нашёл ли кто-нибудь решение получше.\n\n"
    },
    {
      "title": "Перестаёт работать мультитач после перезагрузки в Windows",
      "level": 3,
      "content": "Многие драйверы содержат прошивку, которая загружается во флэш-память при загрузке компьютера. Эта прошивка не обязательно очищается при завершении работы и не всегда совместима с драйверами Linux. Единственный способ очистить флэш-память — это полностью выключить компьютер, а не использовать перезагрузку. Обычно считается лучшей практикой никогда не использовать перезагрузку при переключении между операционными системами.\n\n"
    },
    {
      "title": "Тачпад не определяется после выключения в Arch",
      "level": 3,
      "content": "Некоторые тачпады (в частности Elantech) перестают определяться после стандартного завершения работы в Arch Linux. Есть несколько возможных решений этой проблемы:\n\n- Загрузиться с раздела или установочного диска Windows и выключить компьютер через него.\n- Подождать примерно минуту после выключения.\n- Как обсуждалось в https://bugzilla.kernel.org/show_bug.cgi?id=81331#c186 в ядро был добавлен патч, который исправляет работу тачпадов Elantech. По умолчанию поддерживаются модели Gigabyte P34, P35v2 и X3. Для других (особенно ребрендингов Gigabyte, вроде XMG) можно прописать параметр ядра i8042.kbdreset=1.\n\n"
    },
    {
      "title": "Trackpoint и кликпады",
      "level": 3,
      "content": "В новых моделях Thinkpad больше нет физических кнопок для тензометрических джойстиков (Trackpoint) и вместо них под кнопки выделена верхняя часть кликпада. Помимо эргономики, это неплохо работает с текущим Xorg. К сожалению, эмуляция колеса мыши с помощью средней кнопки пока не поддерживается. Установите xf86-input-evdev-trackpointAUR для исправленной и правильно настроенной версии, если вы собираетесь использовать Trackpoint.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Synaptics touchpad driver\n- Synaptics manual on x.org\n\n"
    }
  ]
}