{
  "title": "Твердотельные накопители",
  "url": "https://wiki.archlinux.org/title/%D0%A2%D0%B2%D0%B5%D1%80%D0%B4%D0%BE%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D0%B5_%D0%BD%D0%B0%D0%BA%D0%BE%D0%BF%D0%B8%D1%82%D0%B5%D0%BB%D0%B8",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Solid state drive/NVMe\n- Очистка ячеек памяти SSD\n- Benchmarking (Русский)\n- Увеличение производительности#Устройства хранения\n\nВ этой статье рассматриваются особенности работы с твердотельными накопителями (SSD) и другими устройствами хранения данных на основе флэш-памяти. Если вы хотите разбить SSD на разделы для конкретной цели, возможно, стоит изучить список файловых систем, оптимизированных для флеш-памяти. Для обычного использования можно использовать любую предпочитаемую вами файловую систему.\n\n"
    },
    {
      "title": "TRIM",
      "level": 3,
      "content": "Большинство твердотельных накопителей поддерживает команду ATA_TRIM для обеспечения стабильной долгосрочной производительности и выравнивания износа. Статья на TechSpot приводит сравнение производительности до и после заполнения SSD данными.\n\nНачиная с версии 3.8 ядра Linux, поддержка TRIM постоянно добавлялась для различных файловых систем. Ориентировочный обзор приведён в следующей таблице:\n\nTable content:\nFile system | Непрерывный TRIM (опция discard) | Периодический TRIM (fstrim) | Ссылки и примечания\nBtrfs | Да | Да | \nexFAT | Да | Да | fstrim поддерживается с версии ядра 5.13, [1]\next3 | Да | Да | \next4 | Да | Да | \"discard, nodiscard(*)\" в [2]\nF2FS | Да | Да | \nJFS | Да | Да | [3]\nNILFS2 | Да | Да | \nNTFS-3G | Нет | Да | с версии 2015.3.14, [4]\nVFAT | Да | Да | fstrim поддерживается с версии ядра 4.19, [5]\nXFS | Да | Да | [6]\n\nПроверить поддержку TRIM можно с помощью команды:\n\n```\n$ lsblk --discard\n```\n\nПроверьте значения столбцов DISC-GRAN (discard granularity) и DISC-MAX (discard max bytes). Ненулевые значения означают поддержку TRIM.\n\nДругой вариант — установить пакет hdparm и выполнить команду:\n\n```\n# hdparm -I /dev/sda | grep TRIM\n```\n\n```\n*    Data Set Management TRIM supported (limit 1 block)\n```\n\n"
    },
    {
      "title": "Периодический TRIM",
      "level": 4,
      "content": "Пакет util-linux предоставляет systemd-службу fstrim.service, а также таймер fstrim.timer, который вы можете включить. Он настроен на еженедельное включение службы. Служба выполняет fstrim(8) на всех смонтированных файловых системах на устройствах, поддерживающих операцию discard.\n\nТаймер полагается на метку времени /var/lib/systemd/timers/stamp-fstrim.timer (которую он создаст при первом запуске), чтобы проверять, прошла ли неделя с момента его последнего запуска. Поэтому нет необходимости беспокоиться о слишком частых вызовах, как это бывает с anacron.\n\nПосмотреть статус юнитов можно в журнале. Чтобы изменить периодичность таймера или выполнения команд, отредактируйте файлы юнитов.\n\n"
    },
    {
      "title": "Непрерывный TRIM",
      "level": 4,
      "content": "Вместо того чтобы выдавать команды TRIM время от времени (по умолчанию раз в неделю при использовании fstrim.timer), можно также выдавать команды TRIM при каждом удалении файлов. Этот вариант известен как непрерывный TRIM.\n\nИспользование опции монтирования discard в /etc/fstab включает непрерывный TRIM в операциях с устройствами:\n\n```\n/dev/sda1  /           ext4  defaults,discard   0  1\n```\n\nВ файловой системе ext4 флаг discard также может быть установлен как опция монтирования по умолчанию с помощью tune2fs:\n\n```\n# tune2fs -o discard /dev/sdXY\n```\n\nИспользование опций монтирования по умолчанию вместо записи в /etc/fstab особенно полезно для внешних дисков, поскольку такой раздел будет монтироваться с опциями по умолчанию и на других машинах. Таким образом, нет необходимости редактировать /etc/fstab на каждой машине.\n\n"
    },
    {
      "title": "Выполнение TRIM на устройстве целиком",
      "level": 4,
      "content": "Если вы хотите очистить сразу весь SSD, например, перед новой установкой или продажей диска, можно использовать команду blkdiscard.\n\n"
    },
    {
      "title": "LVM",
      "level": 4,
      "content": "Запросы TRIM, передаваемые из файловой системы на логический том, автоматически передаются на физические томы. Дополнительная настройка не требуется.\n\nПо умолчанию ни одна операция LVM (lvremove, lvreduce и все остальные) не отправляет запросы TRIM на физические томы. Это сделано для того, чтобы можно было восстановить предыдущую конфигурацию группы томов с помощью vgcfgrestore(8). Параметр issue_discards в /etc/lvm/lvm.conf управляет тем, посылаются ли запросы TRIM на физические тома, лежащие в основе логического тома, когда логический том больше не использует пространство физических томов.\n\n"
    },
    {
      "title": "dm-crypt",
      "level": 4,
      "content": "- Debian:SSDOptimization#Mounting SSD filesystems\n- dm-crypt/Specialties#Discard/TRIM support for solid state drives (SSD)\n\nДля некорневых файловых систем добавьте опцию discard в файле /etc/crypttab для зашифрованных блочных устройств, расположенных на SSD (смотрите dm-crypt/System configuration#crypttab).\n\nДля корневой файловой системы следуйте инструкциям из раздела dm-crypt/Specialties#Discard/TRIM support for solid state drives (SSD), чтобы добавить нужный параметр ядра в конфигурацию загрузчика.\n\n"
    },
    {
      "title": "Максимизация производительности",
      "level": 3,
      "content": "Следуйте советам из раздела Увеличение производительности#Устройства хранения, чтобы максимально увеличить производительность дисков.\n\n"
    },
    {
      "title": "Размер сектора",
      "level": 4,
      "content": "Смотрите Advanced Format#NVMe solid state drives.\n\n"
    },
    {
      "title": "Очистка ячеек памяти SSD",
      "level": 4,
      "content": "Можно полностью сбросить ячейки SSD до начального состояния, восстановив таким образом заводскую производительность записи. Известно, что производительность записи со временем снижается даже на SSD со встроенной поддержкой TRIM: он работает только при удалении файлов, но не при замене, например, инкрементном сохранении.\n\nСброс можно выполнить, следуя соответствующей процедуре, описанной в статье Очистка ячеек памяти SSD, для #SATA или #NVMe.\n\n"
    },
    {
      "title": "Hdparm показывает состояние \"frozen\"",
      "level": 4,
      "content": "Прошивки некоторых материнских плат отправляют команду «security freeze» SATA-устройствам при инициализации. Аналогичным образом, прошивки некоторых SSD (и HDD) переходят в состояние «security freeze» уже с завода. В обоих случаях параметры безопасности пароля устройства устанавливаются в состояние frozen:\n\n```\n# hdparm -I /dev/sda\n```\n\n```\nSecurity: \n \tMaster password revision code = 65534\n \t\tsupported\n \tnot\tenabled\n \tnot\tlocked\n \t\tfrozen\n \tnot\texpired: security count\n \t\tsupported: enhanced erase\n \t4min for SECURITY ERASE UNIT. 2min for ENHANCED SECURITY ERASE UNIT.\n```\n\nНа операции вроде форматирования или установки операционной системы это не влияет.\n\nПриведённый выше вывод показывает, что устройство не заблокировано паролем HDD при загрузке (not locked), а состояние frozen защищает устройство от вредоносных программ, которые могут попытаться заблокировать его, установив на него пароль во время работы.\n\nЕсли вы хотите установить пароль на устройство в состоянии «frozen», необходимо, чтобы BIOS материнской платы поддерживал эту функцию. Многие ноутбуки имеют такую поддержку, поскольку она требуется для аппаратного шифрования, но поддержка может оказаться нетривиальной для настольных/серверных плат. Например, в материнской плате Intel DH67CL/BL для доступа к настройкам необходимо перевести её в «режим обслуживания» с помощью физической перемычки ([10], [11]).\n\nЕсли вы собираетесь стереть SSD, смотрите статьи Securely wipe disk#hdparm и Очистка ячеек памяти SSD.\n\nПосле возвращения из ждущего режима SSD обычно теряет состояние «frozen», что делает его уязвимым для команд ATA SECURE ERASE, подобных тем, что описаны в статье Очистка ячеек памяти SSD.\n\nЧтобы предотвратить эту проблему, можно запустить скрипт после пробуждения от сна:\n\n```\n/usr/lib/systemd/system-sleep/ssd-freeze.sh\n```\n\n```\n#!/bin/sh\nif [ \"$1\" = 'post' ]; then\n\tsleep 1\n\tif hdparm --security-freeze /dev/disk/by-id/ata-name-of-disk; then\n\t\tlogger \"$0: SSD freeze command executed successfully\"\n\telse\n\t\tlogger \"$0: SSD freeze command failed\"\n\tfi\t\nfi\n```\n\n"
    },
    {
      "title": "Аппаратное шифрование",
      "level": 4,
      "content": "Как отмечалось в разделе #Hdparm показывает состояние \"frozen\", установка пароля для устройства хранения данных (SSD/HDD) в BIOS может также инициализировать аппаратное шифрование поддерживающих его устройств. Если устройство также соответствует стандарту OPAL, это может быть достигнуто и без соответствующей функции BIOS для установки парольной фразы; смотрите статью Self-encrypting drives.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Возможно, что проблема, с которой вы столкнулись, является ошибкой прошивки, не связанной с Linux, поэтому прежде чем пытаться устранить проблему, затрагивающую SSD-устройство, сначала проверьте, доступны ли обновления для:\n\n- Прошивки SSD\n- Прошивки BIOS/UEFI материнской платы\n\nДаже если это ошибка прошивки, ее можно избежать, поэтому если обновления прошивки нет или вы не решаетесь обновить прошивку, вам может помочь следующее.\n\n"
    },
    {
      "title": "Решение ошибок NCQ",
      "level": 3,
      "content": "Некоторые SSD и чипсеты SATA не работают должным образом с Linux Native Command Queueing (NCQ). Характерные ошибки выглядят в dmesg следующим образом:\n\n```\n[ 9.115544] ata9: exception Emask 0x0 SAct 0xf SErr 0x0 action 0x10 frozen\n[ 9.115550] ata9.00: failed command: READ FPDMA QUEUED\n[ 9.115556] ata9.00: cmd 60/04:00:d4:82:85/00:00:1f:00:00/40 tag 0 ncq 2048 in\n[ 9.115557] res 40/00:18:d3:82:85/00:00:1f:00:00/40 Emask 0x4 (timeout)\n```\n\nЧтобы отключить NCQ при загрузке, добавьте libata.force=noncq в командную строку ядра в настройках загрузчика. Чтобы отключить NCQ только для определённого устройства (например, для диска 0 на порту 9), используйте libata.force=9.00:noncq\n\nТакже можно отключить NCQ для определённого диска без перезагрузки через sysfs:\n\n```\n# echo 1 > /sys/block/sdX/device/queue_depth\n```\n\nЕсли это (а также обновление прошивки) не решит проблему или вызовет другие проблемы, то отправьте сообщение об ошибке.\n\n"
    },
    {
      "title": "Решение ошибок, связанных с управлением питанием SATA",
      "level": 3,
      "content": "У некоторых SSD (например, Transcend MTS400) возникают проблемы при включенном управлении питанием SATA Active Link Power Management, ALPM. ALPM отключен по умолчанию и включается демоном энергосбережения (например, TLP, Laptop Mode Tools).\n\nЕсли вы начинаете сталкиваться с ошибками, связанными с SATA, при использовании такого демона, попробуйте отключить ALPM, установив его состояние в max_performance и для профиля работы от батареи, и для профиля работы от сети.\n\n"
    },
    {
      "title": "Внешний SSD с поддержкой TRIM",
      "level": 3,
      "content": "Чипы некоторых USB-SATA мостов (например, VL715, VL716 и т.д.), а также USB-PCIe (например, JMicron JMS583, используемые во внешних NVMe, таких как IB-1817M-C31) поддерживают TRIM-подобные команды, которые могут быть отправлены через драйвер USB Attached SCSI (под именем «uas» в Linux).\n\nНо ядро может не обнаружить эту возможность автоматически и из-за этого не использовать её. Например, если ваше блочное устройство — это /dev/sdX, вы можете узнать, так ли это, выполнив команду\n\n```\n# sg_readcap -l /dev/sdX\n```\n\nЕсли в её выводе вы найдёте строку «Logical block provisioning: lbpme=0», значит ядро предполагает, что устройство не поддерживает \"Logical Block Provisioning Management\", поскольку бит (LBPME) не установлен.\n\nЕсли это так, то вам следует выяснить, есть ли в странице «Vital Product Data» (VPD) в разделе «Logical Block Provisioning» вашего устройства информация о поддерживаемых механизмах разметки данных. Это можно сделать с помощью команды:\n\n```\n# sg_vpd -a /dev/sdX\n```\n\nНайдите в выводе строки, которые выглядят следующим образом:\n\n```\nUnmap command supported (LBPU): 1\nWrite same (16) with unmap bit supported (LBPWS): 0\nWrite same (10) with unmap bit supported (LBPWS10): 0\n```\n\nЭтот пример говорит о том, что устройство поддерживает команду «UNMAP».\n\nВзгляните на вывод\n\n```\n$ cat /sys/block/sdX/device/scsi_disk/*/provisioning_mode\n```\n\nЕсли ядро не обнаружило поддержку unmap, то, скорее всего, будет возвращено значение «full». Кроме «full», драйвер накопителей SCSI в настоящее время знает следующие значения для provisioning_mode:\n\n```\nunmap\nwritesame_16\nwritesame_10\nwritesame_zero\ndisabled\n```\n\nДля приведённого выше примера теперь можно записать «unmap» в «provisioning_mode», чтобы попросить ядро использовать этот режим:\n\n```\n# echo \"unmap\" >/sys/block/sdX/device/scsi_disk/*/provisioning_mode\n```\n\nЭто сразу же позволит вам использовать такие инструменты, как «blkdiscard» на /dev/sdX или «fstrim» на примонтированных файловых системах, расположенных на /dev/sdX.\n\nЕсли вы хотите автоматически включать «provisioning_mode» при подключении внешнего устройства определённого производителя/продукта, это можно автоматизировать с помощью udev. Сначала найдите идентификаторы производителя и продукта USB:\n\n```\n$ cat /sys/block/sdX/../../../../../../idVendor\n$ cat /sys/block/sdX/../../../../../../idProduct\n```\n\nЗатем создайте или добавьте в файл правил udev (пример здесь использует idVendor 152d и idProduct 0583):\n\n```\n# echo 'ACTION==\"add|change\", ATTRS{idVendor}==\"152d\", ATTRS{idProduct}==\"0583\", SUBSYSTEM==\"scsi_disk\", ATTR{provisioning_mode}=\"unmap\"' >>/etc/udev/rules.d/10-uas-discard.rules\n```\n\n(Вы также можете использовать команду lsusb для поиска соответствующего idVendor/idProduct).\n\n"
    },
    {
      "title": "Прошивка",
      "level": 2,
      "content": "Если поддерживается производителем устройства, рекомендуется обновить прошивку с помощью утилиты fwupd.\n\n"
    },
    {
      "title": "ADATA",
      "level": 3,
      "content": "У ADATA есть утилита, доступная для Linux (i686) на странице поддержки[устаревшая ссылка 2024-12-15 ⓘ]. Ссылка на последнюю версию прошивки появится после выбора модели. Последняя утилита обновления для Linux упакована вместе с прошивкой и должна быть запущена от имени root. Возможно, сначала потребуется установить правильные права на исполняемый файл.\n\n"
    },
    {
      "title": "Crucial",
      "level": 3,
      "content": "Crucial предоставляет возможность обновления прошивки с помощью ISO-образа. Эти образы можно найти после выбора продукта на странице поддержки SSD и загрузки \"Manual Boot File\".\n\nВладельцы модели M4 Crucial могут проверить необходимость обновления прошивки с помощью команды smartctl.\n\n```\n$ smartctl --all /dev/sdX\n```\n\n```\n==> WARNING: This drive may hang after 5184 hours of power-on time:\nhttps://www.tomshardware.com/news/Crucial-m4-Firmware-BSOD,14544.html\nSee the following web page for firmware updates:\nhttps://www.crucial.com/usa/en/support-ssd\n```\n\nЕсли вы увидели это предупреждение — сделайте резервную копию важных данных и немедленно обновите прошивку. Смотрите инструкцию, как обновить прошивку Crucial MX100 с помощью ISO-образа и Grub.\n\n"
    },
    {
      "title": "Intel",
      "level": 3,
      "content": "У Intel есть Firmware Update Tool для операционных систем, не совместимых с Windows Intel® Memory and Storage Tool (GUI).\n\nСуществует также более новая утилита командной строки для Linux для перепрошивки под названием Intel Memory and Storage (MAS) Tool, доступная в AUR как intel-mas-cli-toolAUR (документация[устаревшая ссылка 2024-07-30 ⓘ]).\n\nПример проверки состояния прошивки:\n\n```\n# intelmas show -intelssd 0\n```\n\n```\nDevicePath : /dev/nvme0n1\nDeviceStatus : Healthy\nFirmware : 002C\nFirmwareUpdateAvailable : The selected Intel SSD contains current firmware as of this tool release.\n```\n\n-intelssd 0 можно опустить, если в системе только один SSD Intel, или передать 1 для второго SSD, и так далее.\n\nЕсли обновление доступно, оно выполняется путём запуска intelmas load -intelssd 0. В документации указано, что в Linux эту процедуру нужно выполнить дважды, с отключением и повторным включением питания между выполнениями. Последняя версия прошивки для всех устройств распространяется как часть MAS Tool, поэтому её не нужно скачивать отдельно.\n\n"
    },
    {
      "title": "Kingston",
      "level": 3,
      "content": "Для накопителей на базе Sandforce на AUR доступен инструмент KFU, kingston_fw_updaterAUR.\n\n"
    },
    {
      "title": "Mushkin",
      "level": 3,
      "content": "Менее известные твердотельные накопители марки Mushkin также используют контроллеры Sandforce и имеют утилиту Linux (почти идентичную Kingston) для обновления прошивки.\n\n"
    },
    {
      "title": "OCZ",
      "level": 3,
      "content": "У OCZ есть Command Line Online Update Tool (CLOUT), доступный для Linux. AUR предоставляет ocz-ssd-utilityAUR, ocztoolboxAUR и oczcloutAUR.\n\n"
    },
    {
      "title": "Samsung",
      "level": 3,
      "content": "Хотя Samsung считает методы обновления прошивки, не поддерживаемые программным обеспечением Magician, \"неподдерживаемыми\", они могут работать. Программа Magician может создать загрузочный USB-накопитель, содержащий обновление прошивки, однако Samsung больше не предоставляет это программное обеспечение для потребительских SSD. Samsung также предоставляет готовые загрузочные ISO-образы, которые можно использовать для обновления прошивки. Другой вариант - использовать утилиту Samsung magician (пакет samsung_magician-consumer-ssdAUR). Magician поддерживает только SSD под маркой Samsung; SSD, которые производит Samsung для OEM-производителей (например, Lenovo), не поддерживаются.\n\nПользователи, предпочитающие запускать обновление прошивки с Live USB, созданного через Linux (без использования программы Magician от Samsung на Microsoft Windows), могут обратиться к [12] за более подробной информацией.\n\n"
    },
    {
      "title": "Обновление под Linux",
      "level": 4,
      "content": "Прошивку твердотельного накопителя можно обновить из обычного Linux (без создания загрузочного USB-накопителя), как показано ниже. Сначала посетите страницу Samsung downloads page, перейдите в раздел «Samsung SSD Firmware» и загрузите последнюю версию прошивки для вашего SSD - это должен быть ISO-образ.\n\nИзвлеките initrd образ Linux из ISO-образа:\n\n```\n$ bsdtar xf samsung_ssd_firmware.iso initrd\n```\n\nИзвлеките root/fumagician/. Этот каталог содержит файлы обновления прошивки:\n\n```\n$ bsdtar xf initrd root/fumagician\n```\n\nНаконец, запустите root/fumagician/fumagician с правами root и перезагрузитесь (если прошивка была успешно обновлена).\n\nНекоторые ISO-образы прошивок SSD содержат образ FreeDOS вместо Linux-образа initrd, поэтому шаги, необходимые для обновления прошивки SSD, отличаются от описанных выше. В следующей таблице перечислены эти SSD (и соответствующие пути):\n\nTable content:\nМодель SSD | Путь к образу FreeDOS | Путь к прошивке\n470, 830 | BTDSK.IMG | SSR/\n840 | isolinux/btdsk.img | samsung/DSRD/\n840 EVO (mSATA), Pro | ISOLINUX/BTDSK.IMG\n\nСначала извлеките образ FreeDOS из ISO-образа:\n\n```\n$ bsdtar xf samsung_ssd_firmware.iso freedos_image_path.\n```\n\nСмонтируйте образ FreeDOS в /mnt/:\n\n```\n# mount freedos_image_path /mnt\n```\n\nПолучите номер диска SSD под Disk Number из утилиты управления SSD Magician:\n\n```\n# magician --list\n```\n\nОбновите прошивку SSD для указанного диска, указав путь к пакету прошивки:\n\n```\n# magician --disk disk_num --firmware-update --fwpackage-path /mnt/firmware_package_path\n```\n\nНаконец, убедитесь, что прошивка была успешно обновлена, проверив версию в разделе Firmware из вывода magician --list (запускать с правами root). В случае положительного ответа перезагрузите систему.\n\n"
    },
    {
      "title": "SanDisk",
      "level": 3,
      "content": "SanDisk создаёт ISO-образы с прошивками, чтобы можно было обновлять прошивку SSD в операционных системах, которые не поддерживает SanDisk SSD Toolkit.\n\nНужно выбрать прошивку для правильной модели SSD и правильной ёмкости (например, 60 ГБ, или 256 ГБ). После записи ISO-образа просто загрузитесь с созданного загрузочного диска CD/DVD (может работать и с USB-накопителя).\n\nОбразы iso содержат только ядро linux и initrd. Распакуйте их в раздел /boot и загрузитесь с помощью GRUB или Syslinux для обновления прошивки.\n\nСмотрите также:\n\n- SanDisk Extreme SSD Заметки о выпуске прошивки[устаревшая ссылка 2024-12-15 ⓘ] и Руководство по обновлению прошивки версии R211[устаревшая ссылка 2024-12-15 ⓘ].\n- SanDisk Ultra SSD Заметки о выпуске прошивки[устаревшая ссылка 2024-12-15 ⓘ] и Руководство по обновлению прошивки версии 365A13F0[устаревшая ссылка 2024-12-15 ⓘ]\n- SanDisk Ultra+ SSD Заметки о выпуске прошивки[устаревшая ссылка 2024-12-15 ⓘ] и Руководство по обновлению прошивки версии X2316RL[устаревшая ссылка 2024-12-15 ⓘ] — используйте smartctl -a /dev/sdX, чтобы определить, используется ли модель «H2» или «HP».\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Обсуждение на Reddit об установке Arch на SSD\n- Re: Варьирование Leafsize и Nodesize в Btrfs\n- Re: Выравнивание SSD и размер сектора в Btrfs\n- Erase Block (Alignment) Misinformation?\n- Нужно ли выравнивание по размеру блока стирания для современных SSD?\n- Поддержка Btrfs для эффективной работы SSD (выравнивание блоков данных)\n- SSD, Erase Block Size & LVM: PV на raw-устройстве, выравнивание\n\n"
    }
  ]
}