{
  "title": "Упутства за ArchWiki",
  "url": "https://wiki.archlinux.org/title/%D0%A3%D0%BF%D1%83%D1%82%D1%81%D1%82%D0%B2%D0%B0_%D0%B7%D0%B0_ArchWiki",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:Bots\n- Help:Discussion\n- Help:Template\n\nArchWiki is powered by MediaWiki, a free software wiki package written in PHP, originally designed for use on Wikipedia. More in-depth help can be found at Help:Contents on MediaWiki and Help:Contents on Wikipedia.\n\nThis is a short tutorial about editing the ArchWiki. Before editing or creating pages, users are encouraged to familiarize themselves with the general tone, layout, and style of existing articles. An effort should be made to maintain a level of consistency throughout the wiki. See ArchWiki:Contributing, Help:Reading and Help:Style for an overview of the common conventions.\n\nTo experiment with editing, please use the sandbox. For an overview of wiki markup, see Help:Cheatsheet.\n\n"
    },
    {
      "title": "Creating an account",
      "level": 2,
      "content": "Before registering, make yourself familiar with our Code of conduct. To be able to edit ArchWiki articles, you must create an ArchWiki account and confirm the e-mail address used for registration. Answering the captcha question requires an up-to-date Arch Linux environment: non-Arch users are very welcome to contribute to the wiki, and in order to answer the question they can for example boot into a live Arch system with the latest installation image, use pacman-staticAUR (precompiled binaries are available) or simply use a container image utilizing tools such as Docker.\n\nOnce you have an account, log in from Special:UserLogin.\n\n"
    },
    {
      "title": "Editing",
      "level": 2,
      "content": "To begin editing a page, click the Edit source tab at the top of the page. Alternatively, users may edit a specific section of an article by clicking the edit source link to the right of the section heading. The Editing Page name or Editing Page name (section) page will be displayed, which consists of the following elements:\n\n- Edit toolbar (optional)\n- Edit box\n- Edit summary box\n- Save changes or Save page, Show preview, Show changes, and Cancel links\n\nThe edit box will contain the wikitext (the editable source code from which the server produces the web page) for the current revision of the page or section. To perform an edit:\n\n1. Modify the wikitext as needed (see #Formatting below for details).\n1. Explain the edit in the Summary box (e.g. \"fixed typo\" or \"added info on xyz\"). Note: All edits should be accompanied by a descriptive summary to facilitate reviewing from other users. See ArchWiki:Contributing#The 3 fundamental rules for more information.\n1. Use the Show preview button to facilitate proofreading and verify formatting before saving.\n1. Mark the edit as minor by checking the This is a minor edit box if the edit is superficial and indisputable.\n1. Save changes by clicking Save changes. If unsatisfied, click Cancel instead (or repeat the process until satisfied).\n\nNote: **not** \n\n"
    },
    {
      "title": "Reverting edits",
      "level": 3,
      "content": "If a page was edited incorrectly, the following procedures describe how to revert an article to a previous version. To revert a single edit:\n\n1. Click the View history tab at the top of the page to be modified (beside the Edit source tab). A list of revisions is displayed.\n1. Click the undo link to the right of the unwanted edit. An edit preview is displayed, showing the current revision on the left and the text to be saved on the right.\n1. Write the reason why you are undoing this edit to the edit summary field.\n1. If satisfied, click the Save changes button at the bottom of the page.\n\nThe wiki page should now be back in its original state.\n\nOccasionally, it is necessary to revert several last edits at once. To revert an article to a previous version:\n\n1. Click the View history tab at the top of the page to be modified (beside the Edit source tab). A list of revisions is displayed.\n1. View the desired revision (i.e. the last good version) by clicking on the appropriate timestamp. That revision is displayed.\n1. Click the Edit source tab at the top of the page. A warning is displayed: Warning: You are editing an out-of-date revision of this page. If you save it, any changes made since this revision will be lost.\n1. Write the revision timestamp (displayed at the top of page) and a reason why you are reverting page state to the edit summary field.\n1. If satisfied, simply click the Save changes button to revert to this version.\n\nNote: **lost** \n\n- Avoid combining an undo and an edit. Revert the edit first, then make additional changes; do not edit the revision preview.\n- Consider using an especially detailed and verbose edit summary when performing an undo to prevent lengthy discussions.\n\n"
    },
    {
      "title": "Creating pages",
      "level": 2,
      "content": "Before creating a new page, please consider the following:\n\n- Is your topic relevant to Arch Linux? Irrelevant or unhelpful articles will be deleted.\n- Is your topic of interest to others? Consider not only what you wish to write about, but also what others may wish to read. Personal notes belong on your user page.\n- Is your topic worthy of a new page? Search the wiki for similar articles. If they exist, consider improving or adding a section to an existing article instead.\n- Will your contribution be significant? Avoid creating stubs unless planning to expand them shortly thereafter.\n\nCreating a new page requires selection of a descriptive title and an appropriate category.\n\nPlease read Help:Article naming guidelines and Help:Style#Title for article naming advice. Do not include \"Arch Linux\" or variations in page titles. This is the Arch Linux wiki; it is assumed that articles will be related to Arch Linux (e.g., \"Installing Openbox\"; not \"Installing Openbox in Arch Linux\").\n\nVisit the Table of contents to help choose an appropriate category. Articles may belong to multiple categories, as long as one category is not already the parent of the other (see Help:Style#Categories).\n\nTo add a new page to some category (say \"My new page\" to \"Some category\") you need to:\n\n1. Create a page with your new title by browsing to https://wiki.archlinux.org/title/My_new_page (remember to replace \"My_new_page\" with the intended title!)\n1. Add [[Category:Some category]] to the top of your page\n\nAt this stage the new article is still considered an orphan. To complete the job, take a little extra time to link to the new article from others: this will improve its visibility and encourage more users to contribute to it. Likely candidates are articles about related software, more generic overview pages, or even simple lists such as List of applications.\n\nIn some cases it may make sense to instead create a subpage, i.e. a child of another page: subpage titles are separated from the superpage title with \"/\" symbols (slash). This is often useful to prepare drafts under one's own User page, for example https://wiki.archlinux.org/title/User:Myself/My_new_subpage.\n\n"
    },
    {
      "title": "Formatting",
      "level": 2,
      "content": "Text formatting is accomplished with wiki markup whenever possible; learning HTML is not necessary. Various templates are also available for common formatting tasks; see Help:Template for information about templates. The Help:Cheatsheet summarizes the most common formatting options.\n\n"
    },
    {
      "title": "Headings and subheadings",
      "level": 3,
      "content": "Headings and subheadings are an easy way to improve the organization of an article. If you can see distinct topics being discussed, you can break up an article by inserting a heading for each section. See Help:Style#Section headings and Help:Effective use of headers for style information.\n\nHeadings must start from second level, and can be created like this:\n\n```\n== Second-level heading ==\n\n=== Third-level heading ===\n\n==== Fourth-level heading ====\n\n===== Fifth-level heading =====\n\n====== Sixth-level heading ======\n```\n\nIf an article has at least four headings, a table of contents (TOC) will be automatically generated. If this is not desired, place __NOTOC__ in the article. Try creating some headings in the Sandbox and see the effect on the TOC.\n\n"
    },
    {
      "title": "Line breaks",
      "level": 3,
      "content": "An empty line is used to start a new paragraph while single line breaks have no effect in regular paragraphs.\n\nThe HTML <br> tag can be used to manually insert line breaks, but should be avoided. A manual break may be justified with other formatting elements, such as lists.\n\nTable content:\nwikitext | rendering\nThis sentence is broken into three lines. | This sentence is broken into three lines.\nThis is paragraph number one. This is paragraph number two. | This is paragraph number one. This is paragraph number two.\n* This point <br> spans multiple lines * This point ends the list | This point spans multiple lines This point ends the list\n\n```\nThis sentence\nis broken into\nthree lines.\n```\n\nThis sentence is broken into three lines.\n\n```\nThis is paragraph number one.\n\nThis is paragraph number two.\n```\n\nThis is paragraph number one.\n\nThis is paragraph number two.\n\n```\n* This point <br> spans multiple lines\n* This point\nends the list\n```\n\n- This point spans multiple lines\n- This point\n\nends the list\n\nSee Help:Style/White space for information on proper use of whitespace characters.\n\n"
    },
    {
      "title": "Bold and italics",
      "level": 3,
      "content": "Bold and italics are added by surrounding a word or phrase with two, three or five apostrophes ('):\n\nTable content:\nwikitext | rendering\n''italics'' | italics\n'''bold''' | bold\n'''''bold and italics''''' | bold and italics\n\n''italics''\n\nitalics\n\n'''bold'''\n\nbold\n\n'''''bold and italics'''''\n\nbold and italics\n\n"
    },
    {
      "title": "Strike-out",
      "level": 3,
      "content": "Use strike-out text to show that the text no longer applies or has relevance.\n\nTable content:\nwikitext | rendering\n<s>Strike-out text</s> | Strike-out text\n\n```\n<s>Strike-out text</s>\n```\n\nStrike-out text\n\n"
    },
    {
      "title": "Lists",
      "level": 3,
      "content": "Remember that wiki syntax does not support multi-line list items; every newline character ends the list item definition. To start a new line inside a list item, use the <br> tag. To enter a multi-line code block inside a list item, use Template:bc and escape the content using <nowiki> tags. See also Help:Style/White space and Help:Template.\n\n"
    },
    {
      "title": "Bullet points",
      "level": 4,
      "content": "Bullet points have no apparent order of items.\n\nTo insert a bullet, use an asterisk (*). Multiple *s will increase the level of indentation.\n\nTable content:\nwikitext | rendering\n* First item * Second item ** Sub-item * Third item | First item Second item Sub-item Third item\n\n```\n* First item \n* Second item \n** Sub-item\n* Third item\n```\n\n- First item\n- Second item Sub-item\n- Third item\n\n- Sub-item\n\n"
    },
    {
      "title": "Numbered lists",
      "level": 4,
      "content": "Numbered lists introduce numbering and thus order the list items. You should generally use unordered lists as long as the order in which items appear is not the primary concern.\n\nTo create numbered lists, use the number sign or hash symbol (#). Multiple #s will increase the level of indentation.\n\nTable content:\nwikitext | rendering\n# First item # Second item ## Sub-item # Third item | First item Second item Sub-item Third item\n# First item # Second item #* Sub-item # Third item | First item Second item Sub-item Third item\n\n```\n# First item \n# Second item \n## Sub-item\n# Third item\n```\n\n1. First item\n1. Second item Sub-item\n1. Third item\n\n1. Sub-item\n\n```\n# First item\n# Second item\n#* Sub-item\n# Third item\n```\n\n1. First item\n1. Second item Sub-item\n1. Third item\n\n- Sub-item\n\n"
    },
    {
      "title": "Definition lists",
      "level": 4,
      "content": "Definition lists are defined with a leading semicolon (;) and a colon (:) following the term.\n\nTable content:\nwikitext | rendering\nDefinition lists: ; Keyboard: Input device with buttons or keys ; Mouse: Pointing device for two-dimensional input or ; Keyboard : Input device with buttons or keys ; Mouse : Pointing device for two-dimensional input | Definition lists: Keyboard Input device with buttons or keys Mouse Pointing device for two-dimensional input or Keyboard Input device with buttons or keys Mouse Pointing device for two-dimensional input\nUse additional colons if a term has multiple definitions: ; Term : First definition : Second definition | Use additional colons if a term has multiple definitions: Term First definition Second definition\n\n```\nDefinition lists:\n; Keyboard: Input device with buttons or keys\n; Mouse: Pointing device for two-dimensional input\nor\n; Keyboard\n: Input device with buttons or keys\n; Mouse\n: Pointing device for two-dimensional input\n```\n\nDefinition lists:\n\nor\n\n```\nUse additional colons if a term has multiple definitions:\n; Term\n: First definition\n: Second definition\n```\n\nUse additional colons if a term has multiple definitions:\n\nDefinition lists must not be simply used for formatting, see W3's examples.\n\n"
    },
    {
      "title": "Code block in list items",
      "level": 4,
      "content": "An example with block code in lists:\n\nTable content:\nwikitext | rendering\n# First item # Second item: {{bc|<nowiki> code1 code2 code3 </nowiki>}} # Third item | First item Second item: code1 code2 code3 Third item\n\n```\n# First item \n# Second item: {{bc|<nowiki>\ncode1\ncode2\ncode3\n</nowiki>}}\n# Third item\n```\n\n1. First item\n1. Second item: code1 code2 code3\n1. Third item\n\n```\ncode1\ncode2\ncode3\n```\n\n"
    },
    {
      "title": "Indenting",
      "level": 3,
      "content": "To indent text, place a colon (:) at the beginning of a line. The more colons you put, the further indented the text will be. A newline marks the end of the indented paragraph.\n\nTable content:\nwikitext | rendering\nThis is not indented at all. :This is indented slightly. ::This is indented more. | This is not indented at all. This is indented slightly. This is indented more.\n\n```\nThis is not indented at all.\n:This is indented slightly.\n::This is indented more.\n```\n\nThis is not indented at all.\n\n"
    },
    {
      "title": "Code",
      "level": 3,
      "content": "To add code to the wiki, use one of the code formatting templates. Alternatively, simply start each line with a single whitespace character, for example:\n\n```\n$ echo Hello World\n```\n\nSee also Help:Style#Code formatting.\n\n"
    },
    {
      "title": "Tables",
      "level": 3,
      "content": "Used effectively, tables can help organize and summarize swaths of data. For advanced table syntax and formatting, see Wikipedia:Help:Table.\n\nTable content:\nwikitext | rendering\n{| class=\"wikitable\" |+ Tabular data ! Distro !! Color |- | Arch || Blue |- | Gentoo || Purple |- | Ubuntu || Orange |} | Tabular data Distro Color Arch Blue Gentoo Purple Ubuntu Orange | Distro | Color | Arch | Blue | Gentoo | Purple | Ubuntu | Orange\nDistro | Color\nArch | Blue\nGentoo | Purple\nUbuntu | Orange\n{| class=\"wikitable\" ! Filesystem !! Size !! Used !! Avail !! Use% !! Mounted on |- | rootfs || 922G || 463G || 413G || 53% || / |- | /dev || 1.9G || 0 || 1.9G || 0% || /dev |} | Filesystem Size Used Avail Use% Mounted on rootfs 922G 463G 413G 53% / /dev 1.9G 0 1.9G 0% /dev | Filesystem | Size | Used | Avail | Use% | Mounted on | rootfs | 922G | 463G | 413G | 53% | / | /dev | 1.9G | 0 | 1.9G | 0% | /dev\nFilesystem | Size | Used | Avail | Use% | Mounted on\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n```\n{| class=\"wikitable\"\n|+ Tabular data\n! Distro !! Color\n|-\n| Arch || Blue\n|-\n| Gentoo || Purple\n|-\n| Ubuntu || Orange\n|}\n```\n\nTable content:\nDistro | Color\nArch | Blue\nGentoo | Purple\nUbuntu | Orange\n\n```\n{| class=\"wikitable\"\n! Filesystem !! Size !! Used !! Avail !! Use% !! Mounted on\n|-\n| rootfs || 922G || 463G || 413G || 53% || /\n|-\n| /dev || 1.9G || 0 || 1.9G || 0% || /dev\n|}\n```\n\nTable content:\nFilesystem | Size | Used | Avail | Use% | Mounted on\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n"
    },
    {
      "title": "Links",
      "level": 2,
      "content": "Links are essential to help readers navigate the site. In general, editors should ensure that every article contains outgoing links to other articles (avoid dead-end pages) and is referenced by incoming links from other articles (the what links here special page can be used to display incoming links). See also Help:Style/Formatting and punctuation#First instances.\n\n"
    },
    {
      "title": "Internal links",
      "level": 3,
      "content": "You can extensively cross-reference existing wiki pages using internal links. To make a link to another page on the same wiki, just put the title in double square brackets.\n\nFor example, if you want to make a link to, say, the pacman article, use:\n\n```\n[[pacman]]\n```\n\nIf you want to use words other than the article title as the text of the link, you can use a label after the pipe symbol (\"|\") to provide an alternative text.\n\nFor example:\n\n```\nThe [[ArchWiki:About|ArchWiki]] is the primary documentation source for Arch Linux.\n```\n\n...is rendered as:\n\nWhen you want to use the plural of an article title (or add any other suffix) for your link, you can add the extra letters directly outside the double square brackets.\n\nFor example:\n\n```\nmakepkg is used in conjunction with [[PKGBUILD]]s.\n```\n\n...is rendered as:\n\n"
    },
    {
      "title": "Section links",
      "level": 4,
      "content": "To create a link to a section of a document, simply add a # followed by the section's heading.\n\nFor example:\n\n```\n[[Help:Editing#Section links]]\n```\n\n...is rendered as:\n\n"
    },
    {
      "title": "Pipe trick",
      "level": 4,
      "content": "In some cases, it is possible to use the pipe trick to save writing the label of wiki links. The most important cases usable on ArchWiki are:\n\n1. In article titles, it allows to hide the language suffix. For example, [[Main page (Česky)|]] is turned into Main page.\n1. In links to different namespace or wiki, the pipe trick hides the prefix. For example, [[ArchWiki:About|]] is turned into About and [[wikipedia:Help:Pipe trick|]] is turned into Help:Pipe trick.\n\nWhen the page is saved, the pipe trick will automatically generate the label for the link and change the wikitext accordingly.\n\n"
    },
    {
      "title": "Interlanguage links",
      "level": 3,
      "content": "See Help:i18n#Interlanguage links\n\n"
    },
    {
      "title": "Interwiki links",
      "level": 3,
      "content": "So-called interwiki links can be used to easily link to articles in other external Wikis, like Wikipedia for example. The syntax for this link type is the wiki name followed by a colon and the article you want to link to enclosed in double square brackets.\n\nIf you want to create a link to the Wikipedia:Arch Linux article you can use the following:\n\n```\n[[Wikipedia:Arch Linux]]\n```\n\nOr you can create a piped link with a link label to the Arch Linux Wikipedia article:\n\n```\n[[Wikipedia:Arch Linux|Arch Linux Wikipedia article]]\n```\n\nSee mw:Help:Links#Interwiki links.\n\nThe list of all interwiki links available on ArchWiki can be viewed at Special:Interwiki and via the API.\n\nNote: results in Wikipedia:ru:Arch Linux.\n\n```\n[[Wikipedia:ru:Arch Linux]]\n```\n\nresults in Wikipedia:ru:Arch Linux.\n\n"
    },
    {
      "title": "External links",
      "level": 3,
      "content": "If you want to link to an external site, just type the full URL for the page you want to link to.\n\n```\nhttps://archlinux.org/\n```\n\nIt is often more useful to give the link an alternative label rather than displaying the URL. Unlike #Internal links, external links with a label use single square brackets and the target URL and the label are separated by a space (not a pipe). For example, to have the link appear as Arch Linux, just type:\n\n```\n[https://archlinux.org/ Arch Linux]\n```\n\nIt is also possible to generate an auto-numbered label by simply enclosing the URL with single brackets. This is often preferred to phrases like \"see here\". To produce a phrase \"see [1]\", where the number will vary depending on the order of the link on the page, just type:\n\n```\nsee [https://archlinux.org/]\n```\n\n- When linking to other ArchWiki pages (i.e. the links start with https://wiki.archlinux.org/) use #Internal links. When linking to Wikipedia pages (i.e. the links start with https://en.wikipedia.org/) use #Interwiki links.\n- When linking to issues on gitlab.archlinux.org, use Template:Issue instead.\n- When linking to packages or package groups, use the appropriate template instead. See Help:Style#Package management instructions.\n\n"
    },
    {
      "title": "Redirects",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nTo redirect automatically from one page to another, add #redirect and an internal link to the page to be redirected to at the beginning of a page.\n\nFor example, you could redirect \"Penguins\" to \"Penguin\" with:\n\n```\n#redirect [[Penguin]]\n```\n\nThus, anyone typing either version in the search box will automatically go to \"Penguin\".\n\nRedirects also allow keeping track of the reason why links are made, for example grouping them in WhatLinksHere pages, and let quickly update link fragments in case of section renames. As a downside redirects do not show the ultimate link target in the browser.\n\nBefore creating a redirect, you can perform a search to check existing compatible ones. For example, Xorg.\n\nSee also Help:Style#Redirect pages and Help:Procedures#Deal with talk pages after redirecting a page to another.\n\n- Redirects should not point to other sites.\n- Redirects do not work for category pages.\n- Redirects are resolved internally by the server and will not make it any slower to open an article.\n- Redirecting an existing page to another can create double redirects: see Help:Procedures#Fix double redirects for fixing them.\n\n"
    },
    {
      "title": "Wiki variables, magic words, and templates",
      "level": 2,
      "content": "MediaWiki recognizes certain special strings within an article that alter standard behavior. For example, adding the word __NOTOC__ anywhere in an article will prevent generation of a table of contents. Similarly, the word __TOC__ can be used to alter the default position of the table of contents. See Help:Magic words for details.\n\nTemplates and variables are predefined portions of wikitext that can be inserted into an article to aid in formatting content.\n\nVariables are defined by the system and can be used to display information about the current page, wiki, or date. For example, use {{SITENAME}} to display the wiki's site name (here it displayed as \"ArchWiki\"). To set an alternate title header for the current page, another wiki variable can be used: {{DISPLAYTITLE:New Title}}. (But it's very restricted: you are only allowed to change first letter to lowercase and replace spaces with underscores — normalized title string must match with real page name, otherwise it will not work; use {{Lowercase title}} template to display first letter of title in lower case).\n\nTemplates, on the other hand, are user-defined. The content of any page can be included in another page by adding {{Namespace:Page Name}} to an article, but this is rarely used with pages outside the Template namespace. (If the namespace is omitted, Template is assumed.) For example, Template:Note, which can be included in an article with the following wikitext:\n\n```\n{{Note|This is a note.}}\n```\n\n...is rendered as:\n\nSee Help:Template for more information and a list of available templates such as Template:Tip or Template:Warning.\n\n"
    }
  ]
}