{
  "title": "Установка Arch Linux с использованием специальных возможностей",
  "url": "https://wiki.archlinux.org/title/%D0%A3%D1%81%D1%82%D0%B0%D0%BD%D0%BE%D0%B2%D0%BA%D0%B0_Arch_Linux_%D1%81_%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%D0%BC_%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D1%8B%D1%85_%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Официальный установочный образ Arch Linux предоставляет следующие специальные возможности:\n\n- синтез речи с помощью espeakup;\n- поддержка брайлевского дисплея с помощью brltty.\n\nДанная статья описывает установку Arch Linux с использованием этих возможностей.\n\n"
    },
    {
      "title": "Загрузка live-окружения",
      "level": 3,
      "content": "Когда начнётся загрузка с установочного носителя, нажмите стрелку вниз и Enter, чтобы live-окружение загрузилось с включенным синтезатором речи.\n\nUSB-дисплеи Брайля должны определиться автоматически с помощью udev.\n\n"
    },
    {
      "title": "Несколько звуковых карт",
      "level": 3,
      "content": "Если на вашем компьютере установлено несколько звуковых карт, вы услышите следующее сообщение: Please select your sound card for speech output (Пожалуйста, выберите звуковую карту для вывода речи).\n\nКогда вы услышите звуковой сигнал на нужном вам выходе, нажмите Enter для выбора звуковой карты.\n\n"
    },
    {
      "title": "Изменение языка синтеза речи",
      "level": 3,
      "content": "Для изменения языка/голоса espeak-ng, используемого службой espeakup.service, отредактируйте юнит этой службы, добавив в строке Environment= после default_voice= код языка (например, ru для русского языка).\n\nТакже можно добавить +вариант к коду языка для изменения варианта голоса. Смотрите espeakup(8) и espeak-ng(1) для более подробной информации.\n\n"
    },
    {
      "title": "Установка основных пакетов",
      "level": 3,
      "content": "Чтобы в устанавливаемой системе был синтез речи, установите пакеты espeakup и alsa-utils. Для брайлевского дисплея установите пакет brltty.\n\nДобавьте нужные пакеты к команде pacstrap(8) во время установки:\n\n```\n# pacstrap -K /mnt base linux linux-firmware espeakup alsa-utils\n```\n\n"
    },
    {
      "title": "Звуковая карта",
      "level": 3,
      "content": "Если у вас #Несколько звуковых карт, скопируйте сгенерированный файл /etc/asound.conf из live-окружения в устанавливаемую систему:\n\n```\n# cp /etc/asound.conf /mnt/etc/\n```\n\n"
    },
    {
      "title": "Включение служб",
      "level": 3,
      "content": "Чтобы синтез речи запускался сразу при загрузке системы, включите службу espeakup.service. Смотрите также #Изменение языка синтеза речи.\n\n"
    },
    {
      "title": "Перезагрузка",
      "level": 2,
      "content": "После загрузки в только что установленную систему синтез речи должен включиться автоматически.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Большинство графических приложений, таких как приложения Gtk, Qt или Gecko, должны работать из коробки. Вы можете проверить работоспособность, запустив accerciser. Интересующее вас приложение должно присутствовать в списке приложений и иметь глубокую древовидную структуру дочерних элементов. Проблемы могут возникнуть, если:\n\n- вы не включили специальные возможности для своего дистрибутива. Обычно для включения где-то есть флажок. После включения нужно перезагрузиться;\n- приложение основано на Chromium или Electron. Для этих программ обычно требуется переменная окружения ACCESSIBILITY_ENABLED=1 и дополнительный аргумент --force-renderer-accessibility при запуске. Для Chrome вы можете заменить последний шаг включением опций accessibility в chrome://accessibility, однако это, похоже, не сохраняется после перезапуска;\n- это Java-приложение — в этом случае необходимо установить java-atk-wrapper-openjdk8 (или другую версию пакета в зависимости от версии Java);\n- в редких случаях, когда приложение старое, использующее Qt4, например, некоторые программы, которые не обновлялись с 2015 года нужно установить qt-at-spi;\n- в крайнем случае могут помочь какие-нибудь переменные окружения: GTK_MODULES=gail:atk-bridge, OOO_FORCE_DESKTOP=gnome, GNOME_ACCESSIBILITY=1, QT_ACCESSIBILITY=1, QT_LINUX_ACCESSIBILITY_ALWAYS_ON=1.\n\n"
    }
  ]
}