{
  "title": "Цифровые камеры (Русский)",
  "url": "https://wiki.archlinux.org/title/%D0%A6%D0%B8%D1%84%D1%80%D0%BE%D0%B2%D1%8B%D0%B5_%D0%BA%D0%B0%D0%BC%D0%B5%D1%80%D1%8B_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Libgphoto2 — основная библиотека, созданная для предоставления доступа к цифровым камерам с помощью внешних программ (фронтендов), например, digiKam и gPhoto2. Список официально поддерживающихся камер доступен на официальном сайте (другие камеры также могут быть совместимы).\n\nЭта статья описывает настройку libgphoto2 для получения доступа к цифровым камерам. Также обратите внимание, что некоторые камеры монтируются как обычные USB-накопители и не требуют libgphoto2.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет libgphoto2, а также gphoto2, если необходим интерфейс командной строки.\n\n"
    },
    {
      "title": "Фронтенды libgphoto2",
      "level": 3,
      "content": "- Darktable — утилита для организации и работы с RAW-изображениями.\n\n- digiKam — организация цифровых фото для KDE.\n\n- Entangle — предоставляет графический интерфейс для съёмки с подключённым компьютером и полным управлением камеры с него.\n\n- gphotofs — FUSE-модуль для монтирования камеры в качестве файловой системы.\n\n- gThumb — просмотрщик изображений для GNOME.\n\n- GTKam — фронтенд gPhoto2 на GTK 2.\n\n- gvfs-gphoto2 — бекенд gPhoto2 для GVfs, позволяющий монтировать камеру в качестве файловой системы из файловых менеджеров, поддерживающих GVfs. Например, GNOME Files, Nemo, PCManFM и Thunar.\n\n- Kamera — интеграция gPhoto2 в KDE.\n\n- Pantheon Photos — просмотрщик изображений для Pantheon.\n\n- Rapid Photo Downloader — загрузка фото и видео с камер, карт памяти и переносных запоминающих устройств.\n\n- Rawstudio — свободный конвертер RAW-изображений, написанный на GTK. Поддерживает съёмку с подключённым компьютером с помощью gPhoto2.\n\n- Shotwell — организатор цифровых фото для GNOME.\n\n"
    },
    {
      "title": "Использование gPhoto2",
      "level": 2,
      "content": "GPhoto2 — клиент командной строки для libgphoto2. GPhoto2 предоставляет доступ к библиотеке libgphoto2 через терминал или из shell-скрипта для выполнения доступных операций с камерой. Это основной пользовательский интерфейс.\n\nGPhoto2 также предоставляет удобную отладку для разработчиков драйверов камер.\n\nБыстрые команды\n\n- gphoto2 --list-ports\n- gphoto2 --auto-detect\n- gphoto2 --summary\n- gphoto2 --list-files\n- gphoto2 --get-all-files\n- gphoto2 --set-config datetime=now — задаёт камере текущее время\n\nДля получения более подробной информации о работе с файлами, см.\n\n- gphoto2 --shell\n\n"
    },
    {
      "title": "Пример использования с GVfs",
      "level": 3,
      "content": "Автоматическое обнаружение подключённой камеры и вывод необходимого порта:\n\n```\n$ gphoto2 --auto-detect\nModel                          Port                                            \n----------------------------------------------------------\nCanon Digital IXUS 980 IS      usb:006,011\n```\n\nТеперь откройте файловый менеджер и введите адрес с указанным выше портом — \"gphoto2://[usb:006,011]\" — камера автоматически смонтируется GVfs и станет доступна в файловом менеджере.\n\n"
    },
    {
      "title": "Проблемы с правами доступа",
      "level": 2,
      "content": "Пользователям с локальной сессией разрешения на доступ к камерам выдаются с помощью ACL. См. раздел Устранение часто встречающихся неполадок#Разрешения сессии, если это не работает.\n\n"
    }
  ]
}