{
  "title": "Часті питання",
  "url": "https://wiki.archlinux.org/title/%D0%A7%D0%B0%D1%81%D1%82%D1%96_%D0%BF%D0%B8%D1%82%D0%B0%D0%BD%D0%BD%D1%8F",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.** Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nЦю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\n"
    },
    {
      "title": "Що таке Arch Linux?",
      "level": 3,
      "content": "Дивись статтю Про Arch Linux.\n\n"
    },
    {
      "title": "Чи треба мені використовувати Arch Linux?",
      "level": 3,
      "content": "Вам не підійде Arch Linux, якщо:\n\n- Ви не згодні з принципами Arch .\n- Ви не маєте часу або бажання викорисовувати дистрибутив типу \"зроби сам\".\n- Ви займаєте строгу позицію щодо використання дистрибутивів, в склад яких входить лише вільне програмне забезпечення, за визначенням GNU.\n- Ви потребуєте підтримку архітектури, не сумісної з x86_64.\n- Ви вважеєте, що операційна система повинна налаштовувати себе сама та працювати \"з коробки\".\n- Ви не бажаєте викорисовувати Rolling release дистрибутив.\n- Вам подобається та система, яку ви використовуєте зараз.\n\n"
    },
    {
      "title": "Які архітектури підтримує Arch Linux?",
      "level": 3,
      "content": "На даний момент Arch підтримує тільки архітектуру x86_64. Підтримка архітектури i686 зупинилася з листопаду 2017 року [1].\n\n"
    },
    {
      "title": "Я повний новачок в системах GNU/Linux. Чи можу я використовувати Arch?",
      "level": 3,
      "content": "Якщо ви новачок та хочете використовувати Arch Linux, ви повинні бути готові інвестувати багато часу для вивчення цієї системи. Будьте готові до того, що Arch є дистрибутивом типу \"зроби сам\". Лише ви збираєте систему.\n\nПеред тим, як задати питання, пошукайте відповідь в інтернеті, на форумах, а також у прекрасній документації, що надає Arch Linux. Волонтери витратили багато годин, щоб зібрати всю цю інформацію.\n\n"
    },
    {
      "title": "Чи Arch створений для використання на сервері чи домашньому комп'ютері?",
      "level": 3,
      "content": "Arch не було створено під конкретну ціль. Він був створений під конкретного корисувача, яким подобається підхід \"Зроби сам\", і хто любить підлаштовувати систему під власні потреби.\n\nArch може бути використаний для майже будь-якої цілі: як на серверах, так і на домашніх та робочих комп'ютерах. Звісно, майже уся інфраструктура Arch використовує Arch.\n\n"
    }
  ]
}