{
  "title": "Что такое Arch Linux? (Русский)",
  "url": "https://wiki.archlinux.org/title/%D0%A7%D1%82%D0%BE_%D1%82%D0%B0%D0%BA%D0%BE%D0%B5_Arch_Linux%3F_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux — это независимо разрабатываемый дистрибутив x86-64 общего назначения на базе GNU/Linux, который стремится предоставлять последние стабильные версии программного обеспечения благодаря модели постоянных обновлений. Стандартная установка включает минимальную базовую систему, которую пользователь настраивает самостоятельно, добавляя только необходимые компоненты.\n\n"
    },
    {
      "title": "Простота",
      "level": 3,
      "content": "Arch Linux определяет простоту как отсутствие ненужных дополнений или изменений. Программное обеспечение поставляется в том виде, в котором его выпускают оригинальные разработчики (upstream), с минимальными изменениями, специфичными для дистрибутива: патчи, не принятые в upstream, избегаются, а собственные патчи Arch в основном включают бэкпортированные исправления ошибок, которые становятся неактуальными после следующего релиза.\n\nАналогично, конфигурационные файлы берутся из upstream с изменениями, ограниченными спецификой дистрибутива (например, корректировка путей к системным файлам). Arch не добавляет автоматизацию, например, включение службы при установке пакета. Пакеты делятся на несколько только при явных преимуществах (например, для экономии места на диске). Официальные графические инструменты для настройки отсутствуют, что стимулирует пользователей работать через терминал и текстовые редакторы.\n\n"
    },
    {
      "title": "Современность",
      "level": 3,
      "content": "Arch Linux поддерживает актуальные стабильные версии ПО, избегая системных поломок. Благодаря модели постоянных обновлений установка требуется только один раз, после чего система обновляется непрерывно.\n\nСреди нововведений: система инициализации systemd, современные файловые системы, LVM2, программный RAID, поддержка udev и initcpio (через mkinitcpio), а также последние версии ядер Linux.\n\n"
    },
    {
      "title": "Прагматизм",
      "level": 3,
      "content": "Arch Linux — прагматичный, а не идеологический дистрибутив. Принципы служат лишь рекомендациями, а решения принимаются разработчиками индивидуально на основе технического анализа, а не популярности или политики.\n\nВ репозиториях Arch представлены как свободные, так и проприетарные пакеты, что позволяет пользователям выбирать между идеологией и функциональностью.\n\n"
    },
    {
      "title": "Ориентированность на пользователя",
      "level": 3,
      "content": "В то время как многие дистрибутивы GNU/Linux пытаются быть более дружелюбными для пользователя (user-friendly), Arch Linux всегда был и будет оставаться ориентированным на пользователя (user-centric). Дистрибутив нацелен на удовлетворение потребностей тех, кто вносит в него свой вклад, а не на привлечение как можно большего числа пользователей. Он нацелен на опытных пользователей GNU/Linux или на тех, кто предпочитает подход «сделай сам», кто готов читать документацию и решать свои собственные проблемы.\n\nВсе пользователи могут принять участие и внести свой вклад в развитие дистрибутива. Отправка сообщений об ошибках и их исправление высоко ценятся; также ценятся патчи для улучшения пакетов или для главных проектов. Разработчики Arch — волонтёры, и активные контрибьюторы часто становятся частью команды. Arch'еры могут свободно сопровождать пакеты в Arch User Repository, улучшать документацию ArchWiki, оказывать техническую помощь другим или просто обмениваться мнениями на форумах, списках рассылки или в IRC-каналах. Дистрибутив Arch Linux является выбором для многих людей по всему миру, и существует несколько международных сообществ, предоставляющих помощь и документацию на различных языках.\n\n"
    },
    {
      "title": "Универсальность",
      "level": 3,
      "content": "Arch Linux — дистрибутив общего назначения. После установки доступна только командная оболочка. Вместо того, чтобы удалять ненужные и нежелательные пакеты из стандартной поставки, в Arch пользователю предлагается собрать свою собственную систему из тысяч пакетов, доступных в официальных репозиториях для архитектуры x86-64.\n\nArch опирается на pacman — легковесный, простой и быстрый менеджер пакетов, позволяющий производить полное обновление системы одной командой. Arch также предоставляет Arch build system — систему, похожую на порты в *BSD и обеспечивающую сборку и установку пакетов из исходников, которые также могут быть синхронизированы одной командой. Кроме того, Arch User Repository содержит тысячи поддерживаемых сообществом скриптов PKGBUILD для сборки установочных пакетов из исходников с использованием утилиты makepkg. Также ничто не мешает пользователям организовывать собственные репозитории.\n\n"
    },
    {
      "title": "История",
      "level": 2,
      "content": "Сообщество Arch выросло и превратилось в один из самых популярных и влиятельных дистрибутивов Linux, что также подтверждается вниманием и отзывами, полученными за эти годы.\n\nРазработчики Arch остаются неоплачиваемыми волонтёрами, работающими неполный рабочий день, и нет никаких перспектив для монетизации Arch Linux, поэтому он останется свободным и бесплатным. Те, кому интересно ознакомиться с более подробной информацией об истории разработки Arch, могут просмотреть историю сайта Arch в Internet Archive Wayback Machine и Arch Linux News Archives.\n\n"
    },
    {
      "title": "Ранние годы",
      "level": 3,
      "content": "Основатель Arch Linux — канадский программист Джадд Винет (Judd Vinet). Разработка началась в начале 2001 года. Первый релиз, Arch Linux 0.1, был выпущен 11 марта 2002 года. Несмотря на то, что Arch является полностью независимым дистрибутивом, он черпает вдохновение в простоте других дистрибутивов, включая Slackware CRUX и BSD. Винет также написал менеджер пакетов pacman для автоматического управления пакетами.\n\nСообщество Arch неуклонно росло, что демонстрирует этот график числа сообщений на форуме, пользователей и сообщений об ошибках. Более того, с самого начала оно был известно как открытое, дружелюбное и отзывчивое сообщество.\n\n"
    },
    {
      "title": "Рождение ArchWiki",
      "level": 3,
      "content": "8 июля 2005 года ArchWiki была впервые установлена на движке MediaWiki.\n\n"
    },
    {
      "title": "Начало эпохи А. Гриффина",
      "level": 3,
      "content": "В конце 2007 года Джадд Винет отказался от активного участия в качестве разработчика Arch и плавно передал управление американскому программисту Аарону Гриффину (Aaron Griffin), также известному как Phrakture.\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "15 июля 2012 года вышел новый релиз установочного образа, в котором Arch Installation Framework (AIF) был объявлен устаревшим в пользу Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "Эра systemd",
      "level": 3,
      "content": "Между 2012 и 2013 годами традиционная система инициализации System V была заменена на systemd. [1][2][3][4]\n\n"
    },
    {
      "title": "Прекращение поддержки i686",
      "level": 3,
      "content": "25 января 2017 года было объявлено, что поддержка архитектуры i686 будет прекращена из-за её слабой популярности среди разработчиков и сообщества. К концу ноября 2017 года все пакеты i686 были удалены из зеркал.\n\n"
    },
    {
      "title": "Пересмотр роли лидера проекта и выборы",
      "level": 3,
      "content": "В начале 2020 года коллектив Arch Linux разработал новый процесс определения будущих лидеров, задокументированный в DeveloperWiki:Project Leader.\n\nПоскольку Аарон Гриффин решил уйти со своей должности, был проведён опрос для избрания нового человека, который заменит его, и 24 февраля 2020 года были опубликованы его результаты, согласно которым в качестве нового лидера был избран Левенте Полиак (Levente Polyak).\n\n"
    },
    {
      "title": "Эра GitLab",
      "level": 3,
      "content": "В мае 2023 года инфраструктура Arch перешла на GitLab. Это привело к разделению тестового репозитория на core-testing и extra-testing, а также слиянию community в extra. Подробнее — в блоге GitLab.\n\nВ ноябре 2023 года открытые задачи из старого трекера ошибок (Flyspray) были перенесены в GitLab. Старый трекер был заменён на статический архив для сохранения работоспособности старых ссылок (например, FS#56716).\n\n"
    }
  ]
}