{
  "title": "Шрифты окружения Java Runtime",
  "url": "https://wiki.archlinux.org/title/%D0%A8%D1%80%D0%B8%D1%84%D1%82%D1%8B_%D0%BE%D0%BA%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F_Java_Runtime",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Шрифты\n- Настройка шрифтов\n- Шрифты Microsoft\n- X Logical Font Description\n\nНекоторые пользователи могут заметить, что шрифты в приложениях Java отображаются неприятно. Доступно несколько методов, чтобы улучшить отображение шрифтов в приложениях, работающих с Java Runtime Environment (JRE). Эти методы могут использоваться по отдельности, но многие пользователи предпочтут использовать их вместе, чтобы получить лучший результат.\n\nДля использования с Java лучшим поддерживаемым форматом шрифтов будет TrueType.\n\n"
    },
    {
      "title": "Запуск демона xsettings",
      "level": 3,
      "content": "Java устанавливает свои настройки по умолчанию при помощи xsettings. В GNOME автоматически работает демон gnome-settings-daemon, но в качестве альтернативы можно использовать утилиту Xsettingsd.\n\n"
    },
    {
      "title": "Базовые настройки",
      "level": 3,
      "content": "Сглаживание доступно с версии Java 1.6. Чтобы активировать его для всей системы, добавьте следующую строку в /etc/environment:\n\n```\n_JAVA_OPTIONS='-Dawt.useSystemAAFontSettings=setting'\n```\n\nГде setting это одно из значений:\n\nTable content:\nУстановка | Описание\noff, false, default | Без сглаживания\non | Полное сглаживание\ngasp | Использовать встроенные в шрифт инструкции хинтинга\nlcd, lcd_hrgb | Сглаживание настроенное для большинства популярных ЖК-мониторов\nlcd_hbgr, lcd_vrgb, lcd_vbgr | Альтернативные настройки для ЖК-мониторов\n\nПараметры gasp и lcd в большинстве случаев хорошо работают.\n\nЧтобы приложения Java ощущались и выглядели как приложения, использующие GTK, используйте следующую строку:\n\n```\n_JAVA_OPTIONS='-Dswing.defaultlaf=com.sun.java.swing.plaf.gtk.GTKLookAndFeel'\n```\n\nNote: **TrueType** \n\n- Описанные варианты работают только для приложений, которые используют графический интерфейс, основанный на Java, таких как например JDownloader, а не для приложений, которые используют Java только в качестве бэкэнда, как OpenOffice.org или Matlab.\n- Шрифты TrueType содержат grid-fitting and scan-conversion procedure (GASP) — таблицу с рекомендациями дизайнера для отображения шрифта в разных размерах pt. Для некоторых размеров рекомендуется использовать полное сглаживание, другим требуется только хинтинг, а некоторые будут отображаться только в виде растровых изображений. Для некоторых размеров шрифта могут быть использованы комбинации.\n\nЧтобы изменения вступили в силу, требуется выполнить перелогин, но можно указать переменную в командной строке перед выполнением, чтобы попробовать новую настройку сразу:\n\n```\n_JAVA_OPTIONS=настройка java Main\n```\n\n"
    },
    {
      "title": "Патч OpenJDK",
      "level": 3,
      "content": "В результате сглаживание может выглядеть хуже нативных приложений, даже с опциями, но это может быть исправлено с помощью патча в OpenJRE, доступному в AUR:\n\n- Исправленный OpenJRE 7 доступен как jre7-openjdk-infinalityAUR[ссылка недействительна: package not found]; используется с ключом --enable-infinality=yes\n- Исправленный OpenJRE 8 доступен как jre8-openjdk-infinalityAUR[ссылка недействительна: package not found]\n\nИсправленные версии хорошо сочетаются с патчами fontconfig и freetype, однако стоит заметить, что используют только API от fontconfig.\n\n"
    },
    {
      "title": "Шрифты TrueType",
      "level": 3,
      "content": "Некоторые приложения Java могут требовать определенного шрифта TrueType. Эти приложения должны быть в курсе пути каталога с нужным шрифтом. TrueType шрифты устанавливаются в каталог /usr/share/fonts/TTF. Добавьте следующую строку в /etc/environment чтобы включить эти шрифты в приложениях.\n\n```\nJAVA_FONTS=/usr/share/fonts/TTF\n```\n\nПерелогинтесь, чтобы изменения вступили в силу.\n\n"
    },
    {
      "title": "Исправление Mojibake (для JRE8)",
      "level": 3,
      "content": "Поместите файлы шрифтов в подкаталог. Создайте каталог, если он не существует.\n\n```\n$JAVA_HOME/jre/lib/fonts/fallback/\n```\n\nЭтот функционал удалён начиная с Oracle JDK 9, так как Oracle посчитала это ошибкой, заставляющей пользователей перемещать каталог lib, и поэтому переместила эти файлы в каталог conf, назвав поведение до этого ошибочным. Вместо этого следует использовать вызов sun.awt.FontConfiguration.getInstalledFallbackFonts(), что заставит Java всегда добавлять шрифты оттуда в качестве запасной последовательности глифов — то есть не зависимо, какие шрифты запрашивает приложение, недостающие глифы этих шрифтов берутся из указанной директории.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Font Configuration Files в руководстве по интернационализации приложений Java\n- Font Configuration Files для Java 8\n\n"
    }
  ]
}