{
  "title": "การติดตั้ง Arch Linux แบบเร็ว",
  "url": "https://wiki.archlinux.org/title/%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%95%E0%B8%B4%E0%B8%94%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87_Arch_Linux_%E0%B9%81%E0%B8%9A%E0%B8%9A%E0%B9%80%E0%B8%A3%E0%B9%87%E0%B8%A7",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "นี่คือคู่มือแนะนำการติดตั้ง Arch Linux โดยใช้ installation image อย่างเป็นทางการ\n\nก่อนการติดตั้ง เราแนะนำให้คุณอ่าน คำถามที่พบบ่อย และ Help:Reading สำหรับแบบแผนต่าง ๆ ที่เอกสารนี้ใช้ โดยเฉพาะที่ว่า ตัวอย่างโค้ดอาจมี placeholders (สังเกตได้จากการใช้ ตัวเอียง) ซึ่งใช้แทนค่าจริงที่คุณต้องใส่เอง\n\nคุณสามารถอ่านรายละเอียดเพิ่มเติมได้จากบทความในวิกิหรืออ่าน man page ของโปรแกรมต่าง ๆ ซึ่งในเอกสารนี้มีการลิงค์ไปยังบทความเหล่านั้น สำหรับความช่วยเหลือเชิงโต้ตอบ คุณสามารถใช้ ช่อง IRC และ กระดานข่าว ได้\n\nArch Linux ควรที่จะทำงานได้บนเครื่องที่ใช้ชุดคำสั่ง x86-64 โดยมี RAM อย่างน้อย 512 MiB อย่างไรก็ตามระบบอาจต้องการ RAM มากกว่านั้นในการบู๊ตเพื่อติดตั้งระบบปฏิบัติการ โดยการติดตั้งโดยทั่วไปจะใช้พื้นที่ไม่เกิน 2 GiB\n\nการติดตั้งจำเป็นต้องดึงแพ็คเกจมาจากอินเทอร์เน็ต ดังนั้นคุณต้องมีการเชื่อมต่ออินเทอร์เน็ตที่ใช้งานได้\n\n"
    },
    {
      "title": "ดาวน์โหลด image",
      "level": 3,
      "content": "ไปยังหน้าดาวน์โหลด และดาวน์โหลดไฟล์ ISO หรือ netboot พร้อมกับ GnuPG signature ของไฟล์\n\n"
    },
    {
      "title": "ตรวจสอบ signature",
      "level": 3,
      "content": "เราแนะนำให้คุณตรวจสอบ signature ของไฟล์ที่คุณได้ดาวน์โหลดมา โดยเฉพาะอย่างยิ่งเมื่อคุณดาวน์โหลดไฟล์มาจาก HTTP mirror ซึ่งการดาวน์โหลดมีแนวโน้มที่จะถูกดักเพื่อแพร่กระจายไฟล์ที่ถูกดัดแปลงด้วยความประสงค์ร้าย\n\nบนระบบที่ได้มีการติดตั้ง GnuPG ไว้แล้ว ดาวน์โหลด PGP signature (อยู่ในหน้าดาวน์โหลดด้านล่างคำว่า Checksums) ไว้ในไดเรกทอรีเดียวกับไฟล์ ISO ที่ดาวน์โหลดมา แล้วตรวจสอบ signature นั้นได้โดยใช้คำสั่ง:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nหรือ บนระบบ Arch Linux คุณสามารถใช้คำสั่ง:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n"
    },
    {
      "title": "เตรียมสื่อกลางการติดตั้ง",
      "level": 3,
      "content": "การจัดเตรียม image ในการติดตั้ง Arch Linux บนเครื่องที่ต้องการ สามารถทำได้โดยใช้ แฟลชไดร์ฟ USB, แผ่นเก็บข้อมูล หรือผ่านเครือข่ายด้วย PXE ปฏิบัติตามขั้นตอนในบทความของสื่อกลางที่คุณต้องการ แล้วไปสู่ขั้นตอนต่อไป\n\n"
    },
    {
      "title": "บู๊ตเข้าสู่ live environment",
      "level": 3,
      "content": "1. ชี้ boot device ไปยังอุปกรณ์ที่มีสื่อกลางการติดตั้ง Arch Linux ซึ่งโดยทั่วไปแล้วสามารถทำได้โดยการกดคีย์ตามที่แสดงบนหน้าจอในเฟส POST สำหรับรายละเอียดเพิ่มเติม ลองดูคู่มือ motherboard ของคุณ\n1. เมื่อหน้า boot loader ของสื่อกลางการติดตั้งปรากฏขึ้นแล้ว เลือก สื่อกลางการติดตั้ง Arch Linux และกด Enter เพื่อบู๊ตเข้าสู่ environment สำหรับการติดตั้ง Tip: image สำหรับการติดตั้งใช้ systemd-boot สำหรับการบู๊ตในโหมด UEFI และ syslinux สำหรับการบู๊ตในโหมด BIOS สำหรับพารามิเตอร์การบู๊ต ลองอ้างอิงถึง README.bootparams\n1. คุณจะถูกเข้าสู่ระบบในคอนโซลเสมือนในฐานะของผู้ใช้งาน root และพบกับ shell prompt Zsh\n\nสำหรับการเปลี่ยนไปยังคอนโซลอื่น เช่น การเปลี่ยนคอนโซลเพื่อดูคู่มือนี้โดยใช้ Lynx ไปควบคู่กับการติดตั้งนั้น สามารถทำได้โดยการใช้คีย์ลัด Alt+ลูกศร และในการแก้ไขไฟล์การตั้งค่าต่าง ๆ ในระบบมี mcedit(1), nano และ vim ติดตั้งไว้ให้แล้ว ลองดู packages.x86_64 สำหรับรายการของแพ็คเกจที่มีให้ในสื่อกลางการติดตั้ง\n\n"
    },
    {
      "title": "ตั้งค่าเลย์เอาต์ของคีย์บอร์ด",
      "level": 3,
      "content": "เลย์เอาต์เริ่มต้นของคีย์บอร์ดคือ US แต่คุณสามารถเพิ่มเลย์เอาต์ที่ต้องการได้โดยใช้คำสั่ง loadkeys keymap_file: ซึ่งอยู่ใน /usr/share/kbd/keymaps/ (ไม่ต้องระบุ path และนามสกุลไฟล์ก็ได้)\n\n"
    },
    {
      "title": "เชื่อมต่ออินเทอร์เน็ต",
      "level": 3,
      "content": "ปกติคุณจะใช้อินเทอร์เน็ตได้โดยอัตโนมัติผ่าน DHCP discovery หลังบู๊ตสื่อการติดตั้งอยู่แล้ว (ถ้าเป็นการเชื่อมต่อแบบใช้สาย) แต่ถ้าใช้เครือข่ายแบบไร้สาย คุณต้องเรียกใช้โปรแกรม wifi-menu เพื่อตั้งค่าเครือข่ายก่อน; อ่านข้อมูลเพิ่มเติมที่ การตั้งค่าเครือข่ายไร้สาย และถ้าคุณต้องการใช้ static IP หรือใช้เครื่องมือจัดการเครือข่ายอื่น คุณต้องหยุดใช้ DHCP ด้วยคำสั่ง systemctl stop dhcpcd@eth0.service แล้วค่อยทำตามวิธีในหน้า Netctl\n\n"
    },
    {
      "title": "อัพเดตเวลาของระบบ",
      "level": 3,
      "content": "อ่าน systemd-timesyncd\n\n"
    },
    {
      "title": "แบ่งพาร์ทิชั่นของดิสก์",
      "level": 3,
      "content": "อ่านรายละเอียดที่หน้า การแบ่งพาร์ทิชั่น; คุณอาจต้องสร้างพาร์ทิชั่นพิเศษขึ้นอยู่กับแต่ละกรณี ลองอ่านหน้า EFI System Partition และ GRUB BIOS boot partition และถ้าคุณต้องการใช้ stacked block devices สำหรับ LVM, การเข้ารหัสดิสก์ หรือ RAID ก็ให้ทำในขั้นตอนนี้ด้วย\n\n"
    },
    {
      "title": "ฟอร์แมตพาร์ทิชั่น",
      "level": 3,
      "content": "อ่าน ระบบไฟล์ และ Swap สำหรับรายละเอียดและวิธีการ\n\n"
    },
    {
      "title": "Mount พาร์ทิชั่น",
      "level": 3,
      "content": "Mount พาร์ทิชั่น root ที่ /mnt หลังจากนั้นให้สร้างและ mount ไดเร็คทอรี่อื่น ๆ (ถ้ามี) (เช่น /mnt/boot, /mnt/home, ...) จากนั้นให้เปิดใช้พาร์ทิชั่น swap ถ้าต้องการให้ genfstab มองเห็น\n\n"
    },
    {
      "title": "เลือก mirror",
      "level": 3,
      "content": "แก้ไข /etc/pacman.d/mirrorlist และเลือก download mirror ที่ต้องการ เราแนะนำให้ใช้ mirror ในท้องถิ่นจะเร็วที่สุด; ลองอ่านรายละเอียดที่หน้า Mirrors เนื่องจากการตั้งค่าในไฟล์ mirrorlist จะถูกนำไปใช้ในระบบใหม่ด้วยเมื่อคุณใช้สคริปต์ pacstrap เราแนะนำให้คุณตั้งค่า mirror ให้ถูกต้องเลยในขั้นตอนนี้เพิ่มความสะดวก\n\nหมายเหตุ: mirror ที่ใช้ได้ดีในประเทศไทย เช่น ของม.เกษตรศาสตร์\n\n"
    },
    {
      "title": "ติดตั้งแพคเกจพื้นฐาน",
      "level": 3,
      "content": "ใช้สคริปต์ pacstrap(8) เพื่อติดตั้งโปรแกรมจากกลุ่ม base:\n\n```\n# pacstrap /mnt base linux linux-firmware\n```\n\nถ้าต้องการติดตั้งแพคเกจหรือกลุ่มแพคเกจอื่น ให้เพิ่มชื่อที่ต้องการติดตั้งต่อท้ายไปในคำสั่งด้านบนโดยเว้นช่องไฟระหว่างแต่ละชื่อ\n\n"
    },
    {
      "title": "ตั้งค่าระบบ",
      "level": 3,
      "content": "สร้าง fstab (ใช้ตัวเลือก -U หรือ -L ถ้าต้องการใช้ UUID หรือ label ในไฟล์):\n\n```\n# genfstab -p /mnt >> /mnt/etc/fstab\n```\n\nChange root เข้าไปในรากของระบบใหม่:\n\n```\n# arch-chroot /mnt\n```\n\nตั้ง ชื่อเครื่อง:\n\n```\n# echo computer_name > /etc/hostname\n```\n\nตั้ง โซนเวลา:\n\n```\n# ln -s /usr/share/zoneinfo/zone/subzone /etc/localtime\n```\n\nเปิดใช้ locales ที่ต้องการใน /etc/locale.gen จากนั้นก็สร้าง locale โดยใช้คำสั่ง:\n\n```\n# locale-gen\n```\n\nตั้ง locale เริ่มต้นใน /etc/locale.conf และ $HOME/.config/locale.conf:\n\n```\n# echo LANG=your_locale > /etc/locale.conf\n```\n\nเพิ่ม keymap และ font สำหรับคอนโซลใน /etc/vconsole.conf\n\nตั้งค่าเครือข่ายสำหรับเครื่องใหม่: อ่านหน้า การตั้งค่าเครือข่าย และ การตั้งค่าเครือข่ายแบบไร้สาย\n\nตั้งค่า /etc/mkinitcpio.conf เพิ่มเติมถ้าต้องการ จากนั้นสร้าง RAM disk ใหม่ด้วยคำสั่ง:\n\n```\n# mkinitcpio -P\n```\n\nกำหนดรหัสผ่านสำหรับผู้ใช้ root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "ติดตั้งบู๊ตโหลดเดอร์",
      "level": 3,
      "content": "อ่านหน้า บู๊ตโหลดเดอร์ เพื่อดูวิธีการติดตั้งและการตั้งค่า\n\n"
    },
    {
      "title": "รีบู๊ตเครื่อง",
      "level": 3,
      "content": "ออกจาก chroot โดยพิมพ์ exit หรือกดปุ่ม Ctrl+D\n\nUnmount พาร์ทิชั่นทั้งหมดด้วยคำสั่ง umount -R /mnt: ขั้นตอนนี้จะทำให้คุณพบพาร์ทิชั่นที่ยังถูกใช้งานอยู่และไม่สามารถ unmount ได้ จะได้หาสาเหตุได้โดยใช้ fuser\n\nสุดท้ายให้รีบู๊ตเครื่องโดยพิมพ์คำสั่ง reboot: พาร์ทิชั่นที่ยังถูก mount อยู่จะถูก systemd ปลดออกโดยอัตโนมัติ อย่าลืมดึงแผ่นซีดีหรือสื่อที่คุณใช้ในการบู๊ตเพื่อติดตั้งออกหลังรีบู๊ตด้วย หลังรีบู๊ตเสร็จ คุณสามารถล็อกอินด้วยผู้ใช้ root\n\n"
    },
    {
      "title": "หลังการติดตั้ง",
      "level": 2,
      "content": "ลองอ่าน คำแนะนำทั่วไป สำหรับวิธีการจัดการระบบและสิ่งที่คุณอาจอยากทำหลังติดตั้งเสร็จ (เช่น การติดตั้ง graphical user interface, เสียง, หรือ touchpad)\n\nนอกจากนั้นยังมีแอพพลิเคชั่นอีกมากมายที่คุณอาจสนใจ ลองดูที่ รายชื่อแอพพลิเคชั่น\n\n"
    }
  ]
}