{
  "title": "デスクトップ環境",
  "url": "https://wiki.archlinux.org/title/%E3%83%87%E3%82%B9%E3%82%AF%E3%83%88%E3%83%83%E3%83%97%E7%92%B0%E5%A2%83",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "関連記事\n\n- デスクトップ環境の比較\n- Category:Freedesktop.org\n- ウィンドウマネージャ\n\nデスクトップ環境 (DE) は、共通のグラフィカルユーザインターフェイス (GUI) を共有するプログラム群で構成されるデスクトップ・メタファーの実装です。\n\nデスクトップ環境は、アイコン、ツールバー、壁紙、デスクトップウィジェットのようなグラフィカルユーザーインターフェイスの一般的な要素を提供する様々なコンポーネントをバンドルしています。さらに、ほとんどのデスクトップ環境には総合的なアプリケーションとユーティリティが含まれています。最も重要なことは、デスクトップ環境は独自のウィンドウマネージャを提供していますが、通常それらは互換性のある他のものに置き換えることができるということです。\n\nユーザは様々な方法で自由に GUI 環境を構築することができます。デスクトップ環境は、GUI 環境を構築するための完全かつ便利な手段を提供するに過ぎません。ユーザーは複数のデスクトップ環境から自由にアプリケーションを取捨選択することもできます。例えば、Plasma ユーザーは、(KDE Konqueror ウェブブラウザが気に入らなかった場合) Epiphany ウェブブラウザなどの GNOME アプリケーションをインストールできます。このアプローチの欠点は、デスクトップ環境に含まれたアプリケーションの多くは DE 各々のライブラリにかなり依存しているということです。結果として、さまざまなデスクトップ環境からアプリケーションをインストールすると更に大量のライブラリのインストールの必要性を招きます。ディスク容量を節約したいユーザは、このような混合環境を避けたり、外部のライブラリにあまり依存していない代替環境を選んだりします。\n\nなお、デスクトップ環境により提供されているアプリケーションは、それぞれのネイティブ環境にあわせて作られる傾向があります。外観上、異なったウィジェットツールキットがまざった混合環境では外見不一致になることがあります（つまり、インターフェースが別々のアイコン・ウィジェットスタイルを使うことになります）。ユーザーエクスペリエンス上、混合環境は振る舞いが等しくならないかもしれません（例: アイコンのダブルクリックに対するシングルクリック、ドラッグアンドドロップ機能）し混乱や意図しない振る舞いの原因となりえます。\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 デスクトップ環境の一覧 1.1 公式サポート 1.2 非公式サポート\n- 2 別のウィンドウマネージャを使う\n- 3 カスタム環境\n\n- 1.1 公式サポート\n- 1.2 非公式サポート\n\n"
    },
    {
      "title": "公式サポート",
      "level": 3,
      "content": "- Budgie — Budgie は最近のユーザーを考慮して設計されたデスクトップ環境で、シンプリシティとエレガンスに焦点を置いています。\n\n- Cinnamon — Cinnamon は伝統的なユーザーエクスペリエンスを得られるように力が入れられています。Cinnamon は Gnome 3 のフォークです。\n\n- COSMIC — Cosmic は、Pop! OS のために System76 によって作成された Rust ベースのデスクトップ環境です。高度にカスタマイズされた GNOME にインスパイアされました。まだ、アルファ段階です。\n\n- Cutefish — Cutefish は新しい、モダンなデスクトップ環境です。\n\n- Deepin Desktop Environment — Deepin デスクトップインターフェイスとアプリは直感的でエレガントなデザインを特徴としています。画面の遷移や共有、検索などをするだけで、喜びを。\n\n- Enlightenment — Enlightenment デスクトップシェルは効率的なウィンドウマネージャを提供します。Enlightenment Foundation Libraries による他の重要なデスクトップコンポーネント、ファイルマネージャ、デスクトップアイコン、ウィジェットなども含まれます。テーマ機能を持ちつつ、古いハードウェアや組み込みデバイスでも動きます。\n\n- GNOME — GNOME デスクトップ環境は、モダンなセッション (GNOME) とクラシックなセッション (GNOME Classic) の両方を持つ、魅力的かつ直感的なデスクトップです。\n\n- GNOME Flashback — GNOME Flashback は元は GNOME フォールバックモードと呼ばれていた GNOME 3 用のシェルです。デスクトップレイアウトや使っている技術は GNOME2 と似ています。\n\n- KDE Plasma — KDE Plasma デスクトップ環境は馴染み深い作業環境です。Plasma はモダンなデスクトップコンピューティングに必要なツールをすべて提供するので、使い始めてすぐに生産性を高めることができます。\n\n- LXDE — Lightweight X11 Desktop Environment は速くて省エネルギーなデスクトップ環境です。モダンなインターフェース、多言語サポート、標準キーボードショートカットに加えて、タブファイルブラウズなどの付加的な機能を持っています。基礎から軽量にするよう作られているので、LXDE は他の環境よりも CPU や RAM の消費量が少なくみつもれます。\n\n- LXQt — LXQt は LXDE (Lightweight Desktop Environment) の Qt 移植であり後継バージョンです。LXDE-Qt と Razor-qt のプロジェクトが統合して作られました: 軽量、モジュール式、極めて高速でユーザーフレンドリーなデスクトップ環境です。\n\n- MATE — 伝統的なやりかたを好む Linux ユーザーにとって直感的で魅力的なデスクトップを提供します。GNOME 2 のフォークとして開発が開始されましたが、現在では GTK 3 が使われてます。\n\n- Pantheon — Pantheon は elementary OS ディストリビューションのデフォルトデスクトップ環境として作成されました。Vala と GTK3 ツールキットを使ってゼロから書かれています。ユーザビリティや外観には GNOME Shell や macOS と似通っているところがあります。\n\n- Phosh — Phosh は、GNOME ベースの Wayland シェルユーザインターフェイスです。モバイルデバイスにおいて便利です。\n\n- Sugar — Sugar 学習用プラットフォームは5歳から12歳までの子供たちにリッチメディアを通して勉学の助けにすることを目的とした活動のためのコンピュータ環境です。Sugar は高等な教育の機会をすべての子供に与えるための世界的な支援によって成り立っています。現在では世界中の、40カ国以上、25の言語をしゃべる、100万人近くの子供たちによって使われています。Sugar は現在多くの地域で見過ごされている、質の高い教育を通じて充実した生活をおくれるように人々を手助けしています。\n\n- UKUI — UKUI は GTK と Qt をベースに開発されている軽量なデスクトップ環境で、Ubuntu kylin に標準搭載されています。\n\n- Xfce — Xfce は 伝統的な UNIX 哲学、モジュール性と効率性の体現者です。現代的なデスクトップ環境として期待される機能を持った多くのコンポーネントが含まれていますが、どれも比較的に軽量に抑えられています。コンポーネントは分割してパッケージ化され、最適なパーソナル環境を作るために必要なものだけをピックアップすることができます。\n\n"
    },
    {
      "title": "非公式サポート",
      "level": 3,
      "content": "- CDE — Common Desktop Environment は Unix および OpenVMS 用のデスクトップ環境で、Motif ウィジェットツールキットをベースとしています。かつては UNIX98 Workstation Product Standard に含まれており、商用の Unix ワークステーションと一緒に\"クラシック\"な Unix デスクトップとして長い間使われていました。旧式の環境でありながら、依然として整備されており Linux システムのサポートも続けられています。\n\n- EDE — \"Equinox Desktop Environment\" はシンプルで極限の軽量・高速を目指して作られている DE です。\n\n- Liri — Liri は近代的なデザインと機能が特徴のデスクトップ環境です。Liri は Hawaii, Papyros, Liri Project がマージして生まれました。開発状況はまだ実験的な段階です。\n\n- Lumina — Lumina は Qt 5 で書かれた FreeBSD 向けの軽量なデスクトップ環境です。ウィンドウの管理には Fluxbox を使っています。\n\n- Maui Shell — Maui Shell は、デスクトップ、タブレット、携帯電話のための収束型シェルです。\n\n- Moksha — Enlightenment のフォークで、Ubuntu ベースの Bodhi Linux でデフォルトのデスクトップ環境として使われています。オプションのモジュールもあり。\n\n- PaperDE — Qt/Wayland と wayfire の上に構築されたデスクトップ環境です。\n\n- plainDE — Qt で記述された軽量の GNU/Linux デスクトップ環境です。今のところ、パネルとコントロールセンターが含まれます。\n\n- Plasma Mobile — Plasma Mobile はモバイル端末に焦点を当てたデスクトップ環境です。KDE Plasma スタックと Wayland の上に構築されています。\n\n- theDesk — theDesk は、できる限りユーザーの邪魔をしないように設計されたデスクトップ環境です。ウィジェットツールキットとして Qt 5 を、ウィンドウマネージャとして KWin を使用します。\n\n- Trinity — Trinity Desktop Environment (TDE) プロジェクトは KDE 3.5 のスタイルを維持するという目的から始まった Unix ライクなオペレーティングシステム向けのデスクトップ環境です。\n\n"
    },
    {
      "title": "別のウィンドウマネージャを使う",
      "level": 2,
      "content": "使用しているデスクトップ環境の記事が存在する場合、その記事の 別のウィンドウマネージャを使う のセクション (あるいは類似のセクション) を見てください。あるいは、公式のドキュメントを参照してください。\n\n- Budgie#別のウィンドウマネージャを使う\n- Cinnamon#別のウィンドウマネージャを使う\n- GNOME#別のウィンドウマネージャを使う\n- Plasma#別のウィンドウマネージャを使う\n- LXDE#別のウィンドウマネージャを使う\n- LXQt#別のウィンドウマネージャを使う\n- MATE#別のウィンドウマネージャを使う\n- Xfce#別のウィンドウマネージャを使う\n\n"
    },
    {
      "title": "カスタム環境",
      "level": 2,
      "content": "完全なグラフィカル環境を構築するのに一番簡単な方法がデスクトップ環境です。しかし、ユーザーは人気のあるデスクトップ環境（とその依存コンポーネント）を使わずにも様々な方法でグラフィカル環境を作成・カスタマイズすることができます。一般的に、カスタム環境の作成は、最適なウィンドウマネージャやコンポジタ、タスクバー、その他雑多なアプリケーション (最小限度必要なソフトウェアとしてターミナルエミュレータ、ファイルマネージャ、テキストエディタなど) の選択によります。\n\n通常デスクトップ環境により提供される他のコンポーネントとしては:\n\n- アプリケーションランチャー\n- オーディオ制御\n- バックライト制御\n\n- コンポジタ\n- デフォルトアプリケーション\n- ディスプレイマネージャ\n- ログアウトダイアログ\n- メディア制御\n- 通知デーモン\n- Polkit 認証エージェント\n- 電源管理\n- スクリーンキャプチャ\n- スクリーンロッカー\n- スクリーンの色温度\n- 壁紙設定\n\n"
    }
  ]
}