{
  "title": "本地镜像",
  "url": "https://wiki.archlinux.org/title/%E6%9C%AC%E5%9C%B0%E9%95%9C%E5%83%8F",
  "sections": [
    {
      "title": "Adding a new mirror",
      "level": 2,
      "content": "This text should outline the procedure for adding a new mirror for Arch packages.\n\n"
    },
    {
      "title": "Notes about private mirrors",
      "level": 2,
      "content": "- Bandwidth is not free for the mirrors. They must pay for all the data they serve you This still applies although you pay your ISP A full mirror is over 50 GiB in size\n- There are many packages that will be downloaded that you will likely never use\n- Mirror operators will much prefer you to download only the packages you need\n- Really please look at the alternatives listed in pacman/Tips and tricks#Network shared pacman cache before setting up a private mirror\n\n- This still applies although you pay your ISP\n- A full mirror is over 50 GiB in size\n\n"
    },
    {
      "title": "2-tier mirroring scheme",
      "level": 2,
      "content": "Due to the high load and bandwidth limits Arch Linux uses 2-tier mirroring scheme.\n\nThere are few tier 1 mirrors that sync directly from archlinux.org every hour.\n\nAll other mirrors should sync from one of tier 1 mirrors. Syncing from archlinux.org is not allowed.\n\n"
    },
    {
      "title": "Tier 2 requirements",
      "level": 3,
      "content": "- Disk-space >= 100 GiB\n- Sync off a tier 1 mirror (see https://archlinux.org/mirrors/tier/1/)\n- Sync all contents of the upstream mirror (i.e. do not sync only some repositories)\n- Do not sync more often than every hour, but you should sync at least once a day\n- Sync on a random minute so it is more likely the requests will be spaced out with other mirrors\n- Use the following rsync options: -rlptH --safe-links --delete-delay --delay-updates\n- If you ever wish to send downtime notifications to our users, please use the arch-mirrors-announce list. You do not need to subscribe to be able to post.\n- http or https support\n\n"
    },
    {
      "title": "Tier 1 requirements",
      "level": 3,
      "content": "- Tier 2 requirements\n- Bandwidth >= 100 Mbit/s\n- rsync support\n- Proven reliability (be a tier 2 mirror for a while and have reasonable uptime, response to out-of-sync notifications etc.)\n\nYou can use rsync directly or the syncrepo-template.sh script as a starting point. Please note that the script tries to minimize load and bandwidth used (about 3 MiB of metadata for each rsync run as of 2018-03-01) in case there are no changes. Feel free to remove this check if you do not sync very often or your upstream mirror does not provide the lastupdate file.\n\n"
    },
    {
      "title": "Create a feature-request",
      "level": 3,
      "content": "Go to https://gitlab.archlinux.org/archlinux/arch-mirrors/-/issues and create a feature-request containing the following information:\n\n- Mirror domain name\n- Geographical location of the mirror (country)\n- URLs for supported access methods (http(s), rsync) (no ftp)\n- Your mirror's available bandwidth\n- An administrative contact email (optional, see below)\n- An alternative administrative contact email (optional)\n- (tier 1 mirrors) Rsync IPs so your server(s) can be allowed to sync off tier 0 (rsync.archlinux.org)\n- (tier 2 mirrors) The name of tier 1 mirror you are syncing from. You can find available tier 1 mirrors in https://archlinux.org/mirrors/tier/1/\n\nThe contact email(s) will be used by Arch Linux staff to contact the mirror administrator if they have questions regarding the mirror or if there are problems with the mirror. If a contact email is not provided, the mirror listing may be removed at any time, especially if problems occur, without prior contact to the admin.\n\nIf the mirror administrator is adding or modifying a URL to an already existing mirror, they can specify so in the request with the link to the existing mirror.\n\n"
    },
    {
      "title": "Contact info and mailing lists",
      "level": 3,
      "content": "Feel free to join the arch-mirrors mailing list which can be used for general discussion about our mirrors. If you want to inform our users about downtime of your mirror please use the arch-mirrors-announce mailing list. You do not need to subscribe to be able to post to arch-mirrors-announce.\n\nIf you want to reach the Arch Linux staff for questions, you can either use the arch-mirrors list, you can open a bug report on our tracker or you can send a mail to mirrors@archlinux.org.\n\n"
    },
    {
      "title": "The Arch Linux side",
      "level": 2,
      "content": "- Add the mirror info to the Django admin site\n- Regenerate the rsync whitelist with the gen_rsyncd.conf.pl script - only for tier 1 mirrors, or when disabling access to a previously untiered mirror (also done by an hourly cronjob)\n- Regenerate the pacman-mirrorlist package\n\n"
    },
    {
      "title": "Mirror size",
      "level": 2,
      "content": "To give you an impression how much space will be needed for a mirror here are some numbers (as of 2023-05-23):\n\nMandatory:\n\n- pool (all packages) - 80 GiB\n- repositories (core, core-testing, extra, extra-testing, gnome-unstable, kde-unstable, multilib, multilib-testing) - total ~200 MiB\n\nOptional:\n\n- iso - 5 GiB (encouraged)\n- archive - 15 GiB (permanently frozen)\n- other - 18 GiB\n- sources - 114 GiB\n- images - 6 GiB\n- wsl - 500 MiB\n- pool/*-debug - 60 GiB (will likely grow in the future)\n\nMost mirrors do not sync archive, other and sources directories, but sync everything else (including temporary repositories), so usually you will need about 70 GiB reserved for Arch Linux mirror.\n\nHowever, note that the required space may temporarily increase when a big rebuild happens and thus many packages exist twice in different versions. Please plan in a buffer of 30 GiB to 50 GiB on top of the above mentioned values.\n\n"
    }
  ]
}