{
  "title": "羅技木星軌跡球",
  "url": "https://wiki.archlinux.org/title/%E7%BE%85%E6%8A%80%E6%9C%A8%E6%98%9F%E8%BB%8C%E8%B7%A1%E7%90%83",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThe Logitech Marble Mouse is a pointing device with four buttons and a trackball, also known as the Trackman Marble. The Marble Mouse is usable either left- or right-handed. It requires some configuration to enable scrolling with the trackball. For a detailed image, see: Logitech Marble Mouse (or here).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "The mouse is detected at boot time or whenever it is \"hot-plugged\" into a booted system, automatically. No special installation is required.\n\n"
    },
    {
      "title": "Sample Configurations",
      "level": 2,
      "content": "For additional information about available options, see libinput(4) § CONFIGURATION DETAILS.\n\n"
    },
    {
      "title": "libinput",
      "level": 3,
      "content": "GDM 3.16 and XFCE 4.12 use libinput. The following configuration steps are known to work as of Jan 23, 2019:\n\n1. Install xf86-input-libinput\n1. Edit /etc/X11/xorg.conf.d/10-libinput.conf.\n1. Append the following content:\n\n```\nSection \"InputClass\"\n  Identifier   \"Marble Mouse\"\n  MatchProduct \"Logitech USB Trackball\"\n  Driver       \"libinput\"\n  Option       \"ScrollMethod\"    \"button\"\n  Option       \"ScrollButton\"    \"8\"\n  Option       \"MiddleEmulation\" \"true\"\nEndSection\n```\n\nThis:\n\n- Enables horizontal and vertical scrolling by pressing and holding the small left button while moving the trackball.\n- Enables chord-clicks by pressing the two large buttons simultaneously.\n- Uses the small left button for browsing back.\n- Uses the small right button for browsing forward.\n\nOr append:\n\n```\nSection \"InputClass\"\n  Identifier    \"Marble Mouse\"\n  MatchProduct  \"Logitech USB Trackball\"\n  Driver        \"libinput\"\n  Option        \"ScrollMethod\"        \"button\"\n  Option        \"ScrollButton\"        \"9\"\n  Option        \"MiddleEmulation\"     \"true\"\n  Option        \"HorizontalScrolling\" \"false\"\n  Option        \"ButtonMapping\"       \"1 2 3 4 5 6 7 9 8\"\nEndSection\n```\n\nThis:\n\n- Enables vertical scrolling by pressing and holding the small right button while moving the trackball.\n- Disables horizontal scrolling.\n- Enables chord-clicks by pressing the two large buttons simultaneously.\n- Uses the small left button for browsing forward.\n- Uses the small right button for browsing back.\n\n"
    },
    {
      "title": "Basic function",
      "level": 2,
      "content": "Hardware IDs for the Marble Mouse buttons remain constant, regardless of device configuration.\n\nWhen no additional configuration is specified, buttons are mapped to these functions:\n\nTable content:\nID | Hardware Action | Result\n1 | Large button left | normal click\n2 | Both large buttons | middle-click †\n3 | Large button right | right-click\n4 | (not a button) | -\n5 | (not a button) | -\n6 | (not a button) | -\n7 | (not a button) | -\n8 | Small button left | browser back\n9 | Small button right | browser forward\n\nNote: **middle-click** \n\n- Both large buttons pressed simultaneously creates a middle-click.\n- † The simultaneous click is enabled by a configuration directive. It requires Emulate3buttons.\n- Terms middle-click and wheel-click are used interchangeably in this document.\n- Alternate-click may be used instead of right-click. Typically, this pops up a context menu.\n- The result shown above occurs when no modifier key is pressed.\n- A different result may occur when a modifier key such as Ctrl is held while a button is clicked.\n\nTable content:\nID | Hardware Action | Result\n4 | Roll ball down | move cursor down\n5 | Roll ball up | move cursor up\n6 | Roll ball left | move cursor left\n7 | Roll ball right | move cursor right\n\n- Cursor motion occurs when no modifier is used.\n- A modifier used in conjunction with rolling motion may create an alternate result.\n- \"Modifier\" refers to a key (such as Ctrl) or button (as in mouse button) being held while the trackball is rolled.\n\nNote: **scroll mod­ifier** \n\nUsing the trackball in \"wheel mode\" can require some unusual gestures on the user's part. Using a wheel mouse, for example, you can resize the display font in your web browser using the Ctrl + wheel_roll gesture. With the trackball, this operation becomes Ctrl + hold_button + ball_roll.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "You may find it helpful to simply jump to the sample configuration and try it.\n\nThe configuration sections contain information which may not be of interest to you. Most Arch users will be using a modern version of the X server which requires udev hot plugging.\n\nGnome 3 is used, for example, in Ubuntu 12.04.\n\n"
    },
    {
      "title": "Buttons and trackball",
      "level": 3,
      "content": "After you locate the sample configuration file you may wish to alter it. You need only concern yourself with three or four setup lines.\n\n"
    },
    {
      "title": "Assigning buttons",
      "level": 4,
      "content": "You may want to assign new actions for button presses. This is done by setting positional parameters.\n\nValues may be changed for buttons 1, 2, 3, 8, and 9. (Button 2 is simply a combination press of the two large buttons.) Do not alter parameters 4, 5, 6, or 7.\n\n```\n# This line makes the default button assignments.\n\nOption \"ButtonMapping\" \"1 2 3 4 5 6 7 8 9\"\n```\n\nOne obvious reason to assign different button actions is to accommodate left-handed placement:\n\n```\n# This line switches the left and right large buttons, and nothing else. For left-handed user.\n\nOption \"ButtonMapping\" \"3 2 1 4 5 6 7 8 9\"\n```\n\nAnother reason to reassign is when you do not like the \"normal\" assignments — especially the small buttons.\n\nThe line below changes the button 2 action to browser forward. Parameter two (both-large-button click) is given value 9 for browser forward. The line below also reassigns both small buttons. We want them to emit middle-click. (Either button may be clicked separately.) Parameters eight and nine are given values of 2 for middle-click.\n\n```\n# Three buttons are given new assignments. For right-handed user.\n\nOption \"ButtonMapping\" \"1 9 3 4 5 6 7 2 2\"\n```\n\nParameters are positioned in numeric order. Parameters you might modify are 1, 2, 3, 8, and 9. Parameters 4, 5, 6, and 7 should be left alone; they correspond to trackball movements.\n\n"
    },
    {
      "title": "\"Both-large-buttons\" combination-click",
      "level": 4,
      "content": "As stated, button 2 is a simultaneous press of the two large buttons.\n\nExperimentation shows, in the absence of a configuration directive, this action produces an indeterminate result. It appears to issue some command, but the result is inconsistent with my expectation of middle-click. The result seems dependent on whichever object is foremost. It is inconsistent regardless. You need to enable the combination-click:\n\n```\n# Emulate3Buttons refers to the act of pressing buttons A and D\n# simultaneously to emulate a middle-click or wheel click.\nOption \"Emulate3Buttons\" \"true\"\n```\n\nThis is sufficient to enable the default mapping of button 2, which is wheel-click. See minimal configuration.\n\nAs at May 2012, there is an issue with Gnome 3 and middle click emulation. Gnome 3 is used, for example, in Ubuntu 12.04. Gnome 3 also sets the middle click property, and defaults to \"false\". Since Gnome does its settings after Xorg, the Gnome setting overrides the xorg setting, and emulation is disabled. The Gnome setting can be changed with this command:\n\n```\ngsettings set org.gnome.settings-daemon.peripherals.mouse middle-button-enabled true\n```\n\nYou only need to do this once (per user) as Gnome remembers the settings between sessions. There is a launchpad bug on the issue in case you are interested.\n\n"
    },
    {
      "title": "Scroll modifier",
      "level": 4,
      "content": "One huge limitation for the Marble Mouse is the lack of a scroll wheel or scroll ring. This limitation is overcome by assigning a scroll modifier: a mouse button which allows the trackball to scroll. When the scroll modifier is held, the trackball scrolls. Although a scroll modifier is assigned by default (see basic function), the scroll modifier is not enabled by default. In addition to enabling the scroll modifier, you may also assign it to a different button.\n\nThe standard scroll setting defines the small button for scrolling — that is good, — but the same button has a default \"click\" action that is browser back. A better choice is middle-click. Middle-click corresponds to what you would expect from years of wheel mouse usage.\n\nPutting complaints aside (these are addressed by reassigning small buttons), you specify a button to be the scroll modifier:\n\n```\nOption \"EmulateWheel\" \"true\"\nOption \"EmulateWheelButton\" \"8\"\n\n# Button 8 is the small button on the left side, which works well for right-handed users.\n# Button 9 is the small button on the right side, which works well for left-handed users.\n# Button 2 cannot be assigned as the scroll modifier; AKA \"EmulateWheelButton\".\n```\n\nDisable horizontal scrolling\n\nA particular configuration line enables horizontal scrolling. You disable horizontal scrolling by commenting that line out.\n\n```\n# A hash mark disables a configuration line.\n\n# Option \"XAxisMapping\" \"6 7\"\n```\n\nI use both scrolling directions, but some may find this restriction helpful. You cannot disable vertical scrolling in a similar fashion — not that you would want to, anyway.\n\n"
    },
    {
      "title": "Right-side or left-side",
      "level": 3,
      "content": "Previous sections explain how to modify your configuration file for either left or right placement.\n\n- On occasion, you may wish to switch between left-handed and right-handed usage.\n- I do this when I feel the early signs of repetitive strain injury.\n\nTo switch to the opposite placement, I manually edit my configuration file and restart the X server. Comments in the file remind me which lines to change. You could devise a script to make switching more automatic, if you wanted to.\n\n- With Arch Linux, I prefer a lightweight or non-existent desktop environment running the Openbox window manager.\n\nOther desktop environments may have widgets to simplify — or complicate, depending how you view it — switching between right and left. With Ubuntu 10.10, for example, you need only mark a box in the mouse control panel to effect a button switch. (You must change the configuration file to get the correct scroll modifier assignment, however. Also, Ubuntu ignores large button assignments in the configuration file; the control panel makes them unnecessary.)\n\n"
    },
    {
      "title": "System-wide or per-user",
      "level": 3,
      "content": "If you want the configuration to be system wide, you can add this line to the InputDevice-Section.\n\n```\nOption \"ButtonMapping\" \"1 8 3 2 9\"\n```\n\nFor a per-user-configuration you need to put this in your ~/.xinitrc.\n\n```\nxinput set-button-map \"Logitech USB Trackball\" 1 8 3 4 5 6 7 2 9 10 11 12 13\n```\n\n"
    },
    {
      "title": "Xorg input hotplugging",
      "level": 3,
      "content": "Two expositions help you configure a trackball with buttons for click, middle-click, right-click, and scrolling. The first exposition uses Xorg Input Hotplugging; the second does not. Edit them to suit your preferences.\n\nAdd this entry to your /etc/X11/xorg.conf:\n\n```\nSection \"InputClass\"\n    Identifier   \"Logitech Trackball\"\n    MatchProduct \"Trackball\"\n    Option       \"ButtonMapping\"      \"1 8 3 4 5 6 7 2 9\"\n    Option       \"EmulateWheel\"       \"True\"\n    Option       \"EmulateWheelButton\" \"9\"\n    Option       \"XAxisMapping\"       \"6 7\"\nEndSection\n```\n\nTo learn more about the used parameters you should read evdev(4) § CONFIGURATION DETAILS.\n\n"
    },
    {
      "title": "Without Xorg hotplugging",
      "level": 3,
      "content": "The mouse device entry in /etc/X11/xorg.conf should look like this:\n\n```\nSection \"InputDevice\"\n    Identifier \"Mouse0\"\n    Driver     \"mouse\"\n    Option     \"CorePointer\"\n    Option     \"Device\"             \"/dev/input/mice\"\n    Option     \"Protocol\"           \"ExplorerPS/2\"\n    Option     \"Buttons\"            \"9\"\n    Option     \"ZAxisMapping\"       \"4 5\"\n    Option     \"XAxisMapping\"       \"6 7\"\n    Option     \"EmulateWheelButton\" \"9\"\n    Option     \"EmulateWheel\"       \"true\"\nEndSection\n```\n\nThe \"Auto\" option for \"Protocol\" works fine, too. Of course you can use the name you prefer as the Identifier, as long as it is the same you use as InputDevice in the Section \"ServerLayout\".\n\n"
    },
    {
      "title": "GNOME 3 and Wayland",
      "level": 3,
      "content": "When running Wayland, the aforementioned configuration files have no effect. GNOME 3 does, however, provide a limited set of configuration options for enabling mouse wheel emulation and adjusting the acceleration behaviour of the mouse cursor.\n\nThese settings are also available via dconf under /org/gnome/desktop/peripherals/trackball/\n\n"
    },
    {
      "title": "Middle-click emulation",
      "level": 4,
      "content": "To enable the combination of left and right buttons to emulate a middle-click, enter\n\n```\ngsettings set org.gnome.desktop.peripherals.trackball middle-button-emulation true\n```\n\n"
    },
    {
      "title": "Mouse wheel emulation",
      "level": 4,
      "content": "GNOME provides the option to assign a scroll modifier button. To do this, enter\n\n```\ngsettings set org.gnome.desktop.peripherals.trackball scroll-wheel-emulation-button <button_id>\n```\n\n, where <button_id> is the id of the mouse button that should act as the modifier (see basic function). To deactivate mouse wheel emulation, set this to 0.\n\n"
    },
    {
      "title": "Acceleration profile",
      "level": 4,
      "content": "The trackball can be configured to either use a \"flat\" or \"adaptive\" acceleration profile or to just use its \"default\" one. To do that, set\n\n```\ngsettings set org.gnome.desktop.peripherals.trackball accel-profile <profile>\n```\n\nto the desired value.\n\n"
    },
    {
      "title": "Sway and Wayland",
      "level": 3,
      "content": "When running Wayland, the aforementioned configuration files have no effect. Sway provides a limited set of configuration options for enabling mouse wheel emulation and adjusting the acceleration behaviour of the mouse cursor. In your sway configuration file, add the following section to enable scrolling with the marble while the small left button is pressed:\n\n```\ninput \"1133:50184:Logitech_USB_Trackball\" {\n    scroll_method on_button_down\n}\n```\n\n"
    },
    {
      "title": "Hyprland",
      "level": 3,
      "content": "Hyprland also supports a limited set of options for wheel emulation. Add the following block your configuration:\n\n```\nhyprland.conf\n```\n\n```\ndevice {\n    name = logitech-usb-trackball\n    scroll_method = on_button_down\n}\n```\n\nYou can also configure on_button_up or edge per the Hyprland input documentation.\n\nThe middle click emulation when clicking both the left mouse button and the right mouse button simultaneously seems to work without additional configuration.\n\n"
    },
    {
      "title": "Plasma and Wayland",
      "level": 3,
      "content": "When running a Plasma Desktop session in Wayland, you can configure scrolling with qdbus, you just have to find the right event number, which you can determine from /dev, for example:\n\n```\nevent=\"$(basename $(readlink /dev/input/by-id/usb-Logitech_USB_Trackball-event-mouse))\"\nqdbus org.kde.KWin /org/kde/KWin/InputDevice/$event org.kde.KWin.InputDevice.scrollOnButtonDown true\n```\n\nBy default the small left button is used. If you want to use the small right button, set\n\n```\nqdbus org.kde.KWin /org/kde/KWin/InputDevice/$event org.kde.KWin.InputDevice.scrollButton 276\n```\n\nFor other buttons, follow the table below:\n\nTable content:\nButton | Kwin button code | Function (default)\nLarge button left | 272 | normal click\nLarge button right | 273 | right click\nSmall button Left | 275 | browser forward\nSmall button right | 276 | browser back\n\n"
    },
    {
      "title": "Sample configuration",
      "level": 2,
      "content": "The sample configuration modifies and extends the basic function of the Marble Mouse.\n\nIn this example, either of the two small buttons may be clicked to send a wheel-click. Wheel-click means the same as \"middle-click\" here. In addition, one of the small buttons provides scrolling in conjunction with the trackball. Note that only one small button has the ability for scrolling, although both small buttons are able to wheel-click.\n\nFinally, clicking both large buttons simultaneously sends the browser back event. There is no button to send browser forward.\n\nTable content:\nID | Hardware Action | Result (this configuration) | New assignment\n1 | Large button left | normal click | 1\n2 | Both large buttons | browser back | 8\n3 | Large button right | right-click | 3\n8 | Small button left † | wheel-click | 2\n9 | Small button right ‡ | wheel-click | 2\n\n- Both large buttons pressed simultaneously results in browser back.\n- Either small button, when clicked, results in middle-click.\n- † This small button allows trackball scrolling when held down. It is the scroll modifier.\n- ‡ This button can be mapped for scrolling function instead. This button works better for left-side placement because it lies near the thumb of one's left-hand. Only one button can be assigned as the scroll modifier as far as I know.\n\n"
    },
    {
      "title": "Configuration file",
      "level": 3,
      "content": "The following lines are appended to /etc/X11/xorg.conf.d/10-evdev.conf\n\nNote: Users of other Linux distributions may find the configuration file in another location. Ubuntu uses /usr/share/X11/xorg.conf.d/10-evdev.conf\n\nThis example is set up for right-hand placement with horizontal scrolling disabled.\n\n```\n#       - - - Logitech Marble Mouse Settings - - -\n#\n#       The Logitech Marble Mouse buttons are mapped [A-D] from left to right: \n#       A (large); B (small) |  C (small); D (large). \n#\n#       Preferred options for right-handed usage:\n#       A = normal click [1]  \n#       B = middle-click [2] \n#       C = middle-click [2] \n#       D = right-click [3]\n#       Hold button B while rolling trackball to emulate wheel-scrolling. \n#\n#       Preferred options for left-handed usage:\n#       A = right-click [3]  \n#       B = middle-click [2] \n#       C = middle-click [2]\n#       D = normal click [1]\n#       Hold button C while rolling trackball to emulate wheel-scrolling.\n#       Pressing both large buttons simultaneously (b) produces a \"back\" action.\n\nSection \"InputClass\"\n        Identifier  \"Marble Mouse\"\n        MatchProduct \"Logitech USB Trackball\"\n        MatchIsPointer \"on\"\n        MatchDevicePath \"/dev/input/event*\"\n        Driver \"evdev\"\n\n#       Physical button #s:     A b D - - - - B C    \n#       Option \"ButtonMapping\" \"1 8 3 4 5 6 7 2 2\"   right-hand placement\n#       Option \"ButtonMapping\" \"3 8 1 4 5 6 7 2 2\"   left-hand placement\n#       b = A & D \n        Option \"ButtonMapping\" \"1 8 3 4 5 6 7 2 2\"\n\n#       EmulateWheel: Use Marble Mouse trackball as mouse wheel \n#       Factory Default: 8; Use 9 for right side small button\n        Option \"EmulateWheel\" \"true\"\n        Option \"EmulateWheelButton\" \"8\"\n\n#       EmulateWheelInertia: How far (in pixels) the pointer must move to\n#       generate button press/release events in wheel emulation mode.\n#       Factory Default: 50\n        Option \"EmulateWheelInertia\" \"10\"\n\n#       Axis Mapping: Enable vertical [ZAxis] and horizontal [XAxis] scrolling\n        Option \"ZAxisMapping\" \"4 5\"\n#       Option \"XAxisMapping\" \"6 7\"\n\n#       Emulate3Buttons: Required to interpret simultaneous press of two large\n#       buttons, A & D, as a seperate command, b.\n#       Factory Default: true\n        Option \"Emulate3Buttons\" \"true\"\nEndSection\n```\n\n"
    },
    {
      "title": "Restarting X",
      "level": 3,
      "content": "Changes made to xorg configuration files do not take effect until the X session is restarted. To restart the X session, simply log out from your window manager and log back in.\n\n"
    },
    {
      "title": "Using evdev",
      "level": 3,
      "content": "At times it can be useful to start with the absolute minimum and build from there. This is one facet of The Arch Way. In this spirit, I decided to see how few lines I might use to create a usable Marble Mouse configuration.\n\nYou can omit all configuration lines and the Marble Mouse is still usable for basic pointing and clicking. However, it will not be able to scroll. The \"both-large-button\" simultaneous click produces indeterminate results — experimentation shows this.\n\nGiven that you are satisfied with default button settings and you wish only to enable scrolling and the \"both-large-button\" click, you need these lines. The following lines are appended to /etc/X11/xorg.conf.d/10-evdev.conf.\n\n```\nSection \"InputClass\"\n        Identifier  \"Marble Mouse\"\n        MatchProduct \"Logitech USB Trackball\"\n        Option \"EmulateWheel\" \"true\"\n        Option \"EmulateWheelButton\" \"8\"\n        Option \"XAxisMapping\" \"6 7\"\n        Option \"Emulate3Buttons\" \"true\"\nEndSection\n```\n\n"
    },
    {
      "title": "Console (gpm)",
      "level": 3,
      "content": "See Console mouse support for details. Within the console you can use gpm with type option set to imps2. Edit /etc/conf.d/gpm such that:\n\n```\nGPM_ARGS=\"-m /dev/input/mice -t imps2\"\n```\n\nThis lets you use the large left button for selecting text and the right button to extend the selection. The small left button acts as a middle-click; it pastes the selection.\n\n"
    },
    {
      "title": "Firefox browser",
      "level": 3,
      "content": "Older versions of Firefox map horizontal-scrolling hardware to perform browser back and browser forward navigation.\n\nThis makes vertical scrolling using the trackball almost impossible.\n\nThe slightest horizontal motion triggers a URL redirection. To fix this:\n\n- Enter about:config in the location bar\n- Find the internal variable named mousewheel.horizscroll.withnokey.action. Set its value to 0.\n- It may be useful to set mousewheel.horizscroll.withnokey.numlines to 1 as well.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Arch wiki documentation: All Mouse Buttons Working\n- Arch wiki documentation: Xorg#Configuration\n- Marble mouse scroll wheel: Replacement for SetPoint driver\n- Joe Shaw blog post: Linux input ecosystem\n- Ubuntu community: Logitech Marble Mouse\n- Chrome web store: AutoScroll extension\n\n"
    }
  ]
}